{"Context": "My favorite sports team is Arsenal. UK Premier League Football Club EOS So The football club you apart of sounds really intertesting. can you tell me more about it EOS Yes, I am a big fan of the club, I hope we can win some trophies over the next couple of years! EOS That would be awsome im sure! I heard they one 8 football association titles cups. thats pretty amazing! EOS Yeah it really is something. We haven't won the league in a while but the way we have been playing I am sure things can change. EOS That would be really great!  I really love to watch the football games too. the arsenal is a great team EOS Well if you're ever visiting London maybe you can make that a reality! It will be a great experience you won't forget. EOS I agree. It really will be. I think the NFL will be coming back to london for the season. Wembley stadium and Tottenham hotspur stadium. EOS That's right, I'd love to go and see a game, I bet some great NFL teams have played in London!", "Knowledge": "The league followed up with another game in London during the 2008 season which featured the New Orleans Saints defeating the San Diego Chargers 37-32, the year before the Saints would win Super Bowl XLIV over the Indianapolis Colts, 31-17. The next four seasons represented a continuation of the one game per year format until the series expanded to two games in 2013. That year the crowd was treated to a San Francisco 49ers team that was fresh off a 34-31 loss in Super Bowl XLVII to the Baltimore Ravens. The 49ers would again make a deep run in the playoffs that year, losing a close game to the eventual Super Bowl champion Seattle Seahawks in the NFC Championship game, 23-17. After great success with two games at Wembley, the NFL quickly expanded to three games in 2014.", "Response": "I think the New Orleans Saints and the ravens played there if i'm not mistaken"}
{"Context": "My favorite sports team is afc wimbledon. where i hold a season ticket EOS What do you think our chances of avoiding relegation this year? EOS Oh man not looking good! You need 6 points to even equal Bradford....and that still gets you to 23rd out of 24th. BUT with another two wins, you're up to 15th! It will be close. Have you gone to any games lately? Where are your seats? EOS I've got a season ticket for behind the goals, same place as I used to stand at Kingsmeadow. I guess there's 14 games left but even if we stay up do you think Joe Piggott is going to stay or will he look for a move in the summer? EOS Well I have no idea how long his contract is because they didn't say the length when he signed! He's so good though huh? Scored on debut, and he's fairly young at 27...in his prime. I think we have to do everything we can to hang onto him. EOS Contracts don't really matter though these days, especially if a bigger club comes in. Question is who do we try to sign to replace him..... EOS I wonder if we try and get someone from Sunderland, Accrington or Coventry. They all seem like great teams that score lots of goals...who do you think we'll get? EOS If history is anything to go by then some unknown on a free transfer from the national league I guess. We could do with a keeper as well, can't just hope to get a decent one on loan every year! EOS Who do we have in goal now? Is McDonnell our first choice or Shea? Or someone else? EOS It's Tzanev at the moment but has been Walker most of the season", "Knowledge": "", "Response": "Who is better do you think?"}
{"Context": "My favorite artist is Bruno Mars. He makes perfect songs just about everytime! EOS I am such a fan of Bruno Mars new song, have you heard it?", "Knowledge": "Stream/Download: https://cardib.lnk.to/Pleas... I just want to take you higher", "Response": "which song are you talking about? Didn't he do a song with Cardib?"}
{"Context": "My favorite hobby is cooking. i grew up cooking with my mom and gram EOS What is your favorite food to cook? I've found a good recipe with brussel sprouts and sausage. EOS That sounds delicious. I love to cook stews and meats that take hours to cook. What is that recipe? EOS Brussel and sausage sauteed, add onions and garlic and roast. Does that sound like something you would cook? EOS Yes it does, My mother would love that. She is the rea pork fan in the family. I really love beef more. I also love brussel sprouts although I don't cook them enough. I have chopped them with bacon ans scallions before and that is really good. EOS Do you have any other hobbies? EOS Yes i love to garden. I cant wait till spring to plant all my seedlings outside. EOS What sorts of plants will you be planting in your garden? Some bluebells? EOS I have never grown them. I focus on veggies. I will be transplanting tomatoes and pepper plants. EOS What a great choice of veggies. Tomatoes can be hard to grow. They need plenty of room and direct light. EOS Yes actually I learned that last year. I crowded the tomatoes and they barelt made fruit.", "Knowledge": "Our Best Tomato Recipes Green Tomato Salsa Verde", "Response": "This fits well with your cooking hobby. Tomatoes are in so many recipes. Even green tomatoes can be eaten."}
{"Context": "My favorite author is dwayne johnson. i can donate blood every two weeks EOS can you smellllllll what the rock is cooking? EOS no i can't, what do you know about Dwayne Johnson EOS i know that his alter ego was the rock from WWE.  do you know any facts? EOS do you know He’s Got Dual Citizenship EOS i did not, where else is he a citizen EOS Canada and the united states, have you heard of jumanji? EOS yes, i've played that board game before.", "Knowledge": "Search for  Jumanji: Welcome to the Jungle  on Amazon.com", "Response": "i mean Jumanji: Welcome to the Jungle the movie"}
{"Context": "My favorite sports team is The utah Jazz. The have had some great players they deserve a championship EOS The Jazz have had some great players the organization deserves a title. EOS If you want to keep in touch with more details about The Jazz Subscribe to Jazz News and help support the community! EOS The Jazz do a great job supporting the community the 5 for the fight is a great example. EOS You can show support by wearing The Jazz Color Code of Dark Navy, Green, Yellow and White! EOS Yes, they have added some colors but the traditional ones are purple green and gold. EOS Utah Jazz has continued to crush its TV ratings and definitely deserves a tittle! EOS Yes they have been very entertaining this year.  The young stars have really stepped up. EOS I hear Kyle Korver was traded for the duo Ricky Rubio and Donovan Mitchell EOS Well Korver was traded for Rubio but the Jazz traded Trey Lyles for the pick that became Mitchell.", "Knowledge": "While Mitchell carried the offense, Rudy Gobert is the anchor of the Utah defense. He finally won Defensive Player of the Year last season, an award he could have one in each of the past three seasons. As a dominant shot blocker and an excellent finisher around the rim, the Stifle Tower is undoubtedly one of the best centers in the league.", "Response": "Yes while Rudy Gober is Utah's defense, Mitchell carries the team as the offense"}
{"Context": "My favorite athlete is Hendra Setiawan. Most players already retired when they are 3-6 younger than him, yet he is still World no.2.  EOS Are you familiar with badminton? EOS I have some basic knowledge on the sport. Do you follow any particular players? EOS My favorite badminton player is Hendra Setiawan from Indonesia. Have you heard of him?", "Knowledge": "Born on 25th August 1984 in Pemalang, Hendra Setiawan is a prominent badminton player from Indonesia who competes in doubles. He has won the World Championships three times (2007, 2013 and 2015).", "Response": "I have. Setiawan's many wins and accomplishments are very impressive."}
{"Context": "My favorite item recently bought is a cape. that I will wear when I next host my magic show EOS Have you seen any interesting magical illusions lately? EOS I haven't recently, but I would love to see one. What is your favourite magic trick? EOS I really like the moving deck of cards trick, where I use a pad of paper with a moving drawing of a card EOS I've never seen that one, it sounds awesome though. Who are your favourite magicians? I like David Copperfield and Doug Henning. EOS Oh nice! I really like Derek Delgaudio right now", "Knowledge": "Derek DelGaudio takes illusionism to new conceptual heights. The magician Derek DelGaudio sat in a Hollywood art gallery with several decks of cards before him. It was a February evening in 2011, and he faced a well-dressed audience of art-world people, whom he was keen to impress. Dressed in a black suit and matching Converse All-Stars, he instructed an attendee to “time me for a minute.” As the countdown commenced, he began dealing the cards wordlessly, with such force and rapidity that they soon overspilled the table. He finished off one deck and started on another, then another. When time was up, DelGaudio announced, “184 seconds in one minute — thank you very much,” then stood and walked away. Trick, as it were, over.", "Response": "Is he an illusionist? I know he has a quirky sense of style, suits and converse, that kind of look. Who inspired your cape wearing, or is that something you started yourself?"}
{"Context": "My favorite actor is Nina Dobrev. She is nice and happy. She travels a lot. EOS Nina dropped out of college to continue to act. I can't imagine how hard of a decision that must have been. EOS Yes, I think so. However she is a good actress. Don't you think?", "Knowledge": "Dobrev speaks English, French and Bulgarian. While filming \"The Vampire Diaries\", Dobrev lived in Atlanta, but moved to Los Angeles after leaving the series in 2015.", "Response": "She is! She has appeared on some very popular shows and movies!"}
{"Context": "My favorite song is Fireflies by Owl City. It sounds best when played on a flute. EOS Your favorite song is Fireflies by Owl City, is that your favorite band too? EOS No, they're more of a one hit wonder for me. My favorite artist is Night Lovell. EOS Nice! I was going to say, I don't think I remember another song by Owl City, lol. Night Lovell is a rapper right? What kind of rap does he do - is it mumble rap? EOS Yeah he's rapper, but not mumble rap. It's follows a more underground rap style; kind of hard to put a lable on it. Have you heard any of his stuff or nah? EOS Nah, sadly I don't listen to too much rap. Reggae and Hawaiian reggae, or pretty much anything else. Last time I faithfully listened to rap, I memorized the words to Candy Man \"Knockin' Boots\" EOS Understandable, reggae is probably a bit more pleasing to the ear. I have't heard that sond by Candy Man though. I'll have to search it up and enlighten myself. EOS Yeah, Knockin Boots is over 30 years old but still fire. Lovell sounds good - do you own both of his albums EOS Nah, I generally listen to music via Spotify subscription. I have a couple CDs and vinyls, but they were all gifts from my older brother. EOS Keep the vinyls, they'll always be worth something. CDs, try to transfer those to your laptop or something, they'll deteriorate in time, haha. Spotify is dope. I never even realized until last year that you could listen to podcasts on there, changed my life! hahaha  You pay that fee to get ad free or nah? I can't bring myself to pay... EOS I didn't for the longest time, but I started paying for premium a couple years back once I could claim my student discount. It's only $5 and it comes with the lowest level Hulu subscription too. I figured why not.", "Knowledge": "$11.99 Per Month at Hulu Ad-Free", "Response": "It's only $5? I never knew, but that's monthly right? That's a good deal, considering a reg. subscription is nearly $12! But, if coming with Hulu is a good deal...there is always at least one awesome series exclusive to a streaming platform."}
{"Context": "My favorite tv show is The Good Place. loves that Eleanor is obsessed with shrimp EOS Have you seen any of Michael Schur's tv shows? I think they are hilarious. EOS You wanna hear something ironic, Michael Schur was born on the same day as me, 4 years earlier! LMAO - October 29, 1975. I didnt realize that he also created The Office and Parks & Rec... EOS Wow, you two share the same birthday! That's so cool. Yeah, he created so many shows. The Good Place is my favorite by far. The characters are so quirky. EOS I LOVE The Good Place, btw...started watching on NF last year. I lost track once they went back to Earth though EOS Oh, you haven't finished yet. There's so much to look forward, too. Don't worry: Eleanor continues to be obsessed with shrimp. Some things never change! EOS HAHAHAHA, I really like Chidee - I know I'm butchering the spelling of his name. Holy mother-forking shirtballs - I love that she loves shrimp and unlimited fro-yo EOS LOL OMG you are a fan! Yes, Eleanor is fabulous! What's your favorite thing about Chidi?", "Knowledge": "Chidi Anagonye is a principal character on The Good Place, portrayed by William Jackson Harper. Chidi is a kind and extremely intelligent individual. He is passionate about moral philosophy and ethics, constantly quoting famous philosophers and putting many of the scenarios he and others get into under a philosophical microscope. Chidi is easily prone to becoming anxious and nervous when under pressure, leading to him getting numerous stomach aches. He loves teaching.", "Response": "I mostly love his personality and that he's so neurotic! I mean, to say I relate is an understatement, lol.  But I appreciate that he's kind and intelligent, and that his passion for philosophy helped his friends become better people!"}
{"Context": "My favorite sports team is Utah Jazz. They have had so many great players they deserve to win a title. EOS The Utah Jazz has a pretty good line up this season! EOS They have been great this season, I think keeping the same team together for a few years is finally paying off. EOS They are very competitive this season! EOS It has made them very fun to watch. EOS I agree! Donovan Mitchell is so fun to watch, he has really been helping the team. EOS He has been great but so is Rudy Gobert, his contribution to the team is always over looked.", "Knowledge": "In 2019, Gobert became the first Jazz player to win the NBA s Defensive Player of the Year award since Mark Eaton in 1989, and in 2017 he was named to the All-NBA Second Team. He was a member of the NBA s All-Defensive First Team both seasons.", "Response": "Gobert was the first Jazz player to win the NBA's defensive player award back in 2019!"}
{"Context": "My favorite tv show is Suits. I love the show Suits! Makes me wish I had become a lawyer. EOS I'm on season 8 of Suits now, have you seen it yet?", "Knowledge": "", "Response": "I haven't yet. Is it a good?"}
{"Context": "My favorite clothing type is Nike. All of my sports clothing is from Nike. EOS Your favorite brand is Nike. What makes Nike so appealing to you? EOS Ever since I was young I liked their football trainers the best! I still prefer the style of their trainers.", "Knowledge": "On Soccer", "Response": "By football you mean soccer? And by trainers you mean running shoes? And by \"young\" you mean something I haven't been for a while? LOL"}
{"Context": "My favorite song is I love sad songs.. I always listening sad songs. EOS I love listening sad songs. EOS Yes-- sad music is known to be therapeutic and even mood boosting! EOS Yes.  Sad songs are always remaining our old memories.", "Knowledge": "Country and rock are America s favorite music genres, according to a recent CBS News Poll. With country registering as the favorite for 21% of poll respondents and rock 18%, the three-percent difference is within the poll s margin of error.", "Response": "Totally agree. Country and rock are America are the most popular genres, I wonder how emotional and sad music compare."}
{"Context": "My favorite hobby is learning to trade stocks. just got into it and learning all i can EOS do you know anything about trading stocks? EOS I know very little about trading stocks, but I’ve recently started trying to learn a bit about it because my husband is into it. EOS I just started a month ago. So I haven't learned too much yet. I feel like i've already learned the hard way of a few things not to do. EOS What have you learned the hard way so far? EOS Just ended up picking a stock that I thought was going to be down short term and now it's filed bankruptcy protection and has been delisted from the NYSE. I've lost just about all the money on it. So I'm going to hold long term and hope it turns around at some point. EOS What a bummer! Such as it goes with stock trading, I suppose. What broker do you use? EOS I use TD Ameritrade. my dad recommended it as being one of the better ones to use for beginners.", "Knowledge": "5 Top Online Stock Brokers 1. TD Ameritrade", "Response": "My husband also uses TD Ameritrade and has been really happy with them. Do you also have a retirement account through them?"}
{"Context": "My favorite song is My Love, Route 94. Jess Glynne is on this song and is a good singer. EOS Have you heard These Days by Rudimental, Macklemore, Jess Glynne, and Dan Caplen? EOS I have and I liked it. Rudimental and Macklemore I know. Caplen not so much. EOS Dan Caplen is a British R&B singer and sognwriter. He is also known as D/C. You may like his song Closer To You. EOS D/C does ring a bell. I'll look him up and give it a listen. EOS My Love has a Young Bombs Remix, which is also featuring Jess Glynne. It is a great song to dance to. Do you like to dance? EOS I have never really danced. I wish I did! Mostly I listen to this sort of thing at work. Keeps me moving. I should dance. I have to get over my mental issues!", "Knowledge": "Dance Like Your Doctor Is Watching: It s Great for Your Mind and Body Of course, dancing is also a good form of physical exercise, which plenty of research has shown to benefit mood, mental health and physical health — and it doesn’t hurt that it’s just great fun. Dancing reduces depression symptoms Dancing can provide various physical benefits but now, researches show promising results that it can also benefit the mind, with a growing body of evidence that suggests that dancing is good for mental health. Dancing is one of the ways to truly lighten up some people’s monotonous lives. Emotional, mental, physical, and general health all truly benefit from it. 3. Increases your energy Dancing increases strength, forcing the muscles to endure against the body’s own weight. A lot of dance styles, including jazz and ballet, require jumping in the air, and jumping requires a tremendous amount of strength in the primary muscles in the leg.", "Response": "You really should dance, even if it is just home alone. Dancing is good for the mind and body, and has been proven to increase mood, strength, and energy."}
{"Context": "I enjoy classical music. I enjoy classical music because I listened to it often as a child. I took piano lessons when I was 10 years old, and classical music was used for rehersals. EOS Did you listen to Beethoven Für Elise? EOS Yes, of course. That piece is absolutely iconic! I attempt to play it on the piano, but I can never seem to get quite right. EOS What are your favorite classical musics? EOS My favorite classical musician is Antonio Vivaldi. What is your favorite? EOS I like a lot Johann Sebastian Bach. Do you like his music? EOS Yes, I do. I enjoy listening to his music while I work. The pace is soft but steady, it helps to keep me at a high level of productivity. Do you have a favorite piece of his?", "Knowledge": "Concerto In D Minor For Two Violins", "Response": "I like the Concerto In D Minor. Which one do you prefer most Bach or Beethoven?"}
{"Context": "My favorite item to buy is I love shopping items. I like shopping new fashion items EOS I like buying some fashion products", "Knowledge": "Up to 50% off Prada, Burberry, and more.", "Response": "Ive heard you can get name brands like Prada 50% off on eBay!"}
{"Context": "My favorite sports team is The New York Yankees. He is related to one of the former players EOS I really enjoy playing and watching sports, do you have a favorite sport? EOS Nice! I enjoy playing soccer and watching football. EOS That's amazing! I also enjoy soccer, but I think my favorite would have to be baseball EOS how long has it been since yankees won a world series like 10? I think they're overdue EOS It's been a while, I think 2009. They really are overdue. Unfortunately the best players, in my opinion, all retired shortly there after. However the new members seem to be getting better. Thankfully they are still in the lead for the most world series by over 15 EOS took a bit for most players to get healthy after all those injuries in 2019 EOS That's true, there were quite a few injuries that year EOS I'm pretty sure it was over 30 EOS There were in a little over 5 months too, but thankfully most of them were just mild strains", "Knowledge": "", "Response": "Thats good. People dont understand but baseball can put a strain on the players no matter how athletic they are. They play so many games in one season I applaud them!"}
{"Context": "My favorite book is Childhood's End. I love Author C. Clark books EOS Childhood's End? Sounds sad - what's it about? EOS It's about a race of aliens that help the people of earth.  But, they never describe how they look until the end.", "Knowledge": "The Overlords appeared suddenly over every city--intellectually, technologically, and militarily superior to humankind. Benevolent, they made few demands: unify earth, eliminate poverty, and end war. With little rebellion, humankind agreed, and a golden age began.", "Response": "Ohhh, nice. We could definitely use the help, especially now! I like how they're here to help us instead of decimate us - unify earth, eliminate poverty, AND end war? Don't threaten me with a good time!"}
{"Context": "My favorite actor is Jack o connell . First seen him in the film Eden Lake EOS I have liked the actor Jack O Connell since i first seen him as the lead actor in Eden Lake", "Knowledge": "Horror, Mystery & Suspense", "Response": "Thats so cool. I read that movies was a horror movie with some mystery. What is the movie about?"}
{"Context": "My favorite fashion brand is Tu. Lately I've been buying plain clothes from Sainsburys EOS I don't like wearing branded clothes much anymore. Most of my wardrobe has become unbranded plain clothes. EOS What unbranded clothes have you worn? EOS Tu make nice basic shirts and jumpers. Other than that I just try to find unbranded clothes from any store. EOS Have you tried label free t-shirts? EOS I don't think so. Where might I find them? EOS Have you seafched for design custom apparel?l EOS I haven't so I'll check them out. Have you used them? EOS Yes they have great deals also to check out EOS Nice! Is their fabric quality good? I want to buy clothes that will be sustainable", "Knowledge": "About TUTU FASHION", "Response": "They dont compare to TuTu fashion, have you heard about them?"}
{"Context": "My favorite singer is Dua Lipa. I want to be her sugar boo EOS What are some things you like about Dua Lipa? EOS I like the way she dresses and her hair.  Her music vidoes are very entertaining. EOS Neat! What is your favorite song of hers? EOS My favorite song of Dua Lipa's is called Physical. EOS Is that also your favorite music video of hers? It is a very colorful video! EOS Yes it is my favorite!  The dancing is great and I love how it uses different mediums including graphic art.", "Knowledge": "The British pop singer released a new visual for her single  Physical  today and it s a total technicolor dance dream—a fitting match for her high-energy,  80s inspired track.  Physical  is the latest single from Lipa s upcoming album Future Nostalgia set to release April 3rd. According to Rolling Stone, the visual for the track was produced by Canada, a production team that s worked with the likes of Rosalía on show stopping videos. The video finds Lipa dancing her way through multiple, multicolored stage sets while incorporating moments of anime-inspired animation. Lipa rocks her unique platinum blonde and brunette wavy bob while donning a glittery, smoky eye look.", "Response": "I hear she is coming out with a new album called Future Nostalgia in early April. You must be very excited about that then!"}
{"Context": "My favorite item recently bought is dog bed. My dog goes through dog bed's but I found one he loved at first sight. EOS How big is your dog? What type of bed did you buy? EOS He is medium-large and the bed had sides where he only had ones that were mats or big pillows before. EOS What does the bed look like? I’ve heard that some models even use memory foam! EOS It looks almost to small EOS Big Barker has a model especially for large dog breeds. Have you seen it? EOS No i haven't the bed has sides and what surprised me most is he didn", "Knowledge": "1. PetFusion Ultimate Pet Bed : Perfect for Extra Neck and Head Support", "Response": "Yes, sides are nice! Dogs need neck support too!"}
{"Context": "My favorite hobby is learning. the sphinx is older than they say EOS What do you like to learn about? EOS anything because i missed a lot of school so thats why i think i like learning about anything accept maths, you can pick any other topic EOS Haha, math was always my favorite. Have you ever used the Harvard extension? It's great for findinf new info. EOS No i just get fads like one day i want to learn about ancient war generals like alexander the great then the next day i could want to learn about how biscuits are made EOS I understand that, you just look up whatever you're curious about in that moment. EOS yes , life is to short to learn everything if life was longer you could learn every foreign language and get a job for the c.i.a", "Knowledge": "Entry-Level CIA Careers", "Response": "I'm not sure about that making you eligible to work for the C.I.A. but there are entery level careers you can get involved it."}
{"Context": "My favorite item to buy is I love shopping. I like shopping in mall EOS I like shopping fashion products", "Knowledge": "", "Response": "Where do you enjoy shopping at?  A mall, outlet mall, or independent stores?"}
{"Context": "My favorite book is One Fish, Two Fish, Red Fish, Blue Fish. It was a humorous book EOS I love the book One fish, Two fish! It helps with motor skill development in children! EOS I didn't know that was an aspect in relation to the book.", "Knowledge": "Describing the book as both “fantastic and fun,” our therapy team recommends reading this type of book often – even daily – with young children. The writing and illustrations are filled with feelings, colors, shapes, numbers, counting, opposites and rhyming pairs, all of which can help children develop language concepts and reading skills. And the book’s entertaining fish characters inspire hands-on activities and active fun that can support a child’s motor skill development in an especially fun way.", "Response": "Yeah, it inspires hands on activities that are filled through the description of colors and shapes!"}
{"Context": "My favorite author is I love horror story writer. I like horror story writer author EOS Do you think Stephen King is a better writer than Edgar Allen Poe? EOS Absolutely correct.  He is great writer.", "Knowledge": "", "Response": "No, I asked which writer you think is better. Stephen King or Edgar Allen Poe?"}
{"Context": "My favorite author is Stephan King . He acted in some of his work EOS I think Stephan King is one of the greatest horror authors ever lived he has made many classics EOS He has a lot of great books. Do you have a favorite? EOS Yes my favorite is the shining , Stephan king did not like the film version of it he said Jack Nicolson was crazy from the start but in Stephan Kings book he gradually went crazy EOS Jack Nicholson is a great actor and he did go a bit crazy in the making of the Shining.  Did you like the book or film better? EOS I liked the film better because i agree Jack Nicholson is a great actor EOS Jack Nicholson is a great actor. Have you watched any of his other movies? He did a good Joker in the Batman movie. EOS I have watched bits of it but have not watched it properly yet i will check it out , Stephan King is also a pretty good actor he acted in a film he produced called creepshow", "Knowledge": "Carrie was the first of many novels in which King blended horror, the macabre, fantasy, and science fiction. Among such works were ’Salem’s Lot (1975; TV miniseries 1979 and 2004); The Shining (1977; film 1980; TV miniseries 1997); The Stand (1978; TV miniseries 1994); The Dead Zone (1979; film 1983; TV series 2002–07); Firestarter (1980; film 1984); Cujo (1981; film 1983); The Running Man (1982; film 1987); Christine (1983; film 1983); Thinner (1984; film 1996); It (1986; TV miniseries 1990; film 2017); Misery (1987; film 1990); The Tommyknockers (1987; TV miniseries 1993); The Dark Half (1989; film 1993); Needful Things (1991; film 1993); Dolores Claiborne (1993; film 1995); Dreamcatcher (2001; film 2003); Cell and Lisey’s Story (both 2006); Duma Key (2008); Under the Dome (2009; TV series 2013–15); 11/22/63 (2011; TV miniseries 2016); Joyland (2013); Doctor Sleep (2013), a sequel to The Shining; and Revival (2014). King published several of those works, including The Dead Zone and The Running Man, under the pseudonym Richard Bachman. A collection of the first four Bachman novels, The Bachman Books (1985), contains the essay “Why I Was Bachman.” Mr. Mercedes (2014), Finders Keepers (2015), and End of Watch (2016) formed a trilogy of hard-boiled crime novels centring on retired detective Bill Hodges. King also wrote a serial novel, The Dark Tower, whose first installment, The Gunslinger, appeared in 1982; an eighth volume was published in 2012. A film adaptation of the series was released in 2017.", "Response": "Stephen King is a very talented individual. Between writing books, acting like you mentioned, being a part of many movie adaptations of his books and even creating original movies. He can do it all. He sometimes uses a pseudonym of Richard Bachman to produce works under."}
{"Context": "My favorite game is Civilization VI. I use a builder strategy in the game EOS Do you play it on Switch or another platform? EOS I play by myself on the PC. I've never been big into multiplayer. EOS I've heard you can Hotkey some of the actions to save time. Do you use those? EOS A few. I use M to move, or A to attack. Mostly the common ones which save a few mouse clicks. Have you played any of the Civilization games?", "Knowledge": "", "Response": "I have not had the chance to play it, but it sounds like fun. What is it you like most about the game?"}
{"Context": "My favorite book is The Alchemist. It was a great book  EOS That book was an interesting read EOS I've never read it. what is it about? EOS It's about a kid that goes on a journney to find his treasure and meets an alchemist along the way and learns some great stuff during his travels.", "Knowledge": "", "Response": "Sounds a lot like the anime Full Metal Alchemist lol. In all seriousness it sounds really interesting. I may need to buy this book."}
{"Context": "I like to travel. I try to travel to a different place every year. EOS hello there! EOS Hey! Wanted to ask you, which places that you've traveled to were your favorites? EOS I love to travel all over the world to many different countries. I think my favorite would be the country of Europe. i actually just got back from visiting Italy yesterday. EOS Really? Italy sounds great indeed. What did you like about this country the most? Have you been to Naples or Sicily? EOS Honestly i love the food the most. I am a huge foodie and the food there is amazing. I have been to both  naples and sicily, and those are beautiful places. have you ever traveled anywhere?", "Knowledge": "Pasta types vary significantly depending where you go in Italy. Be sure to try the regional specialties in the cities that you are visiting. If you are exploring beautiful Rome, order a serving of the pasta alla carbonara, prepared with ingredients such as eggs, Pecorino cheese, guanciale (a type of Italian cured meat made from pork cheeks) and black pepper. When it comes to pizza, the first type that comes to mind is Margherita. Originating from Naples, the pizza margherita is a simple but tasty dish. Order this popular item from the local pizzeria, and you can expect to be served with a crispy, thin-crust pizza topped with olive oil, garlic, basil, tomatoes, mozzarella and Parmesan cheese.", "Response": "Not really. What about the food in Italy though, which one did you like the most - Pizza or Pasta? I know they have a lot of types, which one did you try?"}
{"Context": "My favorite hobby is exercising loves to cook low carb pizza EOS Do you exercise at home or a gym? I hear it can be a lot cheaper to workout at home rather than at a gym. EOS i exercise at home.  i have some free weights and a set of adjustable dumbbells", "Knowledge": "", "Response": "Nice dumbbells are best for getting strong arms. Calves and arms are the most important to gain muscle on when you first start exercising."}
{"Context": "My favorite actor is Tom Cruise. He is always in the coolest action  movies! EOS Have you ever seen Top Gun? I am a huge Tom Cruise fan EOS Yes I have. Tom Cruise actually flew a jet in Top Gun. EOS That is so cool. i heard he is going to outer space to film a new Mission Impossible movie", "Knowledge": "Rain Man, American dramatic film, released in 1988 and starring Tom Cruise and Dustin Hoffman, that was a hit with both critics and audiences and won four Academy Awards, including that for best picture, as well as two Golden Globe Awards, including that for best drama.", "Response": "Do you like and of his non-action films like Rain Man from 1988?"}
{"Context": "My favorite movie is disney movies. lot of animations in disney movies", "Knowledge": "", "Response": "Which Disney movie do you like to watch the most?"}
{"Context": "My favorite singer is The Weeknd. I hope he gets back together with Bella Hadid EOS Have you ever seen The Weeknd perform live? EOS No. Have you? EOS Yes, back in 2017. I was sitting in the front row. It was the best night ever.", "Knowledge": "", "Response": "Was he performing with Bella Hadid?"}
{"Context": "I live in Memphis, Tennessee. I love to run. Because,  running is good exercise EOS Running best exercise for all", "Knowledge": "Warm, humid weather continues in August, with an average daily high in Memphis at 91.2 F and an average low of 71.2 F, but highs can sometimes go into triple digits. August is the driest month of the year with 3 inches of rainfall.", "Response": "Do you ever run indoors to avoid the heat and humidity of August?"}
{"Context": "My favorite tv show is Family Guy. Family Guy is very funny, and I love the voice acting.  EOS Who do you prefer ... Brian or Stewie? EOS I prefer Stewie, because I love the way he talks and how he has a sense of evilness. Do you have a favorite character? EOS Probably Meg. She is the set up for so many jokes EOS They really enjoy going after her. I know there is already like 19 seasons, but I hope they keep making episodes. EOS Me too ... Seth MacFarlane is a voice genius EOS That is true. Do you think its better than the Simpsons? EOS Absolutely ... Family Guy is more nuanced and the voice acting is superior EOS That it true, I can see the appeal in the Simpsons, but no one can top Family Guy's humor. EOS Very true. Of all of Seth's voices is Stewie your favorite? EOS Definitely, the others are good, but Stewie is just the best.", "Knowledge": "Seth MacFarlane as Peter Griffin, Stewie Griffin, and Brian", "Response": "True. His transitions between the voices are amazing."}
{"Context": "My favorite singer is Rihanna. Rihanna is one of the best hip hop female artistes EOS Hey, do you like hip hop music? EOS Yes I think its really great, I love how there is a whole culture associated with it. EOS for real. Who is you best artiste? EOS I like Missy Elliot, what about you? EOS Rihanna for the females, Rick ross, wayne, Drake, Travis for the females EOS I love Good Girl Gone Bad by Rihanna, what do you think makes her so good? EOS Rihannas beauty, her voice, her dancing EOS Rihanna has her own makeup brand, maybe you can look as good as her! EOS That lady is beautiful, she's got looks", "Knowledge": "Rihanna’s Debut Fenty Collection Was Inspired by the ‘Black Is Beautiful’ Movement Praise Riri! Today, Rihanna’s luxury clothing line Fenty is now shoppable online, so say goodbye to all your coins. Joining Rihanna’s burgeoning business empire that includes lingerie and a beauty brand, Fenty is also the first luxury line helmed by a woman of color at fashion conglomerate Louis Vuitton Moet Hennessy (LVMH). Accordingly, Rihanna took that groundbreaking spirit and infused it into every detail of Fenty’s first collection.", "Response": "She has her own clothing line too, they say it was inspired by the 'Black is Beautiful' Movement."}
{"Context": "I live in Kansas City, Missouri. I love being in nature. nature is so soothing EOS do you also like nature? EOS I do. Many studies say that nature has a lot of positive effects for our health EOS which are some of the health benefits have you accrued from nature? EOS With all these technologies all around us first of all it is good for our social well-being. I remember when I was kid I was always in the woods EOS wow, that was quite nostalgic EOS Being in nature with friends also showed an improvement of cooperation and trust. A mix of good emotion! EOS that is so true. those runs in the smooth grass were just exciting EOS Oh my God. You are so right! I remember I was the happiest kid in the world in those moment being barefoot. EOS what about cliff diving?", "Knowledge": "By its simplest definition, cliff diving is exactly what it sounds like. It is an activity that involves highly-trained athletes diving into the water from a very high cliff. This is a risky sport that should only be attempted by people who have been given the proper training and have plenty of experience that allows them to soar from extreme heights and still land safely in the water below.", "Response": "Never done it. I consider it too risky. Only athlete with a proper training should do it"}
{"Context": "I live in Detroit, Michigan. I enjoy being outside. I love to hnag with my old friends EOS what do you always do when you go out?", "Knowledge": "", "Response": "I love hitting up bars with my friends. What activities do you like to do outside?"}
{"Context": "My favorite hobby is Trading Cards. My favorite trading card game is pokemen", "Knowledge": "", "Response": "Who's your favorite pokemon?"}
{"Context": "My favorite author is I love author stephen king. I like reading his books EOS The stephen king is great author EOS Yes, he's written a book nearly every year since the last 70's! EOS Yah.  He is great person in story writing EOS What is your favorite book by him? EOS My all time favorite is IT EOS His violent sexual imagery in that one was one of the last times he used that. EOS Really?  do you say more information about King", "Knowledge": "2019:  The Institute", "Response": "Did you read The Institute? His most recent book?"}
{"Context": "My favorite clothing type is boxers. a underwear that supports your body EOS i love boxers specifically calvin klein EOS boxers definitely seem more comfortable given the loose fit EOS yes they are stops you from sweating", "Knowledge": "Create a comfortable outfit starting with the base layer of clothes. Your underwear needs to fit and feel just right. Men’s Calvin Klein boxer briefs provide just the right support while delivering on style.", "Response": "oh of course and Calvin Klein boxers promote the right support and a great fit"}
{"Context": "I live in Colorado Springs, Colorado. I like to stay fit. I love to hike. Its the best exersise. EOS I went hiking today in the metro parks.  I t was an exhilarating day. EOS Metro Parks sounds like a great place to hike. Do you stay on the trails or do you head off the beaten path to get sight of what others haven't seen? EOS I usually stay on the trails. They really don't like you to wonder off the trails. EOS Makes sense. Let nature keep some space to itself so no one accidentally comes into contact with a bear! EOS Yes that and they don't want you damaging the flora by trampling all over the place. What do thing is the best way to stay fit? EOS I think any activity that you naturally enjoy is the best way to stay fit. That way you keep on doing it and not do it as a fad. Sounds like you really like hiking and the good thing about that is it works out the whole body. It also has some great mental benefits being outside with nature. EOS I agree. The beast way to stay fit is to find something you enjoy doing. Otherwise it's too much of a chore to heep up with it. You end up not going anything.  Take up hiking, or golf, anything to keep you active!", "Knowledge": "Since 1973, Pikes Peak Region Attractions has been helping visitors find all the coolest things to do in Colorado Springs and the Pikes Peak region. Originally created by a small group of area attractions, looking to pool their resources and market collaboratively, the association has grown into one of the best travel resources for the area. Celebrating more than 45 years and 25 of the top attractions in the area, Pikes Peak Region Attractions is your one stop shop for all the best must-dos and must-sees in the Pikes Peak region.", "Response": "Have you ever hiked up Pikes Peak? That is a crazy looking climb. I know about it from watching the race on TV."}
{"Context": "My favorite director is Sam Raimi. I love horror and Raimi did it best EOS What is your favorite horror movie that Sam Raimi directed? EOS I am a huge Evil Dead fan and cannot stop enjoying it. The movie, the games, the TV show. Everything is awesome. EOS Is Evil dead better than Drag me to hell? EOS It is much better. There is a whole Evil Dead universe.", "Knowledge": "Raimi began experimenting with filmmaking at a very early age. By his teen years, he was already an active member of a circle of amateur actors and directors in the Detroit area. Among this group were his brother Ted and aspiring actor Bruce Campbell, both of whom became staples in Raimi productions. In 1977 Raimi enrolled at Michigan State University, where he produced the 8-mm films The Happy Valley Kid (1977) and It’s Murder (1977). These modest efforts provided valuable experience for Raimi and his associates, and their next project, the short film Within the Woods (1978), served as the test reel for what is arguably Raimi’s most famous work, The Evil Dead (1981). Although its low-budget origins were apparent and its level of gore bordered on the cartoonish, The Evil Dead became one of the most influential horror films of all time, and Raimi’s use of “shaky cam”—a handheld camera technique that was intended to replicate the point-of-view of a given character or object—was widely emulated. Although his next film, Crimewave (1985), was hobbled when studio executives fundamentally altered the story with editorial cuts, it was written by Joel and Ethan Coen and began an association between Raimi and the brothers that proved to be mutually beneficial.", "Response": "I agree! Raimi's use of Shaky cam was widely emulated in evil dead"}
{"Context": "My favorite movie is Star Trek II: The Wrath of Khan.", "Knowledge": "", "Response": "Who is your favorite actor from the movies?"}
{"Context": "My favorite clothing type is leggings with pockets. comfort level 100 PLUS pockets! EOS I'm wearing my favorite leggings today, they have huge pockets on each thigh", "Knowledge": "If we’ve learned one thing Amazon is great for, it’s offering high-quality leggings at a fraction of the price. Even better is that we can always rely on Amazon reviewers to point us toward the latest and greatest yoga pants, especially when it comes to best-selling styles and functional designs. Figuring out where the heck to store your essentials while wearing leggings is a problem women shouldn’t have to deal with, but they do ― a lot more than men. Fortunately, there are companies out there (including more affordable alternatives to Lululemon) designing practical leggings with pockets that’ll store more than just your house key.", "Response": "Thankfully leggings began to be made with those pockets. Lululemon ones are great but you are able to get some on Amazon for a fraction of the price."}
{"Context": "My favorite artist is Michael Jackso. I loved all his music he is an icon EOS Michael is certainly a pop icon legend. He is the King Of Pop EOS yes, really wish he is still alive to give us more EOS It was a once in a lifetime expiernce. You just have to cherish all the gifts he gave us through his music. EOS yes, I always play on my spotify, amazing talent EOS If you could or have you. I dont know how old you are. Would you attend any of his concerts? EOS I was very young when listening, could not attend, did you ever attend> EOS No i have never attended his concert. I wish i had. Do you think time stood still when he passed away? EOS yes it did, the internet almost crashed, everyone wants to get information on his death at the same time EOS Have you ever watched Leaving Neverland the HBO documentary? EOS yes I have, I like it", "Knowledge": "Michael Jackson (archive footage)", "Response": "When i watched it I did see a different side to Michael"}
{"Context": "My favorite game is Trivial Pursuit. Trivial Pursuit is fun to play on family game night.  EOS Tomorrow night, my family and I are gonna play Trivial Pursuit together. EOS That sounds fun!  Which edition are you playing?  Master Edition?  Oooh, or maybe Horror Movie Edition? EOS We just play the regular edition, but I'll definitely check those versions out. Have you ever gotten the chance to play? EOS You know hard hard it can be to find others to play with haha.  Who do you usually play with? EOS I usually play with my family. My friends aren't very into the game. EOS Families can often have the best rivalries!  Have you ever tried Family Edition?  Sounds right up your alley! EOS We should definitely check that out. My family is definitely competitive, and I have never even won.", "Knowledge": "Studying for Jeopardy improved my Trivial Pursuit skills more than any other tactic. Jeopardy includes a wider range of categories than Trivial Pursuit, but almost any question you can be asked in Jeopardy would fit into one of Trivial Pursuit s original six categories. How does someone study for Jeopardy?", "Response": "That's a shame, I bet you're just waiting for the right questions!  I've heard that some people practice by watching Jeopardy, makes sense when you think about it I suppose.  Who's your biggest rival at the table?"}
{"Context": "My favorite music band is Queen\t. Freddie Mercury is an absolute legend EOS I think that their Live Aid performance was one of the best moments of live music ever EOS Yeah, hard tp believe Freddie Mercury of Queen fame died at 45 EOS I know. It was so sad. If only they had a cure or treatment for AIDS back in the 80s. He was taken too soon.", "Knowledge": "5 Mysteries Surrounding the Life and Death of Dr. Sebi Alfredo Bowman What if I told you I had a cure for AIDS? Would you believe me? What about cancer? Or diabetes? 1. Dr. Sebi Cures AIDS? The myth of Dr. Sebi grew stronger in 1988 after the self-taught herbalist ran ads in the Amsterdam News, the Village Voice and the New York Post noting that  AIDS has been cured.  The story goes that the New York State attorney general and New York City Department of Consumer Affairs told Dr. Sebi to remove the ads; he refused and was arrested. The charges leveled against him included practicing medicine without a license, selling products not approved by the Food and Drug Administration, and fraudulently claiming that he could cure AIDS and other diseases. The judge asked Dr. Sebi to bring in one patient who could testify that he had cured him or her of these potentially fatal diseases. He reportedly provided 70 patients and won the case. And the legend of Dr. Sebi was born.", "Response": "Yeah, Dr. Sebi (born Alfredo Bowman) was supposively a holistic healer of those with HIV/AIDS."}
{"Context": "I enjoy watching horror flicks. for example, Midsommar EOS do you think Midsommar is a good horror film? EOS I think it's very imaginative. It's very psychological and really very strange, but I think overall it's a great and very well made horror film. EOS do you think the themes of break up in Midsommar show well in the film about how it feels to breakup EOS I think its definitely debatable, It's a very thought provoking film. I think the themes of breakup are very clear and made to make the viewer think about the serious topic of breakup. EOS what about the movie Saw, do you think that the gruesome tests people go through really change them? EOS Oh yes definitely. Saw is a great film, I think any experience a person goes through changes them at least a little bit. But in Saw I think that experience would change you quite a lot! EOS I think in Saw that game that is designed by jigsaw is something I could never think of. EOS It's definitely clever, although quite horrifying... EOS in saw do you think when they are left in the room to die that we as people would act the same? EOS I think its hard to tell. Everyone would act differently, especially given the stressful situation.", "Knowledge": "A flashback reveals that Tapp and Sing managed to locate Jigsaw s warehouse in an abandoned mannequin factory using a videotape from Amanda s game. They raided Jigsaw s warehouse without a warrant and found another victim, Jeff Ridenhour, in a trap. They managed to apprehend Jigsaw, however, Jigsaw activates Jeff s trap and Sing rushes to save him. He then slashes Tapp s throat with a hidden blade and flees. While pursuing him, Sing is killed by a shotgun trap. Following his partner s death, Tapp became obsessed with catching Jigsaw, and still believes that Gordon is responsible.", "Response": "that is true but I do like the flashback that they show gives you more info on jigsaw."}
{"Context": "My favorite book is Watership Down. I raise rabbits", "Knowledge": "The Rabbit Care Section serves all who have rabbits: Show rabbits, pet rabbits, and livestock rabbits, breeders and pet owners alike.", "Response": "What kind of rabbits do you raise?"}
{"Context": "My favorite hobby is painting with alcohol ink. painting with alcohol ink is creative and a lot of fun.  EOS I recently discovered alcohol inks for painting. They are a very different medium and there is not a lot of control using them. EOS That sounds fun! What sort of things do you like to paint with alcohol inks? EOS I like to paint flowers mostly as it's easy to have a loose interpretation. Using them paint beach scenes is fun too. EOS Do you need to use a certain type of canvas for that? EOS Anything that is non porous works great. I personally, like to use porcelain tiles. They are cheap and you can get them from any home improvement store. Haha But, you can buy special non porous paper from any arts and crafts store as well. Do you paint at all? EOS I love the idea of painting porcelain tiles! I paint a little bit but just super casually. What do you find the most difficult about using alcohol ink? It sounds like blending it might be a little confusing. I'm sure it takes practice to determine how the different colors mix together? EOS It runs...but that's what makes it fun and frustrating at the same time. There are medium thinners you can buy that will help alter the colors as well, make them lighter or help blend. It's like doing paint pours, but with ink and on a smaller scale. Alcohol inks are great for causal hobbyists. It's relatively inexpensive and you can find loads of videos on Youtube about it as well. EOS That sounds kind of similar to water color painting in a way, in that you have to deal with it running and figure out how to blend it. Are thinners difficult to use? EOS Yes, it is much like water color, but the inks will blend together much easier. Not at all. You can pour them directly onto the painting or use a small spray bottle to make different patterns. I have used canned air to paint with. I drop some ink on a tile, spray it with the air, might use the thinner to get some different results, spray with air again...repeat. Using a paint brush works well too. But most people just use air or tilt the substrate to get the desired results.", "Knowledge": "Blow the ink with canned air to create an abstract dissipated effect. Make sure to get a decent amount of the blending solution and ink on your canvass. Hold the canned air a couple of inches away from the wet alcohol ink and press the trigger to shoot air from the nozzle. This will push the paint so that it dissipates in different directions.[6] Use a felt applicator to get a marbled look. If you are painting on tile, stone, or glass, you can achieve a marbled look with alcohol ink. Pour a couple of drops of different colored ink onto a felt applicator, then dab the applicator against your stone, glass, or tile. This will create small circles that resemble marble.[8]", "Response": "That's super interesting! What other tools do you like to use in your paintings? I've read that people can use felt applicators to get a marbled look, or canned air to get some interesting abstract effects. It sounds like a really fun medium to experiment with and see what you end up with."}
{"Context": "My favorite tv show is Kaley Cuoco. She was funny.  The character's name in Big Bang Theory was Penny. EOS I am a big fan of the Big Bang theory. I was sorry to see the show come to an end in 2019. EOS I know.  Jim Parsons announced that he wanted to quit without giving the other actors any notice.", "Knowledge": "What We Know About Jim Parsons’ New Netflix Project", "Response": "That's really unfortunate. I guess he had big things he wanted to pursue with Netflix."}
{"Context": "my favorite book is fight club.  EOS My favorite book is fight club due to the twist - what is yours? EOS I do like Pride & Prejudice. Have you seen the Fight Club film with Brad Pitt in? EOS I have, it is one of my favorite films. I also really like the Pride and Prejudice film. EOS I haven't seen Fight Club but I have heard it is good. Do you like other Cult Films? EOS A similar one I like is Inception. It has a big twist and really requires you to pay attention. EOS Yes I have seen Inception. Christopher Nolan spent 10 years writing the screenplay for Inception. It certainly has a lot of twists and turns. EOS Wow 10 years, I had no idea he took that long to write it. My dream job used to be making films like Christopher Nolan.", "Knowledge": "Take a class. Taking a class or two will help you to sharpen your skills. Even if you ve already mastered the standard format, you’ll get to focus heavily on making your script as good as it can be.[3] If you have the ability, take class at a film school. There, you ll be able to create screenplays with the help of professional writers.", "Response": "Have you tried to pursue this before? You should take a class in screenwriting."}
{"Context": "My favorite song is Brown Shoes Don't Make It. that is the song that inspired me to purchase the album it was on EOS I heard you love the song Brown Shoes don't make it. I also just purchased the album Mothers of invention and can't wait to listen to it!! EOS Did you get it on vinyl, the way God intended music to be delivered? EOS i agree but I don't own anything to listen to it that way so i downloaded the album. They were pretty popular in the 60s when you could listen to music on vinyl EOS Download? Do you have a hyper fast Inet connection? I suffer along with 35meg.", "Knowledge": "The Mothers of Invention Vinyl, CD & tapes by The Mothers of Invention at Norman Records", "Response": "Not really. it did take some time. I'm going to have to look into the vinyl and get a record player to play that. It'll feel as if i'm listening to it back in the 60s."}
{"Context": "My favorite item to buy is blimps. it's easier to get to the moon in a blimp EOS Can anyone buy a blimp? They must be expensive and you have to get some sort of pilot license for it right? EOS o, yes.  very expensive for actual blimps - millions of dollars; and yes, you have to have a pilot's license.  but i get by all that by lying and stealing.  it's much more fun that way.", "Knowledge": "Launched in 2014, Wingfoot One is the first of a new generation of Goodyear Blimps built on the New Technology (NT) platform. The first semi-rigid airship ever constructed for Goodyear s modern fleet was built and is now based at Wingfoot Lake in Suffield, Ohio. Since it first took flight, Wingfoot One has provided aerial coverage of numerous marquee events, including the NBA Finals, the Daytona 500, the Stanley Cup Finals, the PGA Championship and the College Football Playoff National Championship.", "Response": "Haha that sounds like devious fun! I'd suggest stealing the Wingfoot One, it's one of the best blimp models."}
{"Context": "My favorite movie is like. to Avatar watching very interesting animation EOS I have good character of this person EOS i found the main character very mysterious, how do you relate to him? EOS Main character hero acting very excellent EOS yes and sam Worthington is a very good actor, have you seen his other movies? EOS King Kong Movie is very amazing EOS yes i think naomi watts is an excellent actress and the movie had a heartfelt message EOS I have watching on theatre excellent heartless naomi  watts acting", "Knowledge": "", "Response": "is there anything else you are interested in?"}
{"Context": "My favorite hobby is Formula 1. My brother is current formula 1 driver Lando Norris EOS I can't wait for the Imola grand prix this weekend, will you be watching? EOS oh yeah! it's in Italy right? who all will be driving? EOS Yes that's right! Lando will be driving in it again of course! I'm really looking forward to see which tyre they all chose to qualify on, see if they struggle on the C4 soft tyres again! EOS yes the tiers have been kind of low in the past couple of years EOS Do you have any predictions for whose going to win? EOS michael shumacher has won tons of the grand prix! i vote for him EOS Are you still living in the past haha! As much as we would all love to see Micheal back in a race unfortunately with his skiing injury I don't think we will ever see him speak let alone race! EOS lol oops i didn't know that! how sad to hear, how about Lewis Hamilton? EOS Yes Lewis is in a great chance to win as usual but I hope Max Verstappen can beat him this time, and with the improvements Red Bull have made to the car I think he has a great chance!", "Knowledge": "Lando Norris and Max Verstappen have come together to join forces for iRacing, functioning as teammates for iRacing’s Bathurst 12 Hour.", "Response": "did you see where max and lando were teammates for the iracing?"}
{"Context": "My favorite hobby is singing. Singing frees the spirit and is surprisingly healthy. EOS Singing is such a fun and freeing thing to do!  It also makes you feel really good and can have other health benefits too! EOS Aside from being fun it can also bring you closer to people you are singing with if you are not singing alone. It is a great way to express feelings for someone else also. EOS That is also very true!  What types of music to you like to sing? EOS I have sang a variety of genres. Everything from christian hymns to country to some rap.", "Knowledge": "Build confidence: There is no denying the fact that even the most confident and outgoing people tend to get a little anxious before their performance on stage. A professional vocal training can help you in getting past the fear of people judging you and developing confidence at the same time. The more confident you feel, the better you deliver. This will help in enhancing your stage presence and keep the audience engaged with your performance.", "Response": "Wow, that's a very interesting mix of songs!  Have you ever taken lesson to build your confidence in your voice?"}
{"Context": "My favorite item recently bought is clip on bed lamp. I love my new bed lamp! EOS I recently bought a clip on bed lamp that I love! It is so convenient to have! EOS Bed lamps are great for reading. Read a book, news is bad for your health. EOS You can say that again!! This light is an led light and it has a variety of settings on it to adjust brightness and I can even change the light color! EOS Even more good news for you, LED lights are energy efficient, so you're not only expanding your horizons by reading, you are also saving money! EOS Oh that is great to hear! I love saving money! I also use my light while I am working online. EOS LED's are one of the best lights you can use while working on the computer. It gives you enough light to prevent eye strain. EOS That is true! I bet it would make a great gift to someone! The gooseneck is a great touch also! EOS For sure! They allow you to position the lamp to give you just the right amount of light that you need for each job. Also, they are very stylish! EOS Exactly! I use mine way more than i expected. Mine also has a neat feature that lets you set a 1 minute timer for use in the middle of the night.", "Knowledge": "", "Response": "In that case, you could say that your new bed lamp is a life saver! It keeps you from tripping and falling down"}
{"Context": "My favorite book is curious george books. I would love to have a monkey just like curious george.", "Knowledge": "", "Response": "Curious George is really a cultural icon. Did you watch the TV show that was on PBS?"}
{"Context": "My favorite book is Red Rising . I wish I was Darrow. EOS You like Red Rising? Nice, I've heard of it, but I'm not super familiar. There are what, six books in the series? Have you read them all and what draws you to it specifically? EOS There are 6 total. I'm only half way through book 2. It's a rebellion story. I love the idea of the little guy taking a stand and making it to the top. Do you read scoi-fi? EOS Who doesn't love a good rebellion story - Star Wars anyone. But when you think of dystopian futures, including the one we're living in (ha!), it makes sense that some twisted regime rose to power and a rebellion is required. I haven't picked up a book in a few years, thought I have a stack that I bought and haven't read yet. Sci-fi is one of my top genres, but have mostly been watching TV. Just started the Expanse (and Prime), which is shaping pretty good...Firefly by that prick Joss Whedon is my fav sci-fi of all time...what's your fav sci fi ever? EOS Aside from Red Rising, probably Dune. Frank Herebert was a tortured genius. It's a shame he didn't finish the series. EOS I have a healthy respect for Dune...I sincerely hope the remake coming out will be good...and that they stay true to the 1984 original..the sets, costumes and cinematography were great for the time, and it felt like a huge departure from the usual fair...but, politics are always the main course, which I'm not averse to... EOS There's is an awesome documentary about an unmade Dune movie. The director was Alejandro Jodorowsky and seeing all of his ideas for it makes me wish it had happened. They should've made a series out of the older movie. There was a Dune show on Sy-Fy that was pretty awesome but it's impossible to find now.", "Knowledge": "Critics Consensus: Part thoughtful tribute, part bittersweet reminder of a missed opportunity, Jodorowsky s Dune offers a fascinating look at a lost sci-fi legend. Synopsis: In 1975, Chilean director Alejandro Jodorowsky, whose films EL TOPO and THE HOLY MOUNTAIN launched and ultimately defined the midnight movie phenomenon, began work on his most ambitious project yet. Starring his own 12 year old son Brontis alongside Orson Welles, Mick Jagger, David Carradine and Salvador Dali, featuring music by Pink Floyd and art by some of the most provocative talents of the era, including HR Giger and Jean  Moebius  Giraud, Jodorowsky s adaptation of Frank Herbert s classic sci-fi novel DUNE was poised to change cinema forever. (c) Sony Classics", "Response": "I have never heard of that, but it sounds stellar. Apparently, it's part thoughtful tribute and bittersweet reminder that Hollywood missed a huge opportunity possibly...SyFy is so odd, they've had some questionable choices in the last 2 decades. Well, Dune fever is ramping up again, so I have no doubt, we'll see more media developed for the classic."}
{"Context": "I live in Minneapolis, Minnesota. I am a college student. I am majoring in computer science. EOS I also want to add a statistics major and go for a double major. EOS that's great! you'll have a lot of selections on jobs when you finish. I recently read that the chances of finding work after majoring in computer science is extremely good! EOS Yes, tons of career options.  I am hoping to may be work for a few years, gain some experience and then return to grad school for CS. EOS Any particular college that you're hoping to go to ? Harvard has some great programs EOS I would love to go to Harvard.  Depending on my GPA, I hope to apply to MIT, USC, Stanford and UT Austin as well.  All great CS programs.", "Knowledge": "The Department of Computer Science (CS) operates and supports computing facilities for departmental education, research, and administration needs. All CS students have access to the departmental student machine for general use (mail, news, etc.), as well as computer labs with public workstations located in the Gates Building. In addition, most students have access to systems located in their research areas.", "Response": "Yes they all have great programs. You have a lot of great options. Stanford is excellent"}
{"Context": "I live in Minneapolis, Minnesota. I am a college student. I am majoring in computer science. EOS I also want to add a statistics major and go for a double major. EOS that's great! you'll have a lot of selections on jobs when you finish. I recently read that the chances of finding work after majoring in computer science is extremely good! EOS Yes, tons of career options.  I am hoping to may be work for a few years, gain some experience and then return to grad school for CS. EOS Any particular college that you're hoping to go to ? Harvard has some great programs EOS I would love to go to Harvard.  Depending on my GPA, I hope to apply to MIT, USC, Stanford and UT Austin as well.  All great CS programs. EOS Yes they all have great programs. You have a lot of great options. Stanford is excellent EOS Stanford would probably be my top choice because of its proximity to Silicon Valley.  Many great internship opportunities out there.", "Knowledge": "Computer Science Internship in Silicon Valley + $1,000 Scholarship", "Response": "Yes you are right!  You can get an internship and  $1000 scholarship"}
{"Context": "My favorite item recently bought is cookies. I like the warm dough and the candy bits on this snack. EOS do you like key? EOS What kind of key do you mean? EOS sorry, Cookies I meant EOS Yes, I particularly like oatmeal cookies which are chewy inside and crispy on the outside! EOS I really like those too. Where do you get your cookies? EOS I made it with ginger, walnuts and raisins. Do you bake at home? EOS No. I buy them from the store. I like to watch videos of how to make cookies. EOS Any good videos you can recommend? I want to make cookies of different kinds. EOS I like to use youtube baking videos. I like butternut cookies better? What other cookies do you like? EOS I like dark chocolate cookies because they are heart healthy. EOS Well cookie should not be healthy?", "Knowledge": "", "Response": "You can add oatmeal and wheat flour to make it healthy."}
{"Context": "Twilight is my favorite book series. I wish I could be apart of the story. EOS Have you read all the Twilight books? EOS All but the newest installment. I wish it was real. I would love to meet Alice and Jasper. EOS Would that be Alice Cullen? EOS Yeah. She just seems like a fun person to be around. Her background is such a sad story. Who is your favorite character? EOS Edward Cullen, he is pretty dreamy. EOS What makes him so dreamy? EOS His hair, his skin and his attitude. EOS I always preferred Jasper. EOS The show was filmed in Forks, Washington. If you like Twilight you should think about travelling there! EOS Are there any hotels I could stay at while visiting Forks, Washington?", "Knowledge": "Here at the Pacific Inn, it is our number one priority to provide our guests with some of the best lodging, deals, and quality service while you are visiting the wonderful town of Forks. When you first walk in, you will be blown away by our hometown charm and greeted by some of the best hospitality professionals in the business. Our goal is to assist you in any way that we can while you are staying with us. After check-in, you can drop your belongings off in your room and explore the town, utilize any of our onsite amenities, or maybe just hit the hay on our comfortable mattresses! Mill Creek Inn", "Response": "Mill Creek Inn is reasonably priced and quite comfortable!"}
{"Context": "My favorite hobby is Basketball. They want to play in the NBA EOS Are you watching NBA? Apparently, 76ers star Embiid picked up an injury against Cavs EOS Yes I have been keeping up with the regular season and I hope Joel Embid gets better soon! EOS Do you like new playoff format? Other NBA stars seem to like it EOS I liked the old traditional format and hope one day when I make the NBA that I can play in the the playoffs.", "Knowledge": "Indoor court (mainly) or outdoor court (Streetball)", "Response": "Hopefully you can do this! Do you also play on outoor court (streetball)?"}
{"Context": "My favorite singer is Ariana Grande. I have bought all of her albums EOS Have you ever seen Ariana Grande live? EOS Unfortunately I haven't had a chance to see her live but I am planning to go to her next available concert. EOS She is a great performer! Thank U, Next is such a great breakup song. EOS Yes it is, I have used a lot of her songs to help me feel better when I am feeling sad or down. EOS Her music can really help people! Her song 'no tears left to cry' really helps show that you can tackle your problems. EOS I agree I also loved when she used to act for kid shows when she was a teen, she really is a talented person. EOS She is so talented since appearing on Sam and Cat. Not many actresses manage to also have their first album debut at number one like she did! EOS Yeah she is a one of a kind person I also respect her for all of the philanthropic endeavors she has taken on since becoming famous.", "Knowledge": "Ariana Grande is to be the first patron of a charity set up for survivors and victims of the Manchester Arena attack.", "Response": "She really is - she is a patron of a charity set up after the Manchester attack."}
{"Context": "My favorite tv show is Schitts Creek. I would like to visit where it was filmed EOS I love Schitts Creek, the characters are so funny and interesting! EOS I love that show!  Have you been to the actual town Schitts Creek yet?  It is in upstate NY. EOS No I haven't but I would love to go. Who is your favourite character in the show? EOS I love David.  He is just so funny and I love watching how he tries to cope with his new lifestyle.  Who is your favorite? EOS I really like Moira, her crazy accent and the advice she tries to give people is hilarious!", "Knowledge": "As any seasoned Schitt s Creek viewer knows, everything Moira Rose does is extra. Not only is she prone to extravagant vocabulary, outrageous outfits, and an impossibly unplaceable accent, but even her pajamas feature both a vest and a brooch. So it only stands to reason that Moira s wigs on Schitt s Creek would be just as dramatic and ever-changing as she is.", "Response": "Yes Moira is so hilarious!  And I loved seeing all of her wigs and how dramatic and crazy they could be all the time too."}
{"Context": "I live in Nashville-Davidson, Tennessee. I never cook. I dumpster dive for food EOS Are people really welcoming to Music City? EOS Yes! That's sort of how the city makes most of it's revenue so they sort of have to! I personally think it's a waste of time and pollutes our city!", "Knowledge": "I Am A Dumpster Diver. Here s What I ve Learned.", "Response": "What have you learned about dumpster diving for food?"}
{"Context": "My favorite music band is Westlife. I've always loved Westlife. Every of their album got my attention. I find it so emotional. EOS I see you like Westlife. They are a very popular band from Ireland. What are some of your favorite members of Westlife? EOS My favorite is  Shane Filan. I love his vocals.", "Knowledge": "Love Always (Asia Deluxe Edition)", "Response": "I see he's also a prolific songwriter writing songs like Flying Without Wings, Love Always and Swear It again. Do you have a favorite?"}
{"Context": "My favorite tv show is Animaniacs. It is a cartoon from the 90s.  EOS I like Animaniacs which is an animated cartoon from the 90s. EOS Which are your favorite channels to watch? EOS It was on the WB. There was also a remake of the show that came out last year. EOS Do you think the animaniacs are going to come back? EOS Yes, they have already done a remake last year. I liked the old version better though since it had more variety and funnier jokes. EOS Where can you find this show? EOS You can find this show on Hulu nowadays. The original one is there too.", "Knowledge": "This marks the first Hulu Original made for families. But not only is it intended for kids, just like it was in the ’90s, but the nostalgic vibe is sure to entertain parents too!", "Response": "I believe many different age groups will view this."}
{"Context": "My favorite author is Linwood Barclay. I love mysteries EOS Linwood Barclay is my favorite author. EOS Please list favorite books of Linwood Barclay? EOS Parting Shot is a good one. I like any mystery novel. EOS What is the important elements of mystery novel? EOS hmm I'm not sure, what do you think? I think a great element is having a red herring. EOS list some common red herring? EOS It happens a lot in stories, where they plant something to make you think that the suspect is one person, but it's really someone different. But it throws you off the scent. EOS what is the purpose of using this red herring? EOS I would say the purpose is to make the story more compelling, and less straightforward to keep the mystery intact.", "Knowledge": "mystery play.", "Response": "The best way to screen play is the mystery if not what else?"}
{"Context": "My favorite fashion brand is louis vuttoin. always has a unique classy design", "Knowledge": "Shop online and in-stores starting February 22", "Response": "What you think about shop online?"}
{"Context": "I love 80 s music. My favorite band from the 80s is Guns N Roses EOS You like 80's music, right? Are you a fan of Queen? EOS I love Queen. My favorite song is Bohemian Rhapsody. I used to spend so much time watching their videos on Youtube. EOS Everyone loves Bohemian Rhapsody. Did you watch music videos on MTV or some other channel? EOS No, but I saw that movie about Freddie Mercury. It's also called Bohemian Rhapsody. Have you seen it? It came out a few years ago.", "Knowledge": "Fact-Checking the Queen Biopic, ‘Bohemian Rhapsody’ All Critics (355) | Top Critics (34) | Fresh (218) | Rotten (137)", "Response": "You should tell me about the movie. The only thing I know is that it's a biopic. 234 people on Rotten Tomatos said it was a good film."}
{"Context": "I listen to rap. Love any old school 90s raps. Those were the days!", "Knowledge": "Nuthin  But a G Thang Dr. Dre, Snoop Dogg", "Response": "Are you a Dr. Dre fan?"}
{"Context": "My favorite fashion brand is nautica. i love the feel of it, as well as the different variations EOS hey how are you? EOS Good.  I hope your day is going well.  I hear you like nautica. EOS thats right i like nautica clothes. what do you like? EOS I wear a lot of activewear, like Nike and Under Armour.  What do you like about Nautica? EOS i love the feel of it, as well as the different variations. what do you like about activewear? EOS I like the stretch to it and it is comfortable.  What do you wear to work out? EOS i usually wear shorts and a sports shirt. EOS Do you wear more bright colors or muted tones? EOS i wear more muted tonjes. how about you?", "Knowledge": "", "Response": "I like to have a bright top but go basic on the bottom.  Black leggings tend to go with most things."}
{"Context": "My favorite fashion brand is soko. amaizing well designed jewellery EOS have you seen soko jewelery EOS empowering the jewellery and the fashions are very famous and beautiful EOS they have such a nice story and the products ae from africa EOS good news are storing and inspiring with the others EOS they have such nice offers", "Knowledge": "All Corporate Perfecting Customer Experience Powering Public Safety", "Response": "all corporate customer experience are amazing feedback"}
{"Context": "I live in Tucson, Arizona. I love to ski in the winter. I love skiing more than snowboard, snowboard its impossible for me because I'm fat. EOS Skiing is exciting. I love watching people skiing, but I can't do it myself, it is difficult, isn't it? EOS Skiing its not that difficult, you just have to learn the basics and then you can do it yourself.", "Knowledge": "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found in the ocean, but can also be found in lakes or rivers in the form of a standing wave or tidal bore. However, surfers can also utilize artificial waves such as those from boat wakes and the waves created in artificial wave pools.", "Response": "How do you compare skiing and surfing?"}
{"Context": "My favorite book is The Shack. I love to think of the many possibilites of the afterlife. EOS Tim McGraw did music for the Shack soundtrack EOS I didn't know that. I have not seen the movie. Is it similar to the book? EOS It is directly taken from the book. EOS hmm, that is interesting. Movies don't usually follow so closely to the book. Who plays the main characters? EOS Sam Worthington is playing the main character EOS Who plays the Holy Trinity? EOS Octavia Spencer might be one the stars. EOS That is interesting. Do you know much about the author of the book? I prefer books over movies. EOS Gayle E. Erwin is the author EOS That is not the correct author of the shack. EOS William Young is the author EOS Yes, that is the correct author. Has he written other books?", "Knowledge": "Chris Rosebrough has also addressed the content of William Paul Young’s new book on his broadcast “Fighting For The Faith”:", "Response": "Fighting for the faith is another book he has written"}
{"Context": "My favorite sports team is LA lakers. I LOVE LA LAKER the best team EOS Fun Facts about the NBA Wilt Chamberlain scored 100 points, the most ever, in a single game. EOS In 1967 the Lakers moved to the Fabulous Forum that seats 17,505 people. EOS Yeah he Lakers are one of the most successful teams in the history of the NBA, and have won 16 NBA championships, the second most behind the Boston Celtics EOS The active roster cap for the Lakers is currently $90,775,051. EOS wow and saw that factr n 1968, the Lakers acquired four-time NBA Most Valuable Player (MVP) Wilt Chamberlain, and won their sixth NBA title—and first in Los Angeles", "Knowledge": "", "Response": "The Lakers recently lost one of their best players in an unfortunate helicopter accident, Kobe Bryant and his daughter along with 8 other people were killed in the accident."}
{"Context": "I live in Las Vegas, Nevada. I m a photographer. Nature is my favorite to take photo. EOS Las Vegas is not the best place to take photos of natural beauty. However, you cannot find a better place to do so driving a short distance from the city.", "Knowledge": "", "Response": "I would think there would be very dramatic landscapes near Las Vegas. Is that true?"}
{"Context": "My favorite movie is ant man . I love to wtach this movie  EOS Ant man is a great movie - what do you think about Paul Rudd's acting? EOS just wow i think he deserv oscer EOS Yes. He makes the movie really funny. His sarcasm is on point. EOS hahha that why i love this movie EOS He's been in film for a very long time. At least since 2000 if not longer. He was in Anchorman! What a legend. EOS really i shound to know omg EOS Ant Man and the Wasp is another great movie. Paul Rudd does a great impersonation of Michelle Pfeiffer! EOS yes i saw this movie also , you are great nice too meet you", "Knowledge": "", "Response": "Do you have a favorite scene in either Ant Man or Ant Man and the Wasp?"}
{"Context": "My favorite author is Anais Nin. My favorite book by her is A Waste of Timelessness EOS Have you read anything by Anais Nin? EOS yes that's very interesting Author and now that's stories available in stores and amazon now. EOS I'm not sure I understood you clearly. I do find her interesting, as well.", "Knowledge": "The Anais Nin Foundation", "Response": "The Anais Nin foundation is famous as well."}
{"Context": "My favorite game is Backgammon. I day dreamed about playing backgammon with Stephen Hawking EOS Do you play chess or backgammon?  Which do you prefer?", "Knowledge": "247 Backgammon offers the best backgammon game online. Play with an artificially intellegent opponent or play with a friend with Pass & Play! 247 Backgammon has games in five difficulites, ranging from easy to expert! You ll be sure to find a difficulty you feel comfortable playing, whether you are a beginner or seasoned backgammon player. Options only on 247 Backgammon include doubling cube, highlights, match points, and chip color! This backgammon site even remembers your preferences every time you come back so you ll be set to play immediately! The gameplay on 247 Backgammon is seamless and you ll quickly become addicted to the beautiful artwork and perfect puzzle game.", "Response": "do oh Play online backgammon?  247"}
{"Context": "My favorite item recently bought is Macbook Pro . I bought a Macbook pro because I like to code  EOS NFL Football Teams Scores Stats News Standing Rumors EOS I use my Macbook pro to do data analysis on sport data EOS MacRumors Apple News and Rumors EOS I bought the MacBook because it has the M1 chip. The performance is stellar! EOS Macbook was one of the most wanted thing EOS The MacBook Pro also has a touch bar. EOS Yeah It was important to MacBook EOS The touchbar and the M1 chip has made the performance remarkable.", "Knowledge": "Apple on Tuesday introduced the new iPad Pro with all-screen design, Face ID, A12X Bionic chip with next-generation Neural Engine and up to 1TB internal storage.", "Response": "Apple unvelis the new iPd Pro and Macbook Air with A12X biionic chip"}
{"Context": "I like to eat spaghetti. Spaghetti with pesto is the best. EOS I love pastas, especially with spicy or pesto. EOS Do you like your spaghetti with meatballs? That's my favorite dish with parmesan cheese on top EOS Meatballs are good with pasta or rice. What kind of meat balls do you like? EOS I prefer a combination of pork, sausage and ground beef. EOS That sounds really yummy. I usually have beef meatballs with pasta. Beef meatballs taste better than chicken ones, to me. EOS I'm not crazy about chicken meatballs but they are healthier. EOS It's sad that yummy cannot go well with healthy. I like Asian style meatballs too.", "Knowledge": "", "Response": "I've never heard of that. What is the difference between Asian style meatballs and Italian style?"}
{"Context": "My favorite song is melody songs. Songs makes me happy EOS I want to like hearing melody songs EOS Yes I too like melody songs. I like to hear those type of songs while driving. Have you experienced this? EOS Which melody song are you liked? EOS I like all the songs. Specifically I like the songs of Taylor Swift. EOS good, I like this singer song. very interesting on melodies. EOS While hearing such type of songs, I will forget all my tensions. They are like my friend.", "Knowledge": "En·​glish | \\ ˈiŋ-glish , ˈiŋ-lish \\ : of, relating to, or characteristic of England, the English people, or the English language Definition of English (Entry 2 of 4)", "Response": "Are You Fluent English Speaking?"}
{"Context": "My favorite item to buy is beauty products. I enjoy playing with makeup EOS I've been spending way too much time experimenting with different ways to contour my face.", "Knowledge": "Affordable Cosmetics Skin Care Brands to Invest In Who Makes the Best Cosmetics? Most Reliable Lipstick Brands Lip Balm Brands You Can Rely On The Very Best Professional Makeup Brands Perfume and Fragrances High Quality for Half the Price Great Brands Flying Under the Radar Brands That Are Cruelty-Free Favorite Nail Polishes Sunscreen Brands The Best Lip Gloss Brands Hair Color Brands The Very Best BB Creams The Top Hair Dye Brands Natural Cosmetics Brands Top Brands of Mineral Makeup Organic Makeup Brands List Rules Upvote your favorite cosmetic, skin, hair and nail care companies. The beauty product industry and the best skin care brands usually enjoy fierce customer loyalty among brands. Once customers find the perfect beauty or makeup product, they tend to stick to their favorites. Because consumers have such strong brand loyalty, people are often more willing to pay a price premium for their favorites. There are also many inexpensive, quality beauty brands that are affordable for the average consumer. Biore, Clean & Clear and Neutrogena make affordable beauty products that are loved by millions of people across the world.", "Response": "I want to like beautiful products on cosmetics."}
{"Context": "My favorite movie is Tommy Boy. I saw it in the 90s. EOS I really like comedies. EOS great genre. tommy boy is comedy gold with Chirs Farley EOS They tried to recapture the magic with Black Sheep, but it wasn't the same.", "Knowledge": "The chemistry between the two stars of Tommy Boy was real. As fellow Saturday Night Live cast member Mike Myers recounted in the I Am Chris Farley documentary, Chris Farley and David Spade were  a fantastic combination of ultimately innocent and ultimately jaded. They are the oil and vinegar of comedy.  Tommy Boy is anchored by the duo s real life friendship and dynamic. There wasn t much of a script when they started shooting. SNL writers Jim Downey (no relation to MovieWeb s Ryan J. Downey,  though I m a huge fan!) and Fred Wolf worked hard with Segal,  though the script was credited to Third Rock from the Sun and That  70s Show creators Bonnie and Terry Turner. Writing continued every night during the frantic and sometimes chaotic production.", "Response": "yeah i agree. can't replicate it at all but Chris Farley was hilarious in that movie.  He was also great in SNL."}
{"Context": "My favorite game is Slots. I like to play the slots at Casinos. EOS I like to play the slot machines but I don't like to lose money. EOS I want to like slots games. very interesting to played. EOS I enjoy the old fashioned slot machines, that have the fruit. I usually play the quarter machines. EOS Which game do you like playing? EOS I usually have a limit of how much I will spend feeding the slot machine. Usually about $50. EOS This is not slot machine. Do you understand this question first. This game name is slot. EOS A slot machine is a game that you pull the handle, and see what shows up on the screen. You can win money playing on a slot machine. EOS It's ok. I want to like My best favorite game is WWE. EOS I don't know very much about wrestling. Who is a popular wrestler?", "Knowledge": "Follow Brock Lesnar on Facebook Follow Brock Lesnar on Twitter", "Response": "The beast Brock lesnar is my favorite wrestler."}
{"Context": "My favorite hobby is cleaning. it gives me solace and a sense of belonging EOS hey i love cleaning seeing my apartment clean is so refreshing what about you EOS Which apartment do you cleaning? EOS the apartment i live in EOS Which place apartment do you cleaning? EOS my texas aprtment the whole of it", "Knowledge": "Cleaning Model Trains Model Train Basics", "Response": "Your English is not perfect. Do you no English knowledge?"}
{"Context": "My favorite sports team is pen drive. i want to HP pen drive  EOS i want to buy new pen drive this year do you have any session EOS This pen drive team how many times win last year? EOS I saw this team win more then 10 time EOS I want to like liver pool team. EOS really i love also  this team EOS Which do you like team and team players? EOS I like to paly also naymar what you do EOS You have good not correct answer. Please response to answer my question. EOS I like to Liverpool but i also like naymar", "Knowledge": "The 9 Best USB Flash Drives to Buy in 2019 by Patrick Hyde and David Beren", "Response": "This team How many goals achieved last year?"}
{"Context": "I live in Minneapolis, Minnesota. I love to travel. Travelling makes us to know the world EOS I love to travel. I want to travel for a long at least once in my lifetime.", "Knowledge": "", "Response": "Where are some places you'd like to travel to?"}
{"Context": "My favorite athlete is inspire in athletes. be bold and live like athletes EOS type what is your favorite athletes", "Knowledge": "The story behind the best headshots in college baseball Live: DeRozan Returns to the Six Joon Lee Report: Steelers Don t Want AB in AFC [ November 16, 2018 ] 6 Myths About How to Get Abs\tBodybuilding December 17, 2016 Joey Percia Athletes, Bodybuilding, Training 0 The Best Workout For An Athletic Body It’s 9 pm on Tuesday night. Over the last 2 hours you’ve been sipping your glass on water, scanning curiously over the latest workouts on various exercise websites. Each workout is markedly different. Athlete, bodybuilder, powerlifter…huh? One site caters to bodybuilders, one site markets to powerlifters, one site markets to those people just looking to “Lose 10 pounds Fast!”, and one site aiming to help athletes reach their next level of competition. So while maintaining a certain aesthetic look isn’t an athletes top priority, it’s often a nice by-product of training with a purpose. 4 Ways to Think Like An Athlete, Perform Like A Boss Athletes are known for their discipline, teamwork and determination; and many have utilized these skills to guide their successful transition into the business world. But you don t have to be an athlete to possess these traits: anyone can learn them. Here are some habits and lessons from athletes that can help everyone succeed in business.", "Response": "my favorite atheletes running like"}
{"Context": "My favorite singer is Frank Sinatra. He sings some of my favorite Christmas classics and has a voice that is angelic. EOS Frank was from the original ratpack and sung songs like New York. EOS Frank Sinatra my way is a good song. you like it?? EOS yes but one of my favorite is Love and Marriage. EOS great song any other songs you enjoy? his favourite color was orange EOS Any of his Christmas Songs were great. I would say I like them all very well and gets me in the spirit. EOS he sang Christmas songs. didn't know that.  his type of singing is like jazz music EOS That's what I first remember him by. Yes and a little bit of big band genre. EOS definitely a timeless singer and most enduring singing of all time EOS yes his music even though he isn't a live anymore lives on and still loved", "Knowledge": "Frank Sinatra’s Merry Best Gathered For ‘Ultimate Christmas’ Album", "Response": "you say you like Frank's Christmas  songs. he had an ultimate Christmas song album"}
{"Context": "My favorite singer is Michael Jackson. No one can beat him in performance EOS I like Michael Jackson very much. I like to watch all his songs and dances. EOS Do you like all of the jacksons or just Michael Jackson? EOS I like only Michael Jackson. Do you know any other Jackson in the singing field? EOS What is your favorite Michael Jackson song? EOS I like all his songs. Mt favorite is Beat it. EOS What is your favorite Michael Jackson album? EOS The album name is, 'Beat it'. That will be great to hear.", "Knowledge": "‘MJ: THE MUSICAL’ COMING TO BROADWAY", "Response": "That's a great album. Did you ever see a Michael Jackson concert?"}
{"Context": "My favorite clothing type is under ware. I love to ware to under ware ", "Knowledge": "", "Response": "Underwears are very nice and beautiful, makes people attractive in bedrooms"}
{"Context": "My favorite movie is the nun . i like horror movie", "Knowledge": "", "Response": "what is your favorite horror movie?"}
{"Context": "My favorite item to buy is Mobile. I like to buy new mobile phone EOS What brand of phones do you like? EOS I like very much iphone brand EOS Which iPhone one do you have now? EOS Now I am using iphone12 EOS Let me guess, the Pro Max? EOS Actually I did not use the pro Max EOS Which 12 do you have? EOS I have used only iphone12 EOS I understand there is a Mini, an iphone12, 12 Pro and a Pro Maxx EOS Yes,My one is iphone12", "Knowledge": "", "Response": "Do you like the new camera?"}
{"Context": "My favorite game is game like one. EOS game is my life this one EOS I am like game one EOS yes like this game one EOS How many times a day do you play the game EOS yes every day paly the game thank you", "Knowledge": "This Post is out of curiosity and I would likely be looking for a new game once I finish my current library. So tell me some of your favorite games and why(doesn t have to be current, it could be older)", "Response": "I play the game for 3 hours a day"}
{"Context": "My favorite hobby is building houses in minecraft. He usually builds in a medieval or rustic style, but occasionally modern builds. EOS Hey there. I usually enjoy trying to build a large town in minecraft even though it's just by myself. EOS My favorite hobby is building houses in minecraft. Which your favorite hobby. EOS Nice. Do you have a specific building style you like to do in minecraft? EOS Ok, I have to usually builds in a medieval of this is very comfortable. EOS Oh wow same here too actually. I had to watch youtube videos in order to learn how to build in that style. I still have much to learn in order to learn how to do specific medieval periods. EOS I have to participate in the occasionally modern builds is want to watch youtube videos and audios in order to learn how to build in that style. EOS Oh you do modern builds too? I mostly built fast food restaurants and warehouses so far.", "Knowledge": "Man dies in Border Patrol custody CNN Third migrant dies in Border Patrol custody in as many months USA TODAY Migrant dies while in custody of Border Patrol in Texas, reports say Fox News Ailing Mexican migrant, 45, dies in CPB custody, third such death in three months New York Daily News Third migrant dies in border patrol custody in past few months New York Post View full coverage on Google News Marvel s  Punisher  and  Jessica Jones  canceled by Netflix Fox News ‘The Punisher’ & ‘Jessica Jones’ Canceled By Netflix; Latter’s 3rd Season Still To Air Deadline Netflix s The Punisher and Jessica Jones Are Officially Cancelled Gizmodo Marvel TV s superhero universe on Netflix comes to an end KPRC Click2Houston Marvel TV s superhero universe on Netflix officially comes to an end. Could Disney+ be its new home? CNN View full coverage on Google News", "Response": "He usually builds in the mostly kind of the fast food restaurants of houses in minecraft."}
{"Context": "My favorite song is ohh baby. i won best singer ward EOS Ohh baby is such a nice song. It make one get emotional. EOS \"Fix You\" is a super sad song on its own, but when you hear the story behind it, it becomes that much more heartbreaking. Coldplay frontman Chris Martin wrote \"Fix You\" for his then-wife, Gwyneth Paltrow, to comfort her following the death of her father. An error occurred. EOS Exactly, after his father's died, he mad a music which drove him to tears. EOS ohh okay and what song do you like EOS Well, you interest matters. Although Ohh baby, the song actually hit the top notch. EOS YEAH yes and anything else EOS Have you listened to fix you more? the song was covered unexpectedly and captured a lot of attention. EOS no 0i dont capute attention", "Knowledge": "", "Response": "Perhaps you just have to get over the music then. you are going feel it."}
{"Context": "I like classical music. i recently won best music director award EOS Wow..!!love to hear you like classical music. I also like it the most. EOS ohh that is nice and what song do you like EOS I love to hear Appalachian Spring. What's your choice? EOS artist aaron copland he is a best artist EOS No doubt about that. The fanfare for the Common Man also a great piece by him. have you heard this song? EOS yeah i heard that song", "Knowledge": "", "Response": "What was the best song you ever heard from Aaron Copland?"}
{"Context": "My favorite hobby is drawing. i love seeing the transformation EOS My favorite hobby is drawing. Which your favorite hobby. EOS mine too is drawing what do you love drawing EOS Ok, I want to drawing is favorite art. EOS exactly im more into drawing animals EOS I have to love seeing the transformation of drawing in to animals. EOS my favourite animal drawing is actually an elephant EOS Ok, I want to very picture of drawing. EOS whats your favourite item to draw", "Knowledge": "The researchers even invented two characters, “Tina” and “Maggie”, and asked people who they preferred – money-grubbing sociopath Maggie, who would rather work more hours and make more money, or workshy hippy Tina who wanted to work fewer hours and make less cash. The option of working less and making more money was strangely absent, although that is of course the obvious answer, as evidenced by the hordes of people who bought lottery tickets this weekend. My main issue with the research is the idea of adults having hobbies. What are hobbies anyway? Pastimes, suggests my boyfriend, which makes them sound marginally less awful. But is eating biscuits while watching Keeping Up with the Kardashians a pastime? Because if so, I am very serious about it, and presumably I am very happy too, although I wouldn’t know it, because I have given up my favourite pastime (drinking) for January – and perhaps for ever if the government’s draconian new guidelines are to be believed. After all what is the point of being an adult if you can’t gleefully cast off hobbies? Most of them not only smack of Victorian ideals of self-improvement, but are basically activities adults made you do when you were a child so they could get you out of the way for a few hours. If you have been a Brownie or a Scout you will know what I am talking about. Here’s what happened when I was a Brownie: I was awarded a badge for collecting scented erasers (a 1980s hobby if ever there was one) and I was made to do Brown Owl’s housework, under the guise of gaining another badge.", "Response": "I want to animals drawing is very likely."}
{"Context": "My favorite sports team is LFC. They are a Premier League team that plays exciting EOS LFC is my favorite sports team. They are a Premier League team with an exciting style of play. EOS they've got a very good players and manager EOS Definitely. Klopp is a good coach and all the players play really hard and with passion EOS i know right,that's why they were last season's champions EOS Yes they have very strong mentality and never give up which is how they score so many last second goals", "Knowledge": "", "Response": "i know right,very strong mentality"}
{"Context": "My favorite music band is Breaking Benjamin. The lead singer has a very successful rock band EOS breaking benjamin, are they a grunge metal band? EOS no hard rock. I have seen them 3 times. He loves his fans EOS where they good? they from the USA or a european band? EOS They are from Pennsylvania. The lead singer is Benjamin Burnley EOS Thanks.  where was he born? Born in New Jersey or New york? EOS He was born in New Jersey and is 43. EOS his song so cold, have you heard the song? EOS Yes of course. It's one of my favorites. The lead singer is afraid of flying and only takes bus trips?", "Knowledge": "Benjamin Jackson \"Ben\" Burnley IV (born March 10, 1978) is an American musician, composer, and record producer, best known as the founder and frontman of the American rock band Breaking Benjamin. As the sole constant of the group, Burnley has served as its principal songwriter, lead vocalist, and guitarist since its inception in 1999. Since signing with Hollywood Records in 2002, Burnley has composed five studio albums under the name Breaking Benjamin, three of which have reached platinum and one of which has reached gold in the United States. Outside of Breaking Benjamin, Burnley has also collaborated with acts such as Adam Gontier and Red. Benjamin Burnley was born in Atlantic City, New Jersey and grew up in Cape May County and in the Snyder County town of Selinsgrove, Pennsylvania. At 16, he became home schooled and quickly passed the GED requirement. At 21 he moved to Wilkes-Barre, Pennsylvania, where he became a roommate of former Breaking Benjamin bass player Jonathan Price. During his early teen years he taught himself to play guitar by listening to Nirvana's \"Nevermind\" (he cites Nirvana as his biggest influence). Before Breaking Benjamin was formed, Ben Burnley earned money playing cover songs, mixed in with his own in various coffee houses and other all age venues mostly with local neighboring musicians .", "Response": "no way, interesting.  succesful guy for having only a GED diploma at age 21"}
{"Context": "I love going to concerts. live bands are just  my best EOS live bands are so nice and chilled EOS What bands have you seen recently? EOS i attended a country music band a n year back EOS I think Luke Bryan or Florida Georgia Line would be good to see live EOS do you know when their show will be EOS I don't know. I know they played at some cool venues in the past though- like Stagecoach and Country Stampede EOS i guess they will do online band shows now", "Knowledge": "As Florida Georgia Line tour dates add up they keep knocking them down without ever showing a sign of stopping. Heavy hitting country hits, lights, and the crowd roaring. Nothing but high energy from this duo and their incredible band. Don’t forget to see them when they stop by your town it’s an experience you don’t want to miss!", "Response": "Maybe. In the past, they had a ton of tour dates, though. They have such good energy"}
{"Context": "My favorite movie is modern families. shows how we have grown through diffrent generations EOS they show life in the eyes of close to four diffrent generations EOS Is that Modern family? It's a great show, did you watch the series finale? EOS yes she got a baby", "Knowledge": "Modern Family  Stars Get  Significant Raises  With Season 9-10 Pickup", "Response": "They all were very well paid for the final series 9 and 10! Is it your favourite show?"}
{"Context": "My favorite clothing type is grunge. Think the 90's: baggy pants, band tshirt, flannel! EOS What kind of clothing style and type do you like? I'm grunge. I've been this way since the 90's. EOS grunge very comfortable clothing. EOS It just works! I still have my old concert shirts. I saw Nirvana live!", "Knowledge": "Iran s foreign ministry on Sunday summoned the Pakistani ambassador after Tehran accused Islamabad of harbouring a jihadist group behind a deadly suicide attack on security forces.  The Islamic Republic of Iran expects Pakistan s government and army to seriously confront ... the terrorist groups active on its border with Iran,  the foreign ministry said in a statement. An Iranian official at the ministry called on Pakistan to quickly take the necessary steps for the identification and arrest of the attack s perpetrators.", "Response": "Needs a little clearer explanation"}
{"Context": "My favorite game is Mortal kombat . an action game with a lot of fighting  EOS Do you ever play Mortal Kombat? Or II or 3? EOS i played both, been playing it since i was a kid", "Knowledge": "The series has a reputation for high levels of bloody violence, including, most notably, its Fatalities (finishing moves, requiring a sequence of button inputs to perform). The Fatalities, in part, led to the creation of the ESRB video game rating system. The series name itself is also known for using the letter \"K\" in place of \"C\" for the hard C sound, thus intentionally misspelling the word \"combat\", as well as other words with the hard C sound within later games in the series. Early games in the series were also noted for its realistic digitized sprites (which differentiated it from its contemporaries' hand-drawn sprites) and an extensive use of palette swapping to create new characters.", "Response": "The blood is so cool. It's so realistic."}
{"Context": "My favorite sports team is Buffalo Bills. American Football team EOS Buffalo Bills played well this year...Who do you think they will draft? EOS I'm not sure who they will draft this year honestly. Theyre lower on the draft list but I'm hoping some better defensive players EOS Did you ever see a live football game in Buffalo? EOS No, I'm live in NC so unfortunately I've not had the opportunity.  My husband and I would like to make a trip sometime though.", "Knowledge": "Light Rain / Windy Extreme weather is bursting pipes inside, outside and underground", "Response": "Buffalo weather can be extreme and brutal...I bet it would still be exciting though."}
{"Context": "My favorite clothing type is sweater. I like the green sweater very much, it is prettier than the yellow one ... which one do you like? EOS los colores claros me quedan bien, a ti? EOS My favorite same too me cloth is sweater EOS what colors you like it?", "Knowledge": "The 8 Basic Sweaters Every Man Should Own in 2019 Big knits poppin’. By Yang-Yi GohFebruary 5, 2019View More 7th Avenue - Stripe Halter Sweater Stripe Crisscross V-Neck Sweater 7th Avenue - Red Colorblock Sweater Travel + Adventure SHOP WOMEN S SHOP MEN S Seek Spring s Current SHOP WOMEN S TOPS For the Road Ahead Target/Women/Women s Clothing/Sweaters (277)‎ Women s Textured Shorts Open Layering - Universal Thread Universal Thread™new at target Presidents’ Day Deals Up to 25% off home* Online only. Ends Monday.", "Response": "I like favorite color Red and blue"}
{"Context": "My favorite music band is Bon Jovi. I went to a concert but sat in the nosebleed section. EOS My husband and I were given  Bon Jovi tickets the day of a concert and had to drive three hours one way to get there.  It was sooooo worth it! EOS sure, some likely never realized how much the ticket. EOS That band has been amazing since they started back in the 1980s.  Usually as bands age, they get so much worse.  Not these guys! EOS sure the made their name through a genius soundtracks. their concert is most anticipated one. EOS I can't believe how Richie Sambora just disappeared from the band with no explanation.  I don EOS I guess he has a greater plan. Bon Jovi was the top artist in their runaway single. EOS They even did a country/pop album and I didn't think I'd like it.  But I loved it!  I guess Jon Bon Jovi can accomplish anything when it comes to music.", "Knowledge": "", "Response": "sure, he's so talented and always ready to give the best result regardless."}
{"Context": "I live in El Paso, Texas. My wife and i like to go scuba diving. one day my wife and I traveled to choroni, venezuela and dived for the first time EOS one day my wife and I traveled to choroni, venezuela and dived for the first time EOS I want to like long travel. EOS I know Venezuela is very bad right now, but believe me it's the best EOS Which place do you like dived for first time? EOS I already told you above .. EOS How many you and your family traveled? EOS my wife, me and my children", "Knowledge": "With a world full of fascinating destinations, choosing the perfect place to vacation can present a challenge. That s why U.S. News used expert opinions, user votes and current trends, in addition to evaluating sights, cultures, scenic beauty, food scenes and more, to compile this list. Use these recommendations to craft your travel bucket list, and cast your vote below to help us determine next year s list. Take a photo tour of the World s Best Places to Visit » Worldwide USA Caribbean Canada Mexico Central & South America Europe Africa & The Middle East Asia Australia & The Pacific Best Places to Visit in the Caribbean", "Response": "How many time do you traveled?"}
{"Context": "My favorite hobby is flying drones. I have 3 drones I love to fly. EOS I nearly lost one of my drones in a tree today, it was scary. EOS To hover, you will use the throttle to get airborne. You will then use small adjustments of the right stick EOS yes, that is generally how they work. A strong gust of wind knocked mine off course. EOS When you inhale, the diaphragm pulls down to help pull air into the lungs. ... Getting hit in the stomach or back can EOS interesting. it was wind in the sky that knocked it off course. I should know better than to fly a drone on a windy day. EOS The Mavic Air 2 features a maximum speed of 68km/h in sport mode and a wind resistance of 29-38km/h winds. This can help you reach greater distances to search for that perfect shot EOS That is a fast drone. Very expensive though.", "Knowledge": "HobbyNews.com Florida student arrested for disturbance after he refused to say the Pledge of Allegiance, police say - CNN Florida student arrested for disturbance after he refused to say the Pledge of Allegiance, police say CNN Florida boy arrested after refusing to recite Pledge of Allegiance in class Vox.com Sixth-grader arrested in Florida after refusal to participate in Pledge of Allegiance led to confrontation NBC News A Florida 6th-grader called the Pledge of Allegiance ‘racist.’ Then he got arrested. Miami Herald Florida student faces misdemeanor charges after refusing to stand for Pledge of Allegiance USA TODAY View full coverage on Google News Marvel s  Punisher  and  Jessica Jones  canceled by Netflix Fox News ‘The Punisher’ & ‘Jessica Jones’ Canceled By Netflix; Latter’s 3rd Season Still To Air Deadline Netflix s The Punisher and Jessica Jones Are Officially Cancelled Gizmodo Marvel TV s superhero universe on Netflix comes to an end KPRC Click2Houston Marvel TV s superhero universe on Netflix officially comes to an end. Could Disney+ be its new home? CNN View full coverage on Google News Read n  Reviewed:  T-54/5 to IDF Tiran 4/5: The Birth of the Bastard Tank  from Abteilung 502 Paul Lee is intersected in post-war AVF vehicles - and having made Miniart s T-55 here on the news we thought it only proper to let him take a look at Abt. 502 s new book featuring the IDF T-54/5 s and their service in the Israeli hands. See what he thought about the book in his review... Andy Moore hs completed VOIIO s new 1/35th scale M1A2 SEP V2 Abrams to a great finish. He has added his own flourishes, fixes and a very convincing weathering, dirt, mud and grime to make this tank look so much more than the original promise. See it come together in the final part of this story... New Bless This Kitchen Towels $9.99 Quick view New Red Teflon Apron $19.99 New White Whisks $9.99 hob·​by | \\ ˈhä-bē \\ plural hobbies Definition of hobby hobbyist \\ ˈhä-​bē-​ist \\ noun Looking for a new hobby? Or trying to decide which one will be the best use of your limited free time? We’ve got you covered. Arts, crafts, and other skills This site is intended for informational purposes only.", "Response": "Earlier this month, the Drone Racing League (DRL) set a world record while testing one of their new racing drones! With a top speed"}
{"Context": "My favorite song is Rock. rock is very best song EOS is rock the name of the song? who by? or do you mean your favourite style is rock? EOS yes my favorite style rock EOS What rock bands do you lie? I like led zeppelin they are in my top 50 EOS your top 5 bands tell", "Knowledge": "Queen -  The Invisible Man", "Response": "Queen, AC DC, Led Zeppelin, The Who and probably Rush. how about you?"}
{"Context": "My favorite artist is Nickleback. Nickleback always makes the best music EOS you like Nickelback?  they are a Canadian rockband EOS Yes they are. One of the most popular. EOS you like there party hits? EOS Yeah, although they don't really get played much at parties.", "Knowledge": "Party Hits! Since the mid- 90s, Alberta s Nickelback (singer/guitarist Chad Kroeger, bassist Mike Kroeger, guitarist Ryan Peake and Daniel Adair, replacing original drummer Brandon Kroeger) have evolved from sounding like a Pearl Jam tribute band to becoming icons of radio-friendly, post-grunge modern rock. Nickelback s popularity first gathered steam with the single  Leader of Men  off their second self-released album, 1998 s The State. The song was in heavy rotation on Canadian radio, and soon American label Roadrunner signed them (and reissued The State). They then toured with Creed, and in 2001, Silver Side Up yielded subsequent hits, such as  Someday.  In 2005, Nickelback returned with All the Right Reasons, featuring members of ZZ Top and Pantera, which pushed them into contemporary heavy-rock territory and made them one of the decade s biggest bands in alt-rock, thanks to hits like  Photograph  and  Savin  Me.  For 2008 s Dark Horse, they brought in producer Mutt Lange (Back in Black, Pyromania) to add extra punch to their arena-rock anthems and power ballads. Bebop Digital", "Response": "they are from Alberta Canada"}
{"Context": "My favorite hobby is road trips. helps one clear the mind EOS Taking road trips helps my mind relax as I look at nature. EOS Yes i like it same too me EOS The road trip actually makes me generate clear ideas EOS Yes clear ides very like it EOS do you take road trips EOS Yes i take road trips EOS you feel so rejuvinated like taking a bath EOS One clear the mind taking the both EOS i am glad you love road trips", "Knowledge": "Ask 9.70 x 36100 Earnings Date Apr 30, 2019 - May 6, 2019 Edited Transcript of GLAD earnings conference call or presentation 7-Feb-19 1:30pm GMT Islam and Christianity: How To Start The Conversation About Jesus Experiencing God s Love In Worship c : very willing glad to do it 3a : marked by, expressive of, or caused by happiness and joy a glad shout b : causing happiness and joy : pleasant glad tidings Join the Fight for LGBTQ Justice Statement of GLAD Executive Director Janson Wu on Donald Trump Declaring a State of Emergency for Border Wall GLAD, NCLR Statements on Introduction of Legislation to Protect Transgender Service Members from Trump-Pence... Keep your kitchen clean and garbage free with Glad® kitchen trash bags. From tall bags with reinforcing bands, to tear resistant ForceFlex® bags, to Odorshield® bags that neutralize strong odors, there s a variety of sizes and types. So you can choose the bag that ll work hardest for your kitchen. Clorox® Antimicrobial Odor Protection of the Bag Large KitchenPro™ Drawstring Bags", "Response": "Yes i love road trips and glad"}
{"Context": "My favorite hobby is watching movie. very interesting watching movie EOS watching movies can help pass time. one can gain knowledge from it. EOS sometime watching knowledge movie always", "Knowledge": "If you ve ever been confused about which fork to use at a fancy dinner, just watch Titanic for Molly Brown s advice to Jack during his invitation to dine with first class.  Just start from the outside and work your way in.  It s much simpler than Barney s confusing tutorial to Vivian in Pretty Woman.", "Response": "you can get confused about when dealing with outdated movies. people like fancy one though."}
{"Context": "I am touring with frank ocean. Frank ocean is a beautiful place", "Knowledge": "And so the wait is over, Frank Ocean‘s new album formerly known as ‘Boys Don’t Cry’ is finally here and now it’s called ‘Blonde’, which just so happens to also be the name of a racing car company that the R&B singer owns.", "Response": "I like sea touring."}
{"Context": "My favorite author is David McCaullaugh. He's written some great biographies. EOS Have you read any of David McCaullaugh's books? EOS David McCaullaugh is best author EOS He wrote a really interesting book about Steve Jobs, the founder of Apple. Steve was so intelligent, but had his issues relating to people. EOS Yes, what are your favorite lines in what he wrote EOS David also did a great job narrating the Ken Burn's series on the Civil War. He as such a distinctive voice, which has a warmth to it. EOS David McCaullaugh Do you know what books he wrote? EOS He's written quite a few. What makes his novels come to life is the amount of detail he writes about. He spends years researching his book topics and that really shows in his writings.", "Knowledge": "Mr. McCullough was in Columbus to speak to a group from the the Ohioana Library about his new book, The Pioneers: The Heroic Story of the Settlers Who Brought the American Ideal West, which came out last month. We were just delighted that he accepted our invitation to have breakfast with a few of our family members who adore his books. Mr. and Mrs. McCullough had spent the weekend in Marietta with all of their family, and I think all of Marietta! He said it was a really great celebration about the settling of Marietta and the beginning of the Northwest Territory.", "Response": "Yes, the comments in his writings are fantastic"}
{"Context": "My favorite sports team is Bangladesh Cricket Team. Bangladesh is improving their cricket EOS How do you feel about cricket? EOS I love cricket. And Bangladesh is doing well EOS Mashrafe Mortaza is the captian, right? EOS Yes he was.But now he retired. EOS Oh who is the captain now? EOS Maybr Tamim Iqbal or Shakib Al hasan", "Knowledge": "Born on March 20, 1989, Tamim Iqbal is a southpaw who packs as much punch as grace with his exhibition of strokes. Unarguably the greatest batsman produced by Bangladesh so far, he was instrumental in Bangladesh s win over India in the 2007 ICC World Cup. With over 8,000 runs in international cricket, he continues to be a central figure in Bangladesh s rise in world cricket. Tamim Iqbal has also been named as one of Wisden Cricketers  Almanack s four Cricketers of the Year and Wisden s Test Player of the Year. He was awarded with the accolade in 2011 making him only the second Bangladeshi player to achieve this prestigious feat. Iqbal is married to his childhood friend ad longtime sweetheart Ayesha Siddiqa in June 2013.", "Response": "Iqbal is a southpaw."}
{"Context": "I live in San Jose, California. I like going to the moives. Horror movies are facorite EOS What type of movie do you like watching? EOS I like horror movies.", "Knowledge": "Obsessed with all things horror? Welcome to the House of Screams - where we’ve scared up the best horror movies just for you.", "Response": "Horror  movie are scary. Some people are obsessed with it."}
{"Context": "My favorite hobby is Baking. I made a pizza last night with my fresh made pizza dough EOS My Pizza dough had herbs and I coated it with butter and garlic powder", "Knowledge": "", "Response": "That sounds amazing! What style of pizza do you typically like to make?"}
{"Context": "My favorite hobby is traveling. I like seeing new places and doing new things. EOS I like to travel. Since I like seeing and doing new things since it improves my life. EOS Travel is definitely lot of fun! It's exciting to see new places, sights and sounds and relax.  Do you have a favorite travel destination? EOS Yes! It's hard for me to pick since there's so many but I like going to NYC or Europe since theres so much culture and things to do. EOS There's so much in NYC!  You can look over the city from the Top of the Rock Observation or see artwork. Plus there's there's all those Broadway shows. What have you seen in NYC? EOS I've been to a lot of places! The skyscrapers, the museums, the restaurants, the shows, the clubs, and so much more. I go a lot since I can't see it all in one trip but I enjoy it every time! EOS So true! Europe is such a big place. Have you been to England or France? EOS Yes! I've been to London and Paris. It's different from the US since there's more history there but I like how unique and cultured those places are.", "Knowledge": "If it s your first time to Paris, you ll probably want to spend some time at the world-renowned Eiffel Tower, the Louvre and Notre-Dame, but don t miss out on other notable city jewels such as the Musée d Orsay, the Luxembourg Gardens or Le Marais. There s no way you ll get to do it all – museum-touring, shopping, cemetery-perusing, district-exploring, opera-attending – so plan your own itinerary, group sightseeing nearby attractions together and see Paris on your own terms.", "Response": "You're right.  Paris must be beautiful. They're making progress on restoring Notre-Dame."}
{"Context": "My favorite band is the rolling stones. I met Mick Jagger EOS How's it going? When did you listen to the rolling stones last? EOS It is going well! I just listened to them today, I love their music.", "Knowledge": "", "Response": "Oh fun! What are your favorite songs by them?"}
{"Context": "My favorite movie is the 100. i like this move one of my favorite EOS Are you like for tennis game and play it EOS yes i play it what about you EOS I am also play, you are international player EOS no im not are you", "Knowledge": "American McDonald beats del Potro in Delray Beach OpenAmerican Mackenzie McDonald beat No. 1-seeded Juan Martin del Potro in the quarterfinals of the Delray Beach Open, 6-4, 3-6, 7-6 (5) Bencic tops 2-time Dubai champ Svitolina; Kvitova in finalBelinda Bencic stops 2-time defending champ Elina Svitolina in Dubai and will face Petra Kvitova in final Bencic upsets Halep to reach Dubai semifinals; Kvitova winsUnseeded Belinda Bencic rallied to beat second-ranked Simona Halep 4-6, 6-4, 6-2 Thursday to reach the Dubai Championships semifinals", "Response": "Ok I am also normal play tennis game"}
{"Context": "My favorite hobby is painting. I love to paint in the morning", "Knowledge": "Mortal Kombat 11 adds another franchise veteran to its roster with Jade, the emerald-clad assassin. If you re playing Anthem early with Origin Premier, you have some bonus items waiting for you already. PS4 Critics Choice Sale On Red Dead 2, Battlefield 5, And More (US) Lifeline is a very useful support character for any Apex Legends team, but you have to protect yourself to protect others.", "Response": "what are you like for games and your favorite playing games"}
{"Context": "My favorite athlete is Rusell Westbrook. A talented basketballer with a lot of wins  EOS What sports does  Rusell Westbrook play EOS He plays Basketball, do you watch basketball? EOS Yes, Joel Embiid  is a top player in my favor EOS what team does he play for?", "Knowledge": "Joel Embiid dominates Bulls in Sunday s win", "Response": "Joel Embiid play for the Bulls"}
{"Context": "I live in San Jose, California. I have a dog and we go for walks. i have a dog and i love it ", "Knowledge": "There are 3 dog friendly hiking trails in San Jose, CA. Use the links below to get an overview of each one, see pictures, print directions, and even read reviews from other dog owners. Coming from out of town? Get a discounted rate on pet friendly hotels in San Jose, CA, or call 877-411-FIDO to speak with one of our pet travel experts!", "Response": "San Jose has some great dog walking trails. Do you use have any favorites places you take your pooch?"}
{"Context": "My favorite singer is Bob. EOS singer you know please tell EOS my favorite singer bob marley EOS yes my favorite in bob Marley", "Knowledge": "The Queen: Aretha Franklin", "Response": "bob marley is good singer"}
{"Context": "My favorite song is sorry. I lvoe to  this song  EOS What is your favourite lyric from Sorry? EOS all of part i like to", "Knowledge": "[Written by Julia Michaels, Justin Tranter, and Justin Bieber]", "Response": "Justin Bieber is a great artist, are there any other songs you like?"}
{"Context": "My favorite fashion brand is H&M. I lvoe thsi brand  EOS I love clothing from H&M - especially now that they are using materials that are sustainable. EOS wow ehatwhat a coanciincidence you also EOS And with their hassle free returns, that makes shopping much easier.  What is your favorite item that they sell? EOS do you like this brand", "Knowledge": "/ Birthday / Old Navy Birthday Freebie Old Navy Birthday Freebie", "Response": "I do.  I like Old Navy things better.  they even do a freebie on your birthday if you sign up to follow them."}
{"Context": "My favorite book is Where The Wild Things Are. When I was a kid I always dreamed of escaping to world of the book. EOS There are very few books that can stimulate a child's imagination quite like 'Where The Wild Things Are' by Maurice Sendak", "Knowledge": "Maurice Sendak was born on June 10, 1928, in Brooklyn, New York and died on May 8, 2012. He was the youngest of three children, each born five years apart. His Jewish family had immigrated to the United States from Poland before World War I and were to lose many of their relatives to the Holocaust during World War II.", "Response": "Maurice Sendak was born in Brooklyn, NY in 1928."}
{"Context": "My favorite book is Where The Wild Things Are. When I was a kid I always dreamed of escaping to world of the book. EOS There are very few books that can stimulate a child's imagination quite like 'Where The Wild Things Are' by Maurice Sendak EOS Maurice Sendak was born in Brooklyn, NY in 1928. EOS Yes, not too far from where I was born actually here on Long Island. He did some other outstanding books as well like ' Little Bear' but was mainly known for Where the Wild Things are. Have you ever read it?", "Knowledge": "This article is about the 1963 children s book. For the film adaptation, see Where the Wild Things Are (film). For other uses, see Where the Wild Things Are (disambiguation).", "Response": "Where the Wild Things are originally came out in 1963."}
{"Context": "My favorite singer is Michael Jackson. I loved the dancing style of Michael Jackson EOS Michael Jackson was born in 1958 EOS yeah that was his year of birth, you love his music? EOS He sold over 750 million albums in his career and won 13 grammys EOS Yeah he was such a talent in his days with  hit  songs EOS Even when he was 12, he sold over 900,000 albums EOS yeah he was a super rich guy in his youth. EOS His net worth was over 1 billion dollaes EOS wow, really I didn't know that! Is this before he died?", "Knowledge": "Michael Jackson was an American recording artist, actor, producer, dancer, businessman, and philanthropist with an estimated net worth of $600 million. Jackson, known as the king of pop, died of cardiac arrest at the age of 50-years old.", "Response": "When he died his net worth was over 600 million"}
{"Context": "My favorite tv show is This Is Us. I like to unwind with the Pearson family EOS I finally caught up on This is Us Last night! EOS Did you hear that they already have the show's ending all planned out and there will only be six seasons total? EOS I had not heard that. I'm not surprised though. It's starting to get a little boring. EOS It's probably good news that every scene of the show has a purpose of some kind since they have it all planned out already. EOS Yes, I've found them bringing in Uncle Nicky to add an extra layer of depth to it. I really like his character.", "Knowledge": "Mandy [Moore] is such a chameleon. We re always amazed with what our hair and makeup department are able to do with her,  he remarked about the actress, who plays Rebecca at ages 20-something through 60-something.  Michael [Angarano] is an incredible actor, and I thought he gave an amazing performance when he s playing Nicky in his 40s. But at a certain point, he has such a baby face, it just breaks, and hair and makeup can only do so much. For authenticity reasons, Aptaker explained,  We didn t want it to feel like kids playing old characters in a high school play.", "Response": "I was surprised they cast two different actors instead of aging the younger actor, but they said they didn't want it to feel like you were watching teenagers playing old people in a high school play!"}
{"Context": "My favorite singer is christina aguilera. love to dance in spare time EOS I really love the song Genie in a Bottle by Christina Aguilera. Its the song that made me a big  fan of hers EOS You must be a die hard fan if you have been following her since Genie in a Bottle came out. I heard that Disney was going to revive the song, are you excited for that to come out? EOS yes im always excited to see new versions of songs and in this case it being my favorite song makes it even better. EOS Do you make up dances to go with each of the songs? EOS Yes but most of the time I watch a youtube video to learn how to dance a certain song and I emulate it to the best of my abilty. After a few tries I become better at it and dance it regularly. EOS Have you tried Christina's Candyman song? She got a Grammy Award for that one and it has more of a jazz feel than her other songs. EOS I think that one was released in 2006 right,  from her Back To Basics album. Definitely one of my top three favorite songs from her, one of the best to dance to as well.", "Knowledge": "Back To Basics Takes Christina Aguilera Back To Billboard s #1 Title: Christina Aguilera: Back to Basics - Live and Down Under (Video 2008)", "Response": "I believe so, the album also got her a Billboards #1. There is even a video of her Back to Basics tour she did back in 2008 that you might enjoy if you haven't seen it already."}
{"Context": "My favorite item to buy is new car. i need an efficient lovely car EOS hey i am looking to buy a new car EOS After the purchase of a house, buying a car is the second largest purchase most people will make. EOS it is convenient and gives one some freedom EOS Information is your best weapon when planning your purchase. EOS i need a nice bargain for the car", "Knowledge": "The first step to buying a new car is to see if you can pre-qualify for a car loan through a credit union or online bank.", "Response": "If you are going to take a car loan, make sure you can pre-qualify."}
{"Context": "My favorite song is friends. that song was sung by annie marie EOS Only gonna push me away. It sounds like it might me country, is it? EOS yeah.it was such a great song to hear.Did you hear it before? EOS No, I haven't. I was just reading some of the lyrics. You looking insane. It just sounded country. It sounds more modern country though. EOS sounded what kind of? EOS I heard old country before. This sounded more modern. Like 2021 now. EOS no its old too.actually its been released on 2018.", "Knowledge": "Anne Marie was born and raised in East Tilbury, Essex, England. Her birth name is Annie-Marie Rose Nicholson and the birth sign is Aries. She was born to British parents named Wayne Nicholson and Susan J.  Sue  Thompson. Her mom was from Essex, whereas her father was from Ireland. Talking about her nationality, Marie is a British and belongs to the mixed ethnicity. During her teenage days, she attended Palmer s College.", "Response": "Is Anne Marie born in England?"}
{"Context": "My favorite game is Monopoly. My family can never decide whether or not to put money in Free Parking.", "Knowledge": "Home » Las Vegas » Hasbro Announces Las Vegas Monopoly Edition Will No Longer Have Free Parking Hasbro Announces Las Vegas Monopoly Edition Will No Longer Have Free Parking Board game maker Hasbro announced it will remove the “Free Parking” space in all future releases of its Las Vegas version of Monopoly.", "Response": "If you can't decide whether or not to put money in Free Parking, you might want to get the Las Vegas Monopoly Edition! It no longer has free parking."}
{"Context": "I live in Seattle, Washington. I prefer to live where the weather s cold. because I lived in North Dakota as a kid and loved it! EOS Good evening! Do you like cold weather? EOS Seattle is #8 on the Best Foodie Cities list. EOS Oh, I know! I live here!", "Knowledge": "", "Response": "Sorry, I'm concentrating on the instructions for this task...LOL!"}
{"Context": "My favorite hobby is cooking. I love to cook and share. EOS I love to try new recipes. If a recipe turns out good, it is so fun to share with friends and family. EOS what kind of recipes do you like example veg or nonveg EOS I like to try all different recipes. But desserts are my favorite. EOS which type of dessert do you prepared EOS Christmas desserts of all sorts. I make a lot of dessert gifts every year around Christmas. EOS interesting.. do you prepared ice cream or cake EOS I love to make cakes. I tried almost every cakes in a dessert recipe book. I also tried different way to make ice cream. EOS what is our hobby other than cooking..? EOS Other than cooking, I also like gardening and hiking. What is your hobby?", "Knowledge": "", "Response": "my hobby is playing baseball.. basicallly am baseball player in my college"}
{"Context": "I live in San Antonio, Texas. Sometimes i go to yoga classes. I'm trying to wake up at 5 AM every morning so I can do yoga.", "Knowledge": "Practicing yoga is said to come with many benefits for both mental and physical health, though not all of these benefits have been backed by science.", "Response": "Yoga has many benefits for both mental and physical health."}
{"Context": "My favorite actor is Jake Gyllenhaal. Jake and I talk ocassionally EOS I really, really like watching movies. Do you have a favorite actor? EOS My favorite actor is Dwayne Johnson a wrestler who transitioned to acting. EOS Oh, you like The Rock! He's pretty good. My favorite actor of all time is Jake Gyllenhaal. Have you ever seen one of his movies? EOS Yes, my favorite is the Lost Airman. EOS Oh, nice! That's an obscure one! My favorite is Donnie Darko. It was the first time I saw him in a movie and I was absolutely mesmerized. I actually met him and he's the nicest guy! EOS I bet! he looks like a humble guy. His acting skills and success must be due to his family's deep ties to the movie industry. EOS Yes, people say that he got success was because his parents were already in the industry. And while that might be true in terms of having some built-in connections, if he wasn't talented then he wouldn't still be a working actor! And he is super, super humble and nice and handsome! And kind. He is SO kind. EOS He is so handsome. I wonder if he is single. I know that hes dated Kirsten DUNST AND REESE WHITHERSPOON BEFORE. EOS To be honest, I really think he is gay. When I talked to him (and yes, we have talked a few times!), he didn't want to talk about his dating life. He just gave off a bit of a vibe that made me think he is gay. Which I think is sad that he has to be in the closet because he is an actor. I've also heard rumors that The Rock is gay as well!", "Knowledge": "During the conversation, Gyllenhaal shared with the audience why he didn t necessarily sweat playing a queer role:", "Response": "I saw an article where he mentioned that he did not sweat playing a queer or gay role in Brokeback Mountain."}
{"Context": "My favorite artist is taylor swift. the best album song EOS Nadal has an impressive net worth of $200 million via Celebrity Net Worth. The publication reported that “in any given year, he earns around $40 EOS What do you believe is Taylor Swift's best song? EOS look what you made me do EOS I agree! That song has a lot of references and is very catchy. Taylor is very talented. EOS yes yes ok ok nice speking EOS Are you excited for her next album? EOS yes yes i am excited for next album song and i am waiting", "Knowledge": "“Miss Americana” isn’t exactly any of those things, which makes it both more interesting and more confusing. Notionally, it follows Swift over the past two years as she comes into her own politically, and begins to pivot away from the vindictiveness of the “Reputation” era back toward the more familiar modes she deployed on “Lover.” But it also flashes back to earlier traumas — it’s not sure whether it’s trying to be an origin story, or a ride-along. Or maybe it’s an origin story of Taylor 2.0.", "Response": "Yes! I hope it comes out on schedule. Taylor has certainly taken on a stronger persona in her \"Reputation\" and \"Lover\" Era."}
{"Context": "My favorite singer is Halsey. She is really cool and pretty diverse. EOS I like all of Halsey's songs. EOS How are you today? EOS Good. I found a song with Halsey and Machine Gun Kelly. EOS I read some information about how Halsey described the song that you like with Machine Gun Kelly being pathetic. You don't think so do you? EOS That is interesting. I don't think so. She sang great.", "Knowledge": "Halsey has described Machine Gun Kelly as “pathetic” after her apparent relationship with the rapper was dissed by Eminem and G-Eazy. Now, she’s responded for the first time, describing Kelly as “pathetic”.", "Response": "I think she felt this way after being dissed by Eminem and G-Eazy. I think she used the term pathetic."}
{"Context": "My favorite hobby is to play volleyball.. I have been playing volleyball since I was little. EOS I have been playing volleyball since I was 8 years old. EOS That's amazing, volleyball is a tough sport. Have you won any awards? EOS I have never been in a competitions because I only play volleyball as a hobby. EOS Ohh okay, Do you still play with the same structure and rules as competitive volleyball? EOS Yes, I do play by the rules but sometimes I don't.", "Knowledge": "Brazil, United States, and the former Soviet Union, are the only teams to win multiple gold medals at the men's tournament since its introduction. The remaining five editions of the Men's Olympic Volleyball Tournament were won each by a different country including Japan, Poland, Netherlands, Russia and the defunct Yugoslavia. Gold medals are less evenly distributed in women's volleyball than in men's; the fourteen editions of the Women's Olympic Volleyball Tournament were won by only five different countries: Brazil, Cuba, China, Japan and the former Soviet Union.", "Response": "I like watching Volleyball during the Olympics. I think it crazy only 5 counties for women's have won gold and only 3 for men"}
{"Context": "My favorite hobby is to play volleyball.. I have been playing volleyball since I was little. EOS I have been playing volleyball since I was 8 years old. EOS That's amazing, volleyball is a tough sport. Have you won any awards? EOS I have never been in a competitions because I only play volleyball as a hobby. EOS Ohh okay, Do you still play with the same structure and rules as competitive volleyball? EOS Yes, I do play by the rules but sometimes I don't. EOS I like watching Volleyball during the Olympics. I think it crazy only 5 counties for women's have won gold and only 3 for men EOS It is more fun to play volleyball than just watching it.", "Knowledge": "Touching the net during the rally which is termed as net foul", "Response": "I bet. Would be easy for me if there was no net. I would get a bunch of net fouls"}
{"Context": "My favorite item to buy is A/C. I Like to buy latest model A/C EOS I am thinking to buy Butterfly brand A/C EOS that great. Although the depot home has a wifi-enabled a/c EOS I think their product is very good", "Knowledge": "If you’re willing to spend a little bit more on a small-space window air conditioner, the Friedrich Chill CP06G10B is a good pick. This 6,000 BTU air conditioner has more features and can cool off rooms up to 250 square feet.", "Response": "i think the Friedrich chill cp06 brand is more versatile and durable than other brands."}
{"Context": "My favorite item to buy is Lenovo Laptop. I want to buy Lenovo brand Laptop EOS I think Lenovo one of the best brand in the world EOS sure, their product is more flexible, robust and secure. their part are not that cost. EOS I want to buy latest model Lenovo brand Laptop EOS then you can gofor the lenovo yoga. the model s940 is more easy and less expensive. EOS Ok as per your choice I will buy Lenovo Yoga,Model-S940", "Knowledge": "", "Response": "exactly, the specifications are second to non as they gave a great modifications."}
{"Context": "my favorite game is entertaining.  EOS Much interest in recreational sports, what is your favorite recreational sport EOS My favorite is football. EOS How long have you been playing football EOS I have play football 3 years.", "Knowledge": "It is the classic Monopoly board on the outside, with the familiar railroads like the B.& O. and the development of property. But in the center, instead of dice and Chance and Community Chest cards, an infrared tower with a speaker issues instructions, keeps track of money and makes sure that players adhere to the rules. The all-knowing tower even watches over advancing the proper number of spaces.", "Response": "What strategies do you use to win football"}
{"Context": "My favorite hobby is tavel. I love to travel Asian country  EOS i like to  travel in Asian country  what about you  ?", "Knowledge": "", "Response": "okay"}
{"Context": "I love to play league of legends. I like to play with league legends EOS I like very much to play with league legend EOS Tell me more about it. This is the battle arena game, right? EOS Yes this is battle arena game EOS Have you played the 3D version? EOS Yes i have played 3D version", "Knowledge": "Yes, it s a free game. As you play you gain in game currency to unlock new characters to play. They make their money via micro transactions, but you cannot  buy power  with real money, meaning that a player that spends money on the game will have no advantage over a non-paying player. The things you buy are purely cosmetic  skins  for your caracters (much like DAZ character textures!) Or you can buy new champions faster.", "Response": "How many characters do you have unlocked?"}
{"Context": "My favorite item to buy is chair. i have to  buy a chair for computer table EOS what item recently  you bought ? EOS I bought a new gaming chair with extensive adjustability EOS may i kno9w the price  for  idea EOS It was Less than $150 EOS oh i think  it  is  okay  for  me. EOS it is also rated A plus for ergonomics  and top comfiest chair EOS what is the brand may  i know  ?", "Knowledge": "If you spend the majority of your day parked in your office chair, you owe it to your body to choose a chair that gets an A+ for ergonomics. Our top pick for the comfiest office chair is the Steelcase Leap.", "Response": "The brand is called steelcase leap"}
{"Context": "My favorite tv show is Suits. I am a big fan of Harvey Specter and his competitiveness EOS I also like and meghan markie is like it EOS Yeah I was super bummed when she married Prince Harry and left the show! Her and Mike were great together. EOS The mike and mary to gether and any excavation olsen EOS Not sure what you mean EOS The harry prince surprised with logo her to the decroted with photos EOS Yeah I still don't know what you mean. Decroted is not a word. EOS Sorry thats speeling mis tak and suits is beauti ful EOS I was really sad whenever it ended.", "Knowledge": "S8 EP 15: Stalking Horse S8 EP15: Stalking Horse S8 EP 14: Peas in a Pod", "Response": "I was really happy and its goods"}
{"Context": "My favorite game is mini golf. I like the challenge and fun of the windmill EOS Mini golf is a blast. Especially the windmill. Where in the world have you played mini golf? EOS Luckily up the road from my house is an 18 hole one that has a waterfall and the infamous windmill EOS I hear New Zealand has a famous mini golf course. Have you ever been? EOS No I have only traveled outside the country once to Dominican Republic. I have seen pics of New Zealand, very breathtaking. EOS There's a windmill mini golf in Hopewell PA that has ice cream, snacks and more. EOS Yum that sounds great. This place up by my place has everything, batting cages, bumber boats, bumper cars and indoor arcade, and also pizzas and soda! EOS That sounds awesome! Where do you live? EOS St Louis area. We got a little of everything here. I can't really think of any other good mini golf but we have tons of regular golf courses", "Knowledge": "Getaway Golf is an engaging, interactive and educational spin on miniature golf. This one-of-a-kind entertainment venue (appealing to all ages and ADA compliant) is themed around travel and will showcase the top destinations around the United States and the rest of the globe. From feeling like you re swimming in the Great Barrier Reef to walking through the Grand Canyon, this is sure to be one experience you ll never forget.", "Response": "Springfield has Getaway Golf. It's themed around travel and top destinations around the U.S. You should try it."}
{"Context": "My favorite book is My Dark Vanessa. This book is very interesting to study EOS my favorite book is very interesting to study EOS When I read this book,  I became very energetic EOS yes i have read very energetic EOS This book will give more curiosity.", "Knowledge": "February 14, 2019  Former FBI Deputy Director Andrew McCabe said Thursday that top Justice Dept. officials discussed invoking the 25th Amendment. But his new book is about far more than that. The Source Of Self-Regard  Speaks To Today s Social And Political Moment February 14, 2019  Though the essays, speeches, and meditations in Toni Morrison s new nonfiction collection were written over the course of four decades, virtually every entry feels strikingly relevant now.", "Response": "i love book and read i like it"}
{"Context": "My favorite game is assassin creed. i  just love this game graphics ", "Knowledge": "", "Response": "what's your favorite game to play?"}
{"Context": "My favorite song is No One. I listen to No One at least every 3 days.", "Knowledge": "Billboard News", "Response": "Billboard News has songs."}
{"Context": "I live in Baltimore, Maryland. I enjoy being outside. I love hiking through the woods. EOS Are there many woods in Baltimore to hike through? EOS There are a few outside of Baltimore but traveling to other states nearby for a weekend camping trip is also a thing i do. EOS The western Virginia border is nice. Have you hiked there? EOS Yeah i've been there a few times and ive also hiked in kentucky as well", "Knowledge": "The Department of Natural Resources said the 2.7 square-mile (711-hectare) parcel of land in northern Greenville County was bought for $4 million ... Find your next favorite trail 60,000+ trails. 10 million explorers. Endless memories.", "Response": "What is your favorite all time location to hike?"}
{"Context": "I live in San Antonio, Texas. I simply walk around when i have nothing to do. I like thinking to myself and have a rich inner life. EOS I like taking long walks in the woods, thinking to myself about whatever topics my mind wanders into. EOS Well, i think it will be a great deed in thinking about oneself in such case EOS I wouldn't ascribe any moral value to it. It's just what I like to do. I like walking around the Riverwalk area in San Antonio in particular.", "Knowledge": "", "Response": "that particular location is quite interesting and have some great weather. Texas has some nice place to visits."}
{"Context": "I like lightning mcqueen.  I find lightning mcqueen entertaining EOS speed. I am speed. EOS speed. I am speed. EOS mcqueen will be at the racing academy! dates are up EOS do you like the movie or speed? EOS both, the movie and speed EOS when you run do you feel like lightning? EOS yes, like a flash EOS wow and the shadow is yellow like flash? EOS you sure are right! EOS What vehicle do you have?", "Knowledge": "", "Response": "not a cool car like mcqueen"}
{"Context": "My favorite clothing type is cocktail clothing. I feel comfortable, beautiful and fashionable EOS With these clothes I am ready for a party and at the same time for work EOS Would you like to search for parties this evening? EOS if I want to go to a party at night and look great EOS There is an event at Milk River Lounge, would you like to know more? EOS Yes, how should I look to go to that place EOS The dress code for Milk River Lounge is casual. However, customers have dressed up for special occasions, would you like to set up a reservation/booth? EOS Not for tonight, maybe later, even if I want to go I have other commitments, thank you, I know how to dress to go to that place EOS Would you to search for other happenings tonight? Treleaven Wintery and Three Centuries of Finger Lakes Wines boast cocktail events tonight. EOS I have a work event tonight and I'm also going to dress like a cocktail.", "Knowledge": "Key Differences Between Lyft and Uber", "Response": "Would you like to schedule an Uber or Lyft to get to the event tonight?"}
{"Context": "My favorite artist is Billy Joel. More popular in the 70s and 80s than now, I still like his music. EOS Sing us a song you're the piano man..... EOS It’s nine o clock on a Saturday the regular crowd shuffles in there’s an old man sitting next to me making love to his tonic and gin EOS lol yeah some good lyrics to that song. He had some trouble with a record company his manager for him into and he went awol for a while that's when he wrote that when he was playing in a bar in california.", "Knowledge": "2 Music career", "Response": "Didn’t know that! I don’t know much of his music career just some songs. Is piano man your favorite?"}
{"Context": "My favorite item to buy is Cologne. Green Irish Tweed is my all-time favorite scent. EOS There are many great Cologne fragrances to choose from these days. What type of notes do you enjoy? EOS I like a combination of woodsy and musky notes. I'm not particularly into the soapy notes. EOS Woodsy Colognes are very warm, dry and inviting. Cedar colognes also have a woody smell full of richness and warmth. How many do you own? EOS I have six or seven at the moment. I'd like to get some Penhaligon's sometime soon, especially if there's a sale.", "Knowledge": "Penhaligon s Fragrances (1) Penhaligon s Marylebone Wood William Penhaligon, perfumer and court barber to Queen Victoria, established his fragrance company in 1870 in what was originally a barbershop. Penhaligon s first fragrance, Hammam Bouquet, was launched in 1872, named after the Turkish bath next door. Blenheim Bouquet, introduced in 1902, became the company s most popular fragrance. The Duke of Marlborough requested that Penhaligon design the fragrance, which was different from the popular floral scents of the day. Its original shop was destroyed in the early part of World War II. In 1956, Penhaligon received a royal warrant to produce toiletries from the Duke of Edinburgh. A second warrant was granted by the Princess of Wales in 1988. With help from director Franco Zeffirelli, the company was reopened in Covent Garden in 1975 by author Sheila Pickles. Using the original formulas, Pickles reintroduced Penhaligon s floral scents, updated for the modern woman. Penhaligon s has 44 fragrances in its base. The latest, Tralala for men and women, and Bayolea for men, were launched in 2014. Although the company changed hands and is owned by the American company, Fox Paine, it maintains the fine British traditions established by William Penhaligon. Working with master perfumers, the company puts no limitation on its creativity in terms of cost, ensuring a truly innovative product. The crystal flacons are still made in Great Britain, and the fragrances are made in its factory in Hampshire in southern England.", "Response": "Penhaligon fragrances are great and award winning!"}
{"Context": "My favorite author is Agatha Christie. I absolutely adore how she sets up mysteries/ EOS What is your favorite Agatha Christie book? EOS Murder on the Orient Express. I don't know if any of her other works come close. What do reviews say though? Do critics agree? EOS I forgot she wrote that. It is highly rated and loved by her readers. EOS Yes it is, I am curious how her other works are rated by comparison. What specific scores have reviewers given to works like the ABC murders?", "Knowledge": "1. The Murder of Roger Ackroyd (1926)", "Response": "The Murder of Roger Ackroyd is one of the highest rated. Do you like that one?"}
{"Context": "I live in Tampa, Florida. I run six miles a day. I enjoy running several miles a day for exercise. EOS I love to run several miles a day.", "Knowledge": "Posted by Run 6 Miles on Oct 04, 2017 For today, we re gonna divert from the normal interview sessions and close out our roundup of Run 6 Miles Ambassadors by giving Evelyn a free reign to introduce herself. She is a very popular face amongst the local running community, well-known for her blog http://www.missyblurkit.com and one of the few Malaysians who have covered 200km on foot!! The floor is all yours, Evelyn!! --------------------------------- My name is Evelyn also known as Missyblurkit. Get to know me better and you will learn that blurness is contagious like a yawn. I ran when I was in high school. Stopped for a good...", "Response": "How does it make you feel? Does running a lot take a toll on your knees?"}
{"Context": "I live in Oklahoma City, Oklahoma. I love playing tennis. Tennis is such a great sport EOS That's nice I like too tennis. But my favorite one is chess. EOS Chess is to much of intellectual game for me, i enjoy being more active physically then mentally. EOS That's why I perfer chess. I like critical thinking. vishwanathan anand is my favorite chess player. EOS Gotcha, yeah im the total opposite. My favorite tennis player is Andy Murray. EOS That's common everyone has different interest. Do you one thing vishwanathan anand is youngest international master. EOS That is a great accomplishment he must be a very smart individual.", "Knowledge": "", "Response": "You may share something interest things about tennis!"}
{"Context": "My favorite song is Green Day - Boulevard Of Broken Dreams. I wish Green Day Rock band compose the songs like Boulevard Of Broken Dreams. EOS \"Boulevard of Broken Dreams\"  really stands out from the rest of the songs on the album it appears on.  It is kind of dark by comparison, wouldn't you say?  What is it that draws you to this Green Day song in particular? EOS It is obviously the composition and I like lyrics as well. What is your favorite song? EOS I really enjoy \"When I Come Around,\" also by Green Day.  I like the way that their music stands in opposition to the contemporary popular music.  Don't you find that their music had something of a rebellious streak? EOS Yes, I agree with you.", "Knowledge": "", "Response": "I am happy to hear that you agree.  Are you a fan of all rock music, or only specifically Green Day?  Are there any other bands that you are especially fond of?  I would like to discuss these bands with you."}
{"Context": "My favorite hobby is Double Dutch . I am frequently going to competitions EOS There are several \"How to's\" on Double Dutch. EOS Yeah there are a lot of videos you can watch to learn how to do it. EOS There are classes and leagues for this lost art also. EOS yeah, a lot of people don't know about those. I'm actually part of a league and go to competitions regularly. EOS Have you won a competition of Double Dutch? EOS I've won two local championships throughout my career!", "Knowledge": "Cleveland will welcome the U.S. National Jump Rope Championships on June 24-27, 2020 to Cleveland Public Auditorium in Downtown Cleveland. During it s 25th anniversary, USA Jump Rope will invite individual competitors and teams from across the nation, including the local Cleveland Heartbeats to as far as Alaska, to compete at the Championship level.", "Response": "Congratulations. Cleveland has a U.S. National Jump Rope Championship."}
{"Context": "My favorite hobby is collecting figures. I've been collecting figures for ten years. EOS Mattle has recently won the toy of the year award for the jurassic world dinosaur action figure line. EOS Mattle is pretty cool. Are you familiar with Transformers figures? EOS Yes I am aware of the transformer action figures. Transformers also do a collection blind mystery bag. EOS Oh really? That's kind of neat. Do you know if other series of toys have blind bags? EOS Hasbro do these really cool Big galaxy of star wars ones there is about 8 to collect in each series. EOS I'll have to look that up. Do you know of any other Star Wars toys I can buy?", "Knowledge": "Star Wars Electronic Yoda Mask & Ultimate Co-Pilot", "Response": "They have this pretty cool electronic Yoda mask & ultimate Co-pilot toy."}
{"Context": "My favorite item recently bought is Vitamix blender. It makes the best smoothies.  EOS I just bought a Vitamix blender. It's so powerful and makes the smoothest smoothies.", "Knowledge": "We keep clean-up easy with containers that are self-cleaning, dishwasher-safe, or both.", "Response": "i love vitamixes. they are very easy to clean"}
{"Context": "My favorite item recently bought is a tabletop humidifier. because it keeps my skin from drying out at home EOS I recently bought a tiny humidifier, and it's been great! It sprays mist in the air and humidifies the surroundings, so your skin doesn't crack and dry out.", "Knowledge": "Humidifiers can ease problems caused by dry air. Dry sinuses, bloody noses and cracked lips — humidifiers can help soothe these familiar problems caused by dry indoor air. Humidifiers can also help ease symptoms of a cold or another respiratory condition.", "Response": "Humidifiers typically help with general health by targeting dry air."}
{"Context": "My favorite song is It's Raining Men. I just like to dance to it. EOS It's raining men is a very popular song. Women always get excited at parties... EOS Yeah, me and my girlfriends always get super excited and laugh when the song comes on.", "Knowledge": "Celery Juice Cocktails, The Trendiest Way To Kick Off The New Year These Delicious Winter Cocktails Will Warm Your Spirits This Holiday Season All The Alcoholic Coffee Cocktails You Need To Get Through The Holidays", "Response": "It is always a riot...Especially when drinks are involved."}
{"Context": "My favorite sports team is a cricket team.. I love watching cricket matches. EOS Do you like cricket? EOS Not really! But I find it interesting that Cricket has been played as an adult sport since 1611...and it was only a \"boys sport\" back then!! EOS Not only a boys sport but also for girls. EOS Well back then, it started as a boys sport because women didn't really have much rights! EOS Yes, You are correct. EOS The England Cricket team was formed in 1899, have you watched any of their games? EOS Yes, I watched their games.  I think lastly they played with India. EOS I think India also has the biggest Cricket stadium that can handle 68000 people! EOS Yeah, I think it is Ahmadabad Narendra Modi Stadium.", "Knowledge": "Indian Prime Minister Narendra Modi s dream project, a 1.10 lakh capacity new Motera Stadium in Ahmedabad, is all set to be inaugurated by US President Donald Trump on his visit to India on February 24 and 25.", "Response": "Isn't it the one Trump and Modi inagurated!"}
{"Context": "My favorite book is Holes. I still re-read it as an adult. EOS Louis Sachar is a very good writer and Holes is probably one of his best books! EOS Oh yeah, for sure. I'm actually not aware of any other books by Louis Sachar other than Holes. EOS Yes, he has many! Fuzzy Mud is another! EOS Fuzzy Mud? When was that book written? EOS It was published in 2015 EOS So it's pretty new. A lot newer than Holes anyway. I'll definitely have to look it up!", "Knowledge": "", "Response": "You should! I think only Holes got made into a movie and that's what most people know!"}
{"Context": "My favorite clothing type is yoga pants. I wish they'd let me wear them at work. EOS I just bought the cutest yoga pants! I really wish I could wear them at work though. EOS Lululemon Wunder Under High-Rise Tights. EOS Is that a specific brand of tights or yoga pants? EOS Yoga pants stretch well and snug to our body in a way that makes them very comfortable to wear all day and night long. EOS Yep. The snug fit is what I love most about them. They're especially good for outdoor activities. EOS This makes girls of all body shapes feel better about their shapes and boost their self confidence . EOS It definitely boosts my self confidence!", "Knowledge": "Home Good News, Inspiring, Positive Stories Good News, Inspiring, Positive Stories", "Response": "In short, the difference between leggings and yoga pants is that yoga pants are meant for athletics while leggings are not specifically designed for this purpose and may be too thin to wear during fitness activities."}
{"Context": "My favorite item recently bought is a smart tv. It is small but I love it. EOS I am surprised how versatile a TV can be.", "Knowledge": "TV brands incorporate one or more platforms through which they offer apps. (This integrated platform is what makes a TV smart.) Here are a few of the brand/platform you re likely to find:", "Response": "They are really cool. It's pretty cool that you can access apps"}
{"Context": "My favorite store is american eagle. Best clothes to wear EOS i love denim shirts in american eagle EOS I love also black Denim chore coat EOS what else is good in american eagle EOS May be American eagle  Could eBay stock actually double . EOS I love to try it out,", "Knowledge": "What price target have analysts set for AEO?", "Response": "Yeah  you can set target  price set for AEo when you  wil but  those  product"}
{"Context": "My favorite singer is jess greenberg. Who is your favorite singer? EOS Who is your favorite singer?", "Knowledge": "Shakira performing on stage in Toronto, Canada in 2018 for her El Dorado World Tour.", "Response": "I love Shakira. I actually saw her perform in Toronto in 2018."}
{"Context": "My favorite music band is The Beetles. The Beetles are the best band in the word. EOS I think that the beetles is better than Maroon 5 EOS Yes they are much better. Did you get there 50th Anniversary album? EOS Yes. I love it. It was awesome.", "Knowledge": "10 of The Best Beatles Love Songs", "Response": "The beetles have made some of the best love songs out there."}
{"Context": "My favorite tv show is parks and rec. andy is the best EOS Parks and Recreation is an great show! What do you like the most about Andy? What is your favorite episode? EOS Just how free Andy is, and how just by being himself he gets a life that he wants EOS Chris Pratt does an amazing job playing the role. Can you believe Andy was only meant to be a temporary character in the show? EOS I know its crazy, he really turned that opportunity into an entire successful career EOS He really did! What do you think is his best role yet? Any other shows you like? EOS Acting wise definitely Andy, he crushed that. Money wise being star lord in Guardians, he really fit that role well. Basically super andy but smarter", "Knowledge": "Every Time Andy Sings on Parks & Recreation Andy Dwyer, the dopiest, most lovable staff member of the Pawnee Parks Department, devoted husband to April Ludgate-Dwyer, and assistant to Deputy Director Leslie Knope, has had countless shining moments as a vocalist and guitarist. Vulture tallied up every time Andy blessed viewers with his golden pipes and excellent strumming skills in all seven seasons of Parks & Recreation, which leads one to wonder: Why wasn’t “5,000 Candles in the Wind” nominated for an Outstanding Original Music Emmy?", "Response": "What is your most favorite episode? He really does a great job singing too!"}
{"Context": "My favorite item to buy is Oculus Quest VR Headset. Amazing virtual reality headset EOS These new virtual reality experiences are getting very good EOS How long have you been using the Oculus Quest VR Headset? EOS Its been about two months now. Its such an improvement over their last headsets EOS Can you tell me how much the Oculus Quest VR Headset costs? EOS It cost me a little over $400 on amazon. Totally worth it if you are interested EOS Can Oculus Quest VR Headset be used on all mobiles EOS No, It has a built in screen and all the hardware... pls focus on this hit and respond quickly EOS How Many Years Oculus Quest VR Headset Guaranteed EOS I think its like a year of coverage", "Knowledge": "Oculus Quest is our first all-in-one gaming system built for virtual reality. Now you can play almost anywhere with just a VR headset and controllers.", "Response": "Can you tell if the next version of the Oculus Quest VR Headset will come"}
{"Context": "My favorite tv show is New Amsterdam. EOS New Amsterdam is such a great medical show EOS So I heard,a show in America's oldest hospital to provide exceptional care is quite interesting. EOS It has just the right mix of medical stuff, coworker drama and humor EOS it is all about keeping interest and helps when there is a crisis and a secret involving Bloom EOS The series is based on a book EOS books are fun especially medical shows like scrubs that has medical interns and seeing it from their view EOS Sometimes the scenes get pretty far fetched though EOS that is true,but also new amsterdam does not portray medicine correctly.It portrays doctors as superhuman with a twist. EOS Sometimes it does, but it also shows some raw emotion which is nice EOS that is true plus characters like reynolds dealing with stuff from their past. EOS It really helps you get to know the characters, and understand them better", "Knowledge": "Max becomes overly invested in a patient s cancer treatment as his own comes to a crossroads; Reynolds celebrates his birthday with some help from the hospital; and Kapoor grapples with a case that hits close to home.", "Response": "especially when it comes to max and being so invested in a patients cancer treatment."}
{"Context": "My favorite game is Tennis.", "Knowledge": "Cristian Garín, the 23-year-old Chilean 26th Seed, had been confirmed in the main draw of the Miami Masters 1,000, scheduled to take place between March 23rd and April 5th.", "Response": "Who is your favorite tennis player? Cristian Garin is a good newcomer."}
{"Context": "My favorite game is Basketball. EOS I like very much Basketball", "Knowledge": "Latest Around The NBA One last lob: Wade alley-oops to LeBron", "Response": "which team do you like most??"}
{"Context": "I live in Omaha, Nebraska. I visit animal shelters fairly often. I try to volunteer and take care of the animals. EOS It turns out adopting animals is cheaper than buying them from a pet store! EOS It is. Plus, a lot of pet stores farm their animals in horrible conditions. Adopting is so much better. EOS Yes, getting those animals out of those conditions is crucial. Things like breeding mills are very inhumane. EOS I wish there was a way to shut them down, but they're obviously profitable so I'm guessing companies lobby against it. EOS There should be more institutions like the Nebraska Humane Society that help protect those poor animals. EOS Definitely. I actually write to them all the time anytime I become aware of animals in horrible situations.", "Knowledge": "Petfinder’s mission has always been to find forever homes for every adoptable pet. Many of you share this same goal and are looking for ways to support the pet adoption community. We believe that one of the great ways to promote animal welfare, whether you are a passionate individual or …", "Response": "Volunteering is great! It really helps support the pet adoption community."}
{"Context": "My favorite music band is Black Sabbath. Ozzy Osborn is one of the best to ever do it. EOS Hey there, what is your favorite song from Black Sabbath? EOS Probably Paranoid. I used to listen to that song on repeat all the time. EOS I feel like they really invented the heavy metal genere back in the 70s. Are you a fan of any of the other bands of that era? EOS Not really honestly. Black Sabbath is as far as I go into the genre. EOS I will have to check them out on youtube, any albums you suggest? EOS The album \"paranoid\" is their most well known I think. There's great songs on there. EOS Thanks for the reccomendation for Paranoid I will check it out! EOS Ozzy Osbourn is a great singer. When he was young he had a great voice.", "Knowledge": "Ozzy  and  John Osbourne  redirect here. For similar names, see Ozzie, John Osborn (disambiguation), and John Osborne (disambiguation). John Michael  Ozzy  Osbourne (born 3 December 1948),[2] also known as The Prince of Darkness,[3] is an English vocalist, songwriter, actor and reality television star who rose to prominence during the 1970s as the lead vocalist of the heavy metal band Black Sabbath. He was fired from the band in 1979 due to alcohol and drug problems, but went on to have a successful solo career, releasing eleven studio albums, the first seven of which were all awarded multi-platinum certifications in the United States. Osbourne has since reunited with Black Sabbath on several occasions. He rejoined the band in 1997 and recorded the group’s final studio album 13 (2013) before they embarked on a farewell tour which culminated in a final performance in their home city Birmingham, England in February 2017. His longevity and success have earned him the informal title of  Godfather of Heavy Metal .[4]", "Response": "I like what I have heard so far, I just recently learned that real name is John."}
{"Context": "My favorite singer is Lingua Ignota. Her album Caligula is so powerful, and especially cathartic for me. EOS For as much as I love that album, I never know ow to describe it's genre. What genre do you think it fits into? EOS Seems to be a Latin singer. EOS Oh no, that's not right at all haha. She's a metal singer, Lingua Ignota is just a stage name. I've heard it called gothic metal, industrial metal, and industrial rock, but I really don't know what those mean.", "Knowledge": "Our desire to create Keipsule came from wanting to offer individual style in today’s fashion. We want to bring a new dimension to the world of Gothic and Punk fashion by offering top-of-the-range designs…", "Response": "If you enjoy goth music, then perhaps the magazine Gothic and Amazing Lifestyle. There are many beautiful gothic clothes availiable"}
{"Context": "My favorite item to buy is PS5. I like to play video games on my PS5 EOS Do you like to play video games? I play on my new PS5? EOS yes i like video games and hard drivers game EOS Which system do you use to play your games?", "Knowledge": "Cell phone cases and clips", "Response": "cell phone i used games"}
{"Context": "My favorite movie is La Bamba. I saw La Bamba in the 2nd grade and it inspired me to become a touring musician EOS La Bamba was a movie I saw as a kid. I thought Lou Diamond Phillips was so cool. What kind of music do you play now? EOS I play rock n roll, I even got a flying guitar tattoo inspired by Ritchie Valens. I also loved Buddy Holly. Did you like that type of 50s rock?", "Knowledge": "But when Elvis came in everything changed. Not only did he completely dominate sales, but pop music from then on was completely different. Guitars, screaming, hip shaking music was topping the charts and the old folks were left wondering what the hell just happened.", "Response": "yes, I like buddy holly and elvis Presely. How many people are in your band?"}
{"Context": "My favorite item recently bought is PS5. play FIFA soccer game is fantastic EOS I just bought the new PS5, you have one too? EOS No I haven't yet, it's pretty expensive, but I am excited to try it out because I have so many blu rays. How do you like it so far? EOS It is fantastic, the 3D graphics is so cool, with clear image and well programmed display EOS That's awesome, I would love to get to play some games in 8k resolution. What kinds have you been playing? EOS FIFA  2020, Pro evolution soccer, sometimes i play GT games", "Knowledge": "Since 1997, EA Sports have regularly released football management games, most of which have made use of their FIFA or FA Premier League licenses in their titles. The majority of these games were developed by EA themselves, though some have been developed by third parties such as Krisalis Software and Bright Future GmbH.", "Response": "Oh yes I've heard great things about that. They've been releasing new FIFA games since 1997, which is crazy. How many have you bought before?"}
{"Context": "I live in Albuquerque, New Mexico. I am a fisherman. I am still in search of a massive catfish. EOS I've got my next fishing trip scheduled for next week. I'll be out a whole week! EOS I love to fish. My dad used to take me when I was a kid and I have been going ever since. EOS What is the easiest kind of fish to catch? EOS I personally think a large mouth bass. I used to fish and only catch those for hours and hours. EOS How big do bass grow to be? EOS My personal best bass in 4 lbs., but I actually don't know how big they can get. EOS I see. I'm excited to go out next week. Do you know any really good fishing spots? EOS I am unsure, but try to look for a spot that is shady, like that has trees overhanging. Fish love that. EOS Do they like for things to be in the water too, like roots and stuff?", "Knowledge": "", "Response": "Im unsure, maybe you should talk to fellow anglers in your area. Its different in every location."}
{"Context": "My favorite movie is Thor Ragnarok. Thos is the best movie i have ever seen. EOS Thor ragnarok is the best movie. EOS Yeah it  is  the best 2010s Superhero  movi e EOS yes. Do you love it?", "Knowledge": "MORE THAN A HERO 5 Great Marvel Gift Ideas from Sideshow Collectibles", "Response": "Yeah thor  is MORE THAN A HERO and also 5 great gift  of marvel"}
{"Context": "My favorite director is Christopher Nolan. the movies nolan makes innovate on the film making medium EOS Some of  his  movie  is too bad like Transcendence whicjh  watched  in  London England EOS alot of his films use practical effects which is great and shows how far he is willing to go for a shot in a film. EOS Just few days ago  i checked His Photo Gallery EOS he has alot of movies in different genres that help him stand out. EOS I am  interested about  No score YET startalk EOS the batman films are pretty interesting when it comes to diving deep into how they would work in our real world.", "Knowledge": "Chicago Film Critics 2017 Nominations Announced", "Response": "Have you ever  attend Chicago Film Critics 2017 ?"}
{"Context": "I live in Fort Worth, Texas. I love playing tennis. I haven't been playing very long. EOS How long have you been playing tennis? EOS Only a year, so I'm just a novice. EOS What are you doing to get better? EOS I take lessons when I can. EOS Whose your favorite tennis player? EOS I think maybe Andre Agassi.", "Knowledge": "ROGER FEDERER NEWS", "Response": "Do you like Roger Federer?"}
{"Context": "I live in Mesa, Arizona. My family owned a small restaurant. I worker there since i was little EOS I've worked in my family business.since i was 5 EOS Why do you like to your family business? EOS We had a Mexican restaurant and it was the best, that's where i learn to cook authentic foods EOS What type of foods have in your restaurant? EOS we had all types of Mexican foods EOS What is special in your restaurant? EOS That is was family owned and we spent a lot times together", "Knowledge": "Mario Batali’s La Sirena, for example, boasts two dining rooms that each seat around 100, plus a patio and private dining rooms. It’s a big restaurant. The same goes for Steve Samson’s buzzy Rossoblu, which seats 120, and Jean-Georges Vongerichten’s recently opened 150-seater, both in L.A. Across the country, new developments and hotels with buzzy chefs like Andrew Carmellini attached (he s opening restaurants in Baltimore and Detroit in the coming months) prove the trend isn’t limited to New York and L.A.", "Response": "that's good.  What type of foods are special in your restaurant?"}
{"Context": "I live in Louisville-Jefferson County, Kentucky. I enjoy taking late night walks when it s completely dark. I like to take late night walks and just chill out and enjoy the relative quiet EOS Interesting I live In jefferson county missouri! Why do you like walks in complete dark? EOS Its not the complete dark its just late at night when I can walk alone. Its peaceful EOS Well you can get in better health and destress so two birds with one stone EOS You got it, sometimes I just like to be alone and enjoy the outside. Its therapudic EOS So you have baseball and kentucky derby. Ever been there in Louisville? EOS I have been a few times, and unfortunetly drive through there more then I want , but ya, its cool EOS Very nice. Too busy most of time as is life. Anything else besides going for walks alone you do? EOS Nope, I walk these empty streets on the boulevard of awesome dreams.", "Knowledge": "", "Response": "nice play on words. Sure you do. Make sure you have something to defend yourself. Of course I am from St Louis so might be different"}
{"Context": "My favorite item to buy is Home appliances.. Do you purchase any home appliances? EOS Do you love purchasing items. EOS Yes.  I am very like to purchasing items EOS Recent times which product do you purchase costly? EOS I bought LG washing machine.  Which brand do you like? EOS Whirlpool is my favorite one. EOS That is good brand.  But,  LG is have very good quality EOS Yeah, but both are very good quality.", "Knowledge": "Washing machines have big performance differences in water efficiency, noise, and capacity.", "Response": "Do you have any other brands?"}
{"Context": "My favorite music band is Ninja Sex Party. They're a comedic duo who makes both original and cover music.  EOS My favorite song by NSP is The Sacred Chalice, Pt. 1 from the album Strawberries and Cream.", "Knowledge": "Ninja Sex Party is a musical comedy band comprised of Leigh Daniel Avidan and Brian Wecht, under the stage names of Danny Sexbang and Ninja Brian, respectively. All of the members of the band, including manager Brent Lilley, are also members of Game Grumps.", "Response": "Oh, wow! I have never seen any of their performances before. Do you like Danny or Brian more?"}
{"Context": "My favorite actor is Denzel Washington . I like watching movies with Black actors EOS My favorite actor is Denzel Washington", "Knowledge": "The Book of Eli Eli", "Response": "What did you think of Denzel in The Book of Eli?"}
{"Context": "my favorite song is american pie.  EOS Do you hear american pie song ever? EOS No, I have never heard a song called american pie? Is it good? EOS It was the fantastic song. EOS What year was it made? And who sang it? EOS It's a 19 centuary song EOS Does it have any relation to the movie American Pie? EOS No relation to the movie. EOS ok. Who sings the song american pie? EOS Don mclean is the singer.", "Knowledge": "Don McLean Pleads Guilty to Domestic Violence “American Pie” singer released on bail after being charged with misdemeanor assault American Pie  singer Don McLean was arrested and charged with misdemeanor domestic violence stemming from an incident that occurred early Monday Andrew Benge/Redferns UPDATE: Don McLean has pleaded guilty to domestic violence and will avoid jail time as part of the plea, according to the Associated Press. The singer will be forced to pay a $3,000 fine as part of the agreement should he stay out of legal trouble for a year. “American Pie” singer Don McLean was arrested and charged with misdemeanor domestic violence stemming from an incident that occurred early Monday morning at his home in Camden, Maine. Police responded to a 911 call at the 70-year-old singer’s home shortly before 2 a.m., after which McLean was taken into custody without incident. He was booked at nearby Knox County Jail and released after posting $10,000 bail, the Portland Press Herald reports. No other details from the incident were revealed, although police told WCSH 6 that McLean was charged with the lowest level assault crime. McLean is next scheduled to appear at Know County District Court on February 22nd. A rep for McLean was not immediately available for comment. In 2015, McLean sold his original manuscript for his classic “American Pie” at auction for $1.2 million. “I’m going to be 70 this year,” McLean told Rolling Stone prior to the Christie’s auction. “I have two children and a wife, and none of them seem to have the mercantile instinct. I want to get the best deal that I can for them. It’s time.” The 16-page “American Pie” manuscript was one of many items McLean auctioned off from his career. “I only have an attachment to my wife, children and my guitar,” he said. “In fact, I’m going to rid myself of a lot of stuff. In a year or two, I’m going to have a big Christie’s auction with guitars, clothes, boots, saddles, silver and watches. I collect a lot of stuff. It’s time to let other people have it.”", "Response": "Did he get in trouble a couple years back? I think I heard about that..."}
{"Context": "My favorite singer is miley cyrus. Miley has so many different sounds it's amazing. EOS I Miley Cyrus's raspy rock and roll voice. EOS I liked Miley Cyrus when she was Hannah Montana. EOS I watched it sometimes with my daughter. Children on Disney always seemed too grown for me. EOS She was a great singer back then, and now she is ok. EOS Well I disagree. I also loves that she loves pets. EOS There was a cover that she did of the song Jolene that I liked very much a few years ago. EOS Yes. I loved that song too. I loved her song 'unholy\" also. EOS I  have never heard that one. I am honestly not a huge fan of the music. EOS I didn't think I would be either. My favorite genre is rap", "Knowledge": "You are here: Home / Exclusive Asian / Miley Cyrus When the Disney Channel Original Series Hannah Montana burst onto the scene in early 2006, tweens around the world fell in love with Miley Stewart, the typical teenage girl with a secret life as international pop star Hannah Montana. What series star Miley Cyrus never imagined was that, in one whirlwind year, her real life would imitate art as she shot to superstardom as both an actress and a multi-platinum-selling pop star. Born November 23, 1992, in Nashville, Tennessee, Miley grew up watching her father – country music superstar and actor Billy Ray Cyrus – perform and soon caught the acting bug herself. After gaining experience as an extra in her father’s television projects, Miley first acted opposite him in a recurring role on his television series Doc. With that role under her belt, the young actress went on to appear in the Tim Burton film Big Fish. When Miley first auditioned for the role of Hannah Montana, she was considered too young for the part, but her thousand-watt smile and bigger-than-life singing voice had caught Disney Channel’s attention. “At first they thought I was too small, and I was just a little string bean at the time,” shares Miley, “but I’d always wanted to be able to sing and act, so I knew I couldn’t give up.” A couple of years later Miley won the part she had worked so hard for, and her ascent to superstardom started with a bang as Hannah Montana’s first season raked in some of the highest ratings ever for a Disney Channel Original Series. Miley Cyrus Simulates Lesbian Kiss on Stage Eric Charbonneau/Le Studio/Wireimage.com Miley has pulled a Britney. During a performance on Britain&apos;s Got Talent Thursday, the 17-year-old mimicked Spears and Madonna&apos;s famous on-stage smooch by pretending to kiss a female dancer. She didn&apos;t actually touch the dancer&apos;s lips, according to Britain&apos;s Daily Mail, she just thrust her lips towards her.", "Response": "My favorite genre is indie rock. However I will admit Miley is very talented."}
{"Context": "I live in Seattle, Washington. I work out every other day. I am really muscular EOS I am from Seattle, Washington, how about you? EOS No, I am not from Seattle. Do you belong to a gym or just work out at home? EOS I work out at home. People are jealous of my good looks at the gym EOS Maybe you could try John Steppers Working Out Loud to help you with your work out relationships and to help you build trust in others? Especially if you were to engage with other people while doing it, maybe you can learn to appreciate each other. EOS Nope, people always give me dirty glares and that I make them look bad EOS Since you have tried it already, maybe it isn't for you. Some people find working out in a group a motivation and makes them feel better. Some may just feel out of shape or something. In your case, maybe working out alone is the best. What kind of work outs do you do? EOS Sometimes I lift weights, but most of the time I just look at the mirror", "Knowledge": "Karnam Malleswari is a retired weightlifter who won several medals for India in international games. She is also the first and only Indian woman weightlifter to win an Olympic medal, and also the first Indian women to won an Olympics medal in any event. She earned this recognition in year 2000 Sydney Olympics and won a bronze medal to team India. She bagged a bronze medal by lifting 110 kg in the “snatch” and 130 kg in the “clean and jerk” for a total of 240 kg. She is also a recipient of Rajiv Gandhi Khel Ratna in 1995 and Padma Shri in 1999. In her international career, she has won 11 gold medals, 3 silver medals and 1 Olympics gold winner. She remained National champion for 9 consecutive years in 52 kg category and 54 kg category 7 times.", "Response": "How do you keep your build if you are just looking at yourself? Karnam Malleswari is a famous weight lifter that had a baby in 2001. She married another weight lifter. Even though she is retired now, I am sure she did a lot of work to keep her body built."}
{"Context": "My favorite athlete is Eden Hazard. I love watching football. EOS I love watching Hazard play football.", "Knowledge": "Eden Hazard Eden Michael Hazard (; born 7 January 1991) is a Belgian professional footballer who plays for English club Chelsea and the Belgium national team. He primarily plays as an attacking midfielder and as a wide midfielder. Hazard's creativity, speed, and technical ability are widely acknowledged. He has been described as \"a superb passer\" and has earned critical acclaim for his playing style, which has led to the media, coaches, and players drawing comparisons to Ballon d'Or winners Lionel Messi and Cristiano Ronaldo. Hazard is often ranked by coaches, colleagues, and commentators as one of the best players in the world.", "Response": "What team does Hazard play for?"}
{"Context": "My favorite item to buy is scented candles. Aromatherapy is  real. It can calm you down. EOS Do you buy your candles specifically for aromatheraphy? What are the Benefits? EOS When I clean my house I like afresh clean candle to set it off and then It feels clean. Doesn't smell like chemicals", "Knowledge": "You might think twice before lighting up that pumpkin spice candle.", "Response": "I have a pumpkin spice candle that I've had for years and never used. Where do you get yours?"}
{"Context": "My favorite item recently bought is iphone. I love steve jobs iphone products EOS I understand EOS I bought a new iPhone recently! EOS Iphones have 7 benefits including wireless charging. EOS That is a lot! I love the iPhones they have great features and history EOS Iphones has an app that allows you to add contacts and check voice messages using the EDGE cellular phone services. EOS Awesome, I love the services of Apples iphone thank you EOS Have you considered the iPhone upgrade program? EOS Is that from Steve Jobs? What is the upgrade program?", "Knowledge": "Get a new iPhone every year", "Response": "The upgrade program allows you to get a new Iphone every year."}
{"Context": "I live in Milwaukee, Wisconsin. I commute by bus. I never learned to drive a car. EOS Most people get their license at 16. I did not. EOS When did you get yours? There are many who want to raise the driving age, as accidents are the leading teenage cause of death. EOS I never got one. I still ride the bus EOS How do you like Milwaukee's public transportation system? EOS I've been on worse. I used to live in Memphis and they cut the routes so everywhere took hours. EOS Detroit is ranked as having the worst public transport in the United States. EOS I'll never move there. EOS Have you ever considered relocating? Milwaukee is renowned for its historic architecture and buzzing nightlife scene, so it's easy to see why people move there. EOS I have a great job here. I think I should just learn to drive.", "Knowledge": "Now featuring Online Driver Education Courses, Easy Method Driving School is fully licensed by the State of Wisconsin Department of Transportation to provide teen and adult driver education. With our longstanding reputation of being a quality driving school, in conjunction with numerous convenient classroom locations throughout the Milwaukee, Waukesha, Mequon and surrounding areas, Easy Method Driving School is your one-stop driving school for teen or adult driver training.", "Response": "Easy Method is an academy for new drivers in Milwaukee. Maybe you can check out one of their courses!"}
{"Context": "My favorite sports team is Liverpool. I love to re-watch legendary matches.  EOS I love to sit and watch again the Liverpool matches of the past. EOS Yes, Liverpool, home of the Beatles EOS Yeah they are really a good team and full of history. EOS Steven Gerrard is going to play for Liverpool FC Legends next month’s in a charity match EOS Yeah I love to see him play again, he was such an engine in the mid- field position. EOS Yes, he is Liverpool born and bred, EOS yeah he is our legend and truly a Liverpool fun, what is your favorite player. EOS Honestly, I am American and into American football. EOS I have loved to watch American football, how are the rules of American football?", "Knowledge": "Although there are only 11 players from each side on the field at any one time, a team is actually made up of 45 players. The key player on each side is the quarterback who attempts to dictate play.", "Response": "For starters, only 11 players are allowed for each side"}
{"Context": "My favorite singer is Whitney Houston. Whitney Houston was one of the most influencial female singers of all time EOS I really like to listen to music with talented female singers, what about you? EOS I like listening to music but I don't have a preference of male or female.  Whats your favorite group? EOS I really like Whitney Houston quite a lot EOS Yes I was very sad when I learned that she died.  I loved her movie body guard EOS Yes, that was a good one. Who is your favorite musical group? EOS I like the zac brown band.  I've seen them live 3 times EOS Wow, that's pretty cool. The last band I saw live was Dream Theater.", "Knowledge": "Two-time Grammy-nominated and millions-selling progressive music titans Dream Theater announce the forthcoming worldwide release of their 14th studio album, ‘Distance Over Time’ on 22nd February 2019. ‘Distance Over Time’ showcases a newfound creativity for Dream Theater while maintaining the elements...", "Response": "I've never heard of them what type of music do they play?"}
{"Context": "I live in Louisville-Jefferson County, Kentucky. I like to visit national parks. I love nature a lot since childhood. EOS Do you visit national parks often? EOS Yeah vert often like twice a month in my local area. EOS Have you heard about all of the 15-20000 missing person cases involving national parks? EOS No, what is it about? I sit about people going missing or something?", "Knowledge": "Do you have information that could help investigators? Cold cases include missing persons, accidents or crimes that have yet to be solved and have no active leads. New information could come from new witness testimony, new or retained physical evidence, activities of a suspect, or other sources.", "Response": "There are thousands of cold cases involving people who have gone missing in national parks. A lot of them under unusual circumstances. It is quite fascinating and scary!"}
{"Context": "My favorite item recently bought is gallon of milk. i bought milk to make mac and cheese EOS i wanted to make mac and cheese for dinner so i needed to go buy milk EOS I tried making mac and cheese with eggs once, and it was so good! EOS i always like adding jalapenos to mine for a little kick to it", "Knowledge": "Make delicious macaroni and cheese on the stovetop or baked to gooey perfection in the oven.", "Response": "Do you like baking yours or cooking it on the stove?"}
{"Context": "My favorite author is dr suess. i love cat in the hat EOS Oh the places you'll go is my favorite Dr. Seuss book. EOS have you ever read the cat in the hat? EOS yes, that is a good one too! I also really like the live action movie they made. EOS thats a great one too. do you like horton hears a who? EOS I love that one! Jim Carrey did great in it. EOS have you ever read green eggs and ham? i like that one too EOS That one is okay. I've read it a few times. I am excited for the netflix version of it though. EOS there is a netflix version of it coming out soon? thats so great to hear\\", "Knowledge": "‘Green Eggs and Ham’ Renewed for Season 2 at Netflix", "Response": "Yeah, it just got renewed for a season 2."}
{"Context": "My favorite music band is violini. i like very much EOS i like my partner is my friend EOS How long have you been playing the violini EOS two years have been playing the violini", "Knowledge": "WITH NICKY | Violinist Nicola Benedetti – No. 3 ‘The Basics of Vibrato’ [ADVICE]", "Response": "What do you likle about playing the violin?"}
{"Context": "My favorite song is Drunk in love by Beyonce. I love the way Beyonce freed herself in drunk in love. She was so expressive EOS Expressive Beyonce is not what we see always but drunk in love did that to her. Drunk in love is the first ever song by Beyonce that i learned the lyrics word for word EOS Drunk in Love's producer, Detail, had the beat for the song already done and wanted Future to do some vocals on it. EOS Also having both Beyonce and Jay z in the video and lyrics is the best duo i could have asked for. Drunk in love holds a deep meaning for me. It sounds like them reassuring each other of theri love for one another EOS Beyonce and Jay Z even performed Drunk in Love at the Grammy's in 2014. This was the first live performance of the song. EOS I did not watch the live performance and i was so sad about that. Drunk in love also had a good directing. The whole beach setting and water added to the video was a brillant idea", "Knowledge": "The video was filmed on August 15, 2013 in Golden Beach, Florida at a beach front manse that Beyoncé rented out for the shoot. It was directed by Hype Williams and shot in black-and-white; the clip depicts Beyoncé and Jay-Z \"madly in love\". The black-and-white shoot was meant to reference the work of fashion photographer Herb Ritts. Talking about the video in an iTunes Radio session, Beyoncé said, \"The shoot was extremely effortless and spontaneous and we completely captured the energy of the song.\" She also went on to say that it was the most organic shoot she had ever done and further added: \"I wanted to carry this idea of being in the moment and embracing mistakes and effortlessness into the video. I wish every video was like 'Drunk [in Love]'.\" The clip was first released on the iTunes Store on the visual album itself on December 13, 2013, which contained a previously filmed music video for every song and was later uploaded to Beyoncé's Vevo channel three days later, on December 16, 2013.", "Response": "The video was filmed in Golden Beach, Florida in a manse that Beyonce rented for the video specifically."}
{"Context": "My favorite hobby is interesting. EOS Do you have any favorite classic artists? EOS yes  roy is my favorite EOS Are you talking about Roy Wang? EOS no talking about  roy lichtenstein EOS What do you like about his work? EOS i like his pop and new art movement", "Knowledge": "", "Response": "Did he influence your art style?"}
{"Context": "I live in Dallas, Texas. I live in a small city. I live my life happily here.  EOS Which is your interesting hobby? EOS In free time playing football. Foot ball is my favorite game and also one of my hobby also EOS Where did you go for playing? EOS In most of the time going to be ground. Ground was near to be 1 kilometers in my place and also playing to my home EOS Okay, are you played in your home in times of raining? EOS No. I didn't play because this was going to end serious illness. In our old philosophy tells the cold rain gives to the sick EOS Then where did you stay in times of raining?", "Knowledge": "", "Response": "I will neatly goes home when incase of rain was coming on this day."}
{"Context": "I live in New York, New York. I am college student. i am stuying in B.sc chemistry EOS new york has almost 300 colleges. which one do you attend? EOS i am third year studying now EOS are your classes difficult? EOS yeah sometime very difficuilt and complicated subjected attend EOS chemistry involves studying elements and atoms EOS yes not only elements and atom with molecular,chemical reactions also", "Knowledge": "Berkeley College New York New York, New York", "Response": "do you attend berkeley college?"}
{"Context": "My favorite movie is 3 idiot . this is very  funny and  informational  movie  EOS this  kind  of movie  make me  lough", "Knowledge": "", "Response": "what is your favorite movie?"}
{"Context": "My favorite athlete is bryce harper. i love watching bryce harper win", "Knowledge": "Bryce Aron Max Harper (born October 16, 1992) is an American professional baseball right fielder for the Washington Nationals of Major League Baseball (MLB). He stands tall and weighs . Harper was chosen by the Nationals with the first overall pick in the 2010 Major League Baseball Draft.", "Response": "bryce harper was great on the nationals"}
{"Context": "My favorite game is Temple run. I like to play the game that is my daily habit EOS Yeah i understand the sentence EOS I like temple run but  i like  most  8 ball poll EOS Nice I also like that but I play temple run daily EOS I have already 10 best new  android game  in  my  mobile EOS Really! That's very good", "Knowledge": "Shark Cash Cards", "Response": "do  you  like to play shark  cash card game  on mobile"}
{"Context": "My favorite book is I like books very much. I am really interested to read books. EOS So what kind of books or a certain book you like? EOS I am really like to read Shakespeare books. Do you know Shakespeare EOS Yes he is one of the greatest writers. Romeo and Juliet is my favorite, tragic and in love EOS Romeo and Juliet is really best story. EOS I like the story with two feuding families and secretly see each other. EOS What is your famous story?", "Knowledge": "", "Response": "I don't have a famous story. What is the reason why you like reading so much?"}
{"Context": "I love to cook ethnic foods. I like to try new recipes for my friends EOS Do you like to cook ethnic foods? EOS I don't cook.  What is your favorite type of ethnic food? EOS I've been into Indian food lately. EOS Do you do Mughal  and Bengal dishes with fish? EOS I haven't done a lot of fish dishes. I do a lot of Vegetarian dishes, as that's pretty popular EOS I see. How about using chicken like with Tikka Masala? EOS Yes and Butter chicken is really good too", "Knowledge": "Curry Stand Chicken Tikka Masala Sauce", "Response": "I bet curry is a big thing for you."}
{"Context": "My favorite singer is Kelly Clarkson. Kelly Brianne Clarkson is an American singer, songwriter, actress, author, and television personality. EOS Do you like Kelly Clarkson from Fort Worth? EOS Yes. I like Kelly Clarkson EOS She was on American Idol in 2002, can you believe it was that long ago. EOS Yes Partner. No It was not believed. EOS I like her first single since I've been gone. EOS Oh. Ok Partner. Who is your favorite singer?", "Knowledge": "Kelly Brianne Clarkson was born in Fort Worth, Texas, to Jeanne Ann (Rose), a teacher of English, and Stephen Michael Clarkson, an engineer. She was the first winner of the series American Idol, in 2002. Kelly is also a strong believer in God. She has been married to Brandon Blackstock since October 20, 2013. They have two children. See full bio »", "Response": "I like Kelly Clarkson, she is my favorite, who is yours?"}
{"Context": "My favorite actor is Eddie Murphy. Eddie Murphy Raw was a great comedy show EOS Have you seen Eddie Murphy's Raw? EOS Yes.  It was very funny.  He was born in 1961 in NYC. EOS I didn't realize that, that makes him 60 years old!", "Knowledge": "Edward Regan Murphy was born April 3, 1961 in Brooklyn, New York, to Lillian Lynch (born: Lillian Laney), a telephone operator, and Charles Edward Murphy, a transit police officer who was also an amateur comedian and actor. After his father died, his mother married Vernon Lynch, a foreman at a Breyer s Ice Cream plant. His brothers are Charlie ... See full bio »", "Response": "Funny, his dad was a subway police officer."}
{"Context": "My favorite item to buy is Foundation. I am always looking for the best foundation for my skin. EOS Bare Escentuals has been described by some reviewers as the best matte foundation available. EOS I like to use Clinique. It's light on my face. EOS Clinique's \"Even Better Makeup Broad Spectrum SPF 15\" is a popular light weight foundation, perfect even for people with sensitive skin. EOS That's exactly what I use on my face. Before Clinique I used Mary Kay but it was too heavy! EOS There are many other alternatives, as well, such as Maybelline and Estee Lauder. EOS I've tried those as well but they don't compare to Clinique", "Knowledge": "It’s very important to consider the anti-aging ingredients you choose to care for your delicate skin,  said Janet Pardo, Clinique s Senior Vice President of Global Product Development.  Clinique avoids using allergens, irritants, and ingredients in ways that could harm skin. For this formulation, we chose a powerhouse cocktail of skin-plumping ingredients, like argeline and hexapeptide-12 (peptide), that work over time to smooth skin’s surface. We paired them with hydrating ingredients like hyaluronic Acid and glycerin to plump skin, and salicylic acid to reveal a smoother texture.", "Response": "Clinique's foundation products seem to be very popular because of the high quality ingredients that don't irritate the skin."}
{"Context": "I live in San Jose, California. I volunteer with dogs. Dogs are very loving. EOS What is you favorite breed of dogs? EOS I like labs they have good demeanor. EOS Labs are very obedient. Chocolate labs are beautiful and make great service dogs. How long have you been volunteering? EOS For about five years. I was allergic to dogs when I was younger.", "Knowledge": "By AKC Staff Dec 14, 2017 | 3 Minutes So, you want a dog but have always had an allergy attack whenever you’ve been around one — you’re not alone! According to the American College of Allergy, Asthma, and Immunology, as much as 10% of the population in the U.S. is allergic to dogs. While no dog is 100% hypoallergenic, there are a variety of breeds that do well with allergy sufferers. These dogs have a predictable, non-shedding coat which produces less dander. Dander, which is attached to pet hair, is what causes most pet allergies in humans. There are also ways to prep your home that will help keep allergens at bay when you have a dog. Be sure to wash your pet’s bed often, keep up with his grooming, and don’t let him sleep on your bed. It’s also helpful to remove heavy carpets and drapes that trap dander. Find out more about the most popular dog breeds in America. The Bichon Frise is a naturally gentle, happy, playful dog that loves activity. The Bichon’s hair continually grows and doesn’t shed, so regular grooming is important to prevent mats.", "Response": "you were allergic to every breed? There a some hypoallergenic breeds... How did you deal with it?"}
{"Context": "My favorite athlete is nafany. He is such an awesome in game leader. EOS Do you think he is on par with Glaive and Karrigan?", "Knowledge": "Highest Total Prizes Awarded BIG fans come here33Nemiga vs PACT135BIG ERA?86Weak jaw?21We live in a simulation80I got caught outside my exes house...16OLD S1MPLE IS BACK142HLTV Republic111i r8 your car805HAVU vs pro10017G2 or Vitality164Wisla Krakow vs Spirit7very NA thread8UNIKRN.COM Official Q&A68pop smoke28make kids work for free67Would you rather know how or when you die?77JOIN LEAGUE MEN1Natus Vincere vs FaZe264BIG ULTRAS20 Counter-Strike (Beta • Patches • Xbox) Counter-Strike: Condition Zero (Deleted Scenes • Development) Counter-Strike (originally marketed as Half-Life: Counter-Strike) is a multiplayer first-person shooter initially created by Minh Le and Jess Cliffe as a mod for Half-Life. By the fourth beta, the Valve Corporation began assisting the two developers and ultimately offered them jobs. Both of them accepted, and the rights for the game were acquired by Valve. After over a year of public beta testing, the retail version of Counter-Strike was published by Sierra Entertainment on November 8, 2000 for Microsoft Windows. Since the creation of the franchise, various sequels and spinoffs have been created such as Counter-Strike: Condition Zero, Counter-Strike: Source, and the latest in the series, Counter-Strike: Global Offensive. All upcoming CS:GO Matches events listed in one place. Containing livescore, lineups, statistics and much more! Welcome to the leading CS:GO site in the worl featuring news, demos, pictures, statistics, on-site coverage and much much more!", "Response": "Nafany is an amazing Counter Striker....He has more upside."}
{"Context": "My favorite song is Hit me baby one more time. I was the original writer of the song EOS HIt me baby one more time, you know the song. THAT IS MY SONG.", "Knowledge": "Britney Spears was just 16 years old when she made her debut on the Billboard Hot 100 singles chart on Nov. 21, 1998 with the now classic  ... Baby One More Time.  The song shot to No. 1 less than two months later and the rest was history.", "Response": "you are talking about the 1998 britney spears song?"}
{"Context": "My favorite actor is Vin diesel. I am a die hard fan of Vin Diesel EOS What is your favorite Vin Diesel movie? EOS Fast and Furious is my favorite movie. He is such an amazing actor to watch. EOS The first one? There are so many now, and another about to come out! Which one is his best performance in your opinion? EOS Being a die hard fan of him, I would definitely say he has been the best in all the parts. Don't you think so?", "Knowledge": "Fifteen years after accepting his first Movie Award, Diesel accepts the Generation Award for ‘Fast & Furious’ Vin Diesel was raised by his astrologer and psychologist mother and adoptive father in an artist s housing project in New York s Greenwich Village, never knowing his biological father. His first break in acting happened by chance, when at the age of seven he and his friends broke into a theatre to vandalize it.", "Response": "Believe it or not, I haven't seen any of the series. I know that Vin Diesel is the face of the franchise, though. He's my favorite part of the trailers, and a reason that I want to see them, I just haven't gotten a chance yet. I heard that he has a pretty interesting story about how he got started in acting. Have you heard it?"}
{"Context": "My favorite fashion brand is shien . I love thier dresses and shirts", "Knowledge": "Snake Print Bandeau With High Cut Bikini Set", "Response": "i love shien dresses and also the swim wear are nice"}
{"Context": "My favorite hobby is baking. I make a mean banana cookie EOS There are two key things to a good banana cookie, and I make sure to do both. EOS Bananas can be used to make cookies, bread, muffins, and pudding, among other things EOS Yes, and you want to use the blackest of black ones to bake with EOS Ripe bananas have higher antioxidant levels. Green bananas can cause bloating and gas. EOS I didn't know that, fascinating. Ripe ones just simply taste sweeter and better too.l", "Knowledge": "Bananas are a healthy source of fiber, potassium, vitamin B6, vitamin C, and various antioxidants and phytonutrients.", "Response": "Bananas are a great source of fiber, potassium, vitamins B6 and C."}
{"Context": "My favorite hobby is making candles. i love trying out new scents", "Knowledge": "Although it is one of the oldest light sources, candle did not change much throughout the history. It is basically a mass of wax or some other fuel through which is embedded wick which, when lit, produces light. They are used for illumination and sometimes for heating. There is evidence that the earliest candles were made from whale fat in China during the Qin Dynasty, some 200 years B.C. In India, about the same time, they were made from wax that was a residue of boiling cinnamon. After that many of the fuels and materials for wicks are tried. One of the most common materials people used for fuel is beeswax. It was used from 40BC in China until the discovery of synthetic materials. Those from 40BC China were made in paper molds with rice paper wicks. One of interesting variants of candle dates from 1st century and is made from a type of fish called eulachon which is nicknamed “candlefish”. During spawning, its body fat is so high that, if caught and dried, it can be lit and used as a candle. Nomadic tribes were first to make candles in Europe during the late Roman era. Candles they made were made from tallow or animal fate because olive oil (that Romans used for lamps) was almost nonexistent in the northern regions of Europe. When Roman Empire fell, so did the amounts of olive oil that were available to the regions that were under it so the candles made from tallow spread across the Western Europe.", "Response": "So you make candles.  It's an ancient art.  They think they originated in 200BC in India.  SO you do your own scents?  How does that work?"}
{"Context": "I live in Minneapolis, Minnesota. I drive a truck for a living. I travel the east coast mainly EOS i love the travel thru western Virginia EOS Very beautiful. I live in Elkton in the Shenandoah Valley What highways do you drive? EOS I mainly travel thru interstate *1 EOS You need to be extra careful in I-64 and 81. There is always a lot of traffic and accidents. EOS Yeah sorry I meant to say 81, but the speed on that highway is probably why", "Knowledge": "During the warmer months, hop on a Nice Ride bike at one of nearly 200 Nice Ride stations and cruise down Minneapolis’ 226 miles of bike paths.", "Response": "Do you spend much time at home? There must be lots of things to do in Minneapolis."}
{"Context": "My favorite book is think and grow rich. it is a finance book EOS are you interested on reading about finances? EOS not really but it sounds interesting, that book was published in 193. thats incredible EOS It was written by Napoleon EOS napoleon was a millitary commander i did not know he wrote a book EOS Sorry, Napoleon hill is a publisher EOS yeah his book think and grow rich was a great book. it selled alot EOS It is also selling well on amazon", "Knowledge": "Napoleon Hill’s first magazine was called Hill’s Golden Rule and it was born in Napoleon Hill’s mind on Armistice Day, November 11, 1918. The end of the World War so inspired Hill that he vowed that day to create a new magazine to promote the philosophy of the golden rule in personal achievement and business success...", "Response": "thats great, when did you read it. he even wrote a magazine called hill's golden rule"}
{"Context": "My favorite fashion brand is Christian Dior. I own a lot of vintage clothing from this brand. EOS I think vintage clothing is great. The styles are coming back. Christian Dior has a lot of classic styles. The silk items are my favorite. What do you thin kof natural fabrics like silk? EOS Using natural fabrics like cotton and linen is a great way to help not only yourself but the environment as well. EOS I agree. Those fabrics are so much more comfortable as well. They may sometimes require a little bit more care, but it's worth it. Who is your favorite fashion designer?", "Knowledge": "Michael Kors launched his namesake women’s collection in 1981 at Bergdorf Goodman after their fashion director, Dawn Mello, asked Kors to show his work to Bergdorf Goodman’s buyers. However, by 1993, KORS Michael Kors closed, and the business went bankrupt. After working with a couple of other brands for a few years, he relaunched the brand in 1997. Today, one of the top American designer brands, Michael Kors is known for its effortless ready-to-wear, shoes, bags, accessories, cosmetics, and more in a classic, modern design. The latest Michael Kors collections are available online at Michael Kors, Net-a-Porter, Farfetch, and Nordstrom.", "Response": "I like Michael Kors aesthetic and the ease of buying his products."}
{"Context": "I live in Tulsa, Oklahoma. One day i would really like to skydive. But I'm also scared of heights. Maybe one can reconcile the other? EOS The mayor of tulas is GT Bynum EOS What's fun to do around here? EOS Tulsa has fun parks to exploreee EOS I want more excitement! Any suggestions?", "Knowledge": "First impressions make this humble restaurant seem like a typical Mexican eatery. The front facade is done in the typical Spanish style, similar to the plethora of other Mexican restaurants out there. But that s where the similarity ends.", "Response": "Tulsa has good mexican restaurants"}
{"Context": "My favorite item to buy is bmw car. I like bmw cars, the new model is such nice EOS I heard that they are nicknamed the world's fastest mullet. EOS Bmw cars are spacious and are relatively cheap EOS I heard that they run about $84,900 and can be almost $200,000. That's a hefty price. EOS Those are luxury cars with such kind of price tag EOS Do you like them because they make good impressions? EOS Yah. plus the design EOS I heard that 3-D printing is used for some designs. EOS It reduces cost of production", "Knowledge": "BMW plans multi-billion cost cuts to maintain profitability, report says", "Response": "I heard that BMW was cutting billions of dollars to maintain profitability."}
{"Context": "I live in Phoenix, Arizona. I volunteer at an animal shelter. I walk dogs to help them get adopted.", "Knowledge": "The Arizona Humane Society has breeds of all sizes, temperaments and energy levels. Oftentimes, dogs are already trained and housebroken, making the transition into your home an easy one. All of our pets are waiting to give you their unconditional love and introduce you to the joy of pet ownership.", "Response": "Do you work with the Arizona Humane Society? I know they have tons of differents breeds and types of dogs!"}
{"Context": "I live in Chicago, Illinois. Winter s my favorite time of the year. snow is so beautiful and fun to play in.  EOS Winter in chicago can be brutal, but so beautiful.Do you know how much rain makes an inch of snow? EOS i know that 10 inches of snow will melt to 1 inch of liquid EOS Cool, the lake effect snow off the lake can bring cold temperatures that are great for cuddling. We like to build a fire in the fire place. EOS i hear it can get very windy there. although the origin of 'the windy city' name is not entirely clear EOS When the wind isn't blowing, sledding is popular. Do you toboggan?", "Knowledge": "That’s why some towns in Canada and the United States have recently banned tobogganing. Other towns have put limits on which hills people can toboggan on.", "Response": "i haven't been in a while but i enjoy it. i heard some towns have tried to ban it because kids get hurt"}
{"Context": "My favorite hobby is collecting books and films. I have an extensive book and film library EOS That's interesting. Do you have a particular genre of films that you prefer, or a certain style of writing that you like? EOS All genres, but I think I love American Noir, the American Western, and foreign films most. EOS I was looking at a list of foeign films and saw the title Metropolis. It was rated number 7. I saw this years ago. It's a black and white silent film. Have you seen it? EOS Oh, yeah! Fritz Lang directed, one of his best films. He made movies in America after he left Germany during the '30s. EOS Yes. One of the first SciFi blockbusters! There was a scene where the people were marching around the machine, goose-stepping, just like the Nazis. EOS Very prescient movie. It's still considered one of the 10 greatest SF films. Kubrick's 2001 usually takes the #1 spot, but Metropolis isn't far behind.", "Knowledge": "Before we begin, it is only fair to note that there is a difference between a book collection and a personal library. Both are good and beautiful things, but they are different. Many of us have personal libraries in our homes: all those used books purchased for college courses, the stack of children’s books peppering the bottom shelf, how-to compendiums for the first-time homeowner, etc. In short, a personal library includes books we’ve acquired in numerous ways, and there’s often not a clear theme present. It is what it is — a library with many topics in its arsenal. A collection, on the other hand, is a focused attempt to amass a specific type of book, usually of a certain quality.", "Response": "I was wondering about your book collection. Do you have any rare books?"}
{"Context": "I like listening to all genres of music except country music. I love Rock and Blues EOS Good morning! I'm looking for information on the band Ten Years After. I remember it from my teen years, but haven't heard much about it since. EOS I think they stopped after the guitartist died after surgery. EOS Alvin Lee? I'm sorry to hear that! Terrific lead guitarist! When did he die? Was the band still together at the time he died? EOS I don't know what year he died.  He was 68 when he died.  He did leave the band in 1973 to focus on a solo career. EOS Ah, OK. So the band broke up in '73, not too long after I lost touch with them. They were very good, and Lee was an underrated Blues guitarist, stuck in the shadow of Hendrix, Clapton, Page, and Beck.", "Knowledge": "Image caption Lee became acclaimed for his guitar solos at Woodstock in 1969", "Response": "I hear his solos at Woodstock were amazing."}
{"Context": "I live in Memphis, Tennessee. Sometimes i volunteer at the soup kitchen. I do this twice a month with my church.  EOS Do you attend Germantown church? EOS No church of God. It is a sister church to Pentecostal. EOS Oh yeah, I've heard of COGIC. Thats a great church did you attend the convocation in November? EOS No I do not really do any events or conventions with the larger church and focus on local things here in Memphis. EOS So your focus is the same: Sincerity, softness and Strength? Do you help out at the homelss shelters? EOS Yeah I guess it is lol. I do I help with my local soup kitchen and we do clothing drives. Do you have any tips on how to make that more efficient? EOS Actually I do: greet them and treat them as an equal, ask if they would like to vollenteer after they are done eating. Also, ask them if there is anything else they need like underwear, clothes, sleeping bags. EOS That's a great idea asking if they would like to help out after they are done eating. That would be a great way to get to know people better.", "Knowledge": "", "Response": "Yeah and also ask them questions about themselves, their past...things they use to enjoy."}
{"Context": "My favorite song is juicy. its such a dope and nostalgic song for me, i could listen to it all day with the volume turned all the way up EOS What is your favorite type of music? EOS 90s hiphop n r and b EOS That was a great time for music, totally. Are you a Snoop Dogg or a Tupac fan? EOS biggie, east coast alllll day lol    i did like pac too, i just like big ALOT more EOS Tupac is still so remembered, even though he died over 20 years ago. There was a documentary about him that won an Academy Award. Do you think he would be such an influential figure if he hadn't died? EOS absoloutly, he was an amazing poet, But as i said earlier i love big more, i still remember him on the anniversary of his death every year", "Knowledge": "T’yanna is the owner and CEO of Notoriouss Clothing, while Christopher followed in his dad’s footsteps by becoming an entertainer. He appeared in the 2016 film Kicks and is planning on releasing an album with his rap group CJ & Jahad later this year.", "Response": "Biggie's son was going to be a rapper too, a few years ago. I can't remember hearing anything more about that though, I wonder if he ever released an album"}
{"Context": "My favorite tv show is 90 day fiancé. I like to find out which couples are still together.", "Knowledge": "The series debuted on January 12, 2014, and has been renewed through its seventh season.[1]", "Response": "90 Day Fiancé has been on the air since 2014."}
{"Context": "My favorite fashion designer is L.v.. all their items are so beautiful and now the new stuf is aimed at a younger crowd n it makes me want the peices even more then the older stuf EOS i love the new water color collection. i litterly want every single peice EOS You've got great taste! Louis Vuitton is best know for the travel cases. EOS Did you see the custom pink shoe trunk they made for j. Star? omgggggg Its amazing and its the size of a whole bedroom EOS Yes, gorgeous! Have you ever had anything specifically made for you from LV? EOS omg, can you imagine ever being that rich? lolol  i wish they would make me a custom peice. Do you have any custom peices? EOS No, not me. LV will be presenting the new collection of Objets Nomades in Milano. EOS i bet to be in milano to actually see the collection as its being shown, would be an amazing exspirance!!", "Knowledge": "", "Response": "Yes, it would. How many LV pieces do you own?"}
{"Context": "I wear nice clothes. I like wearing nice clothes it makes me feel a little better about myself. EOS Have you heard about the new luxury tax they are trying to impose? EOS I did not hear about that, I dont watch a lot of news. But it does not surprise me.", "Knowledge": "", "Response": "Whats your favorite designer brand of clothes?"}
{"Context": "My favorite music band is Daughtry. He should have won American Idol! EOS Chris Daughtry was on the fifth season of American Idol, ending as the 4th place finalist. EOS I was so upset when he lost!  I cried!  I don't even remember who won that season! EOS Taylor Hicks was the winner that year, and he's still one of the best earners for Idol with his Las Vegas residency. EOS I think Adam Lambert probably tops Taylor Hicks. EOS Yes, he was second his season but now has a net worth of 25 million! EOS Daughtry and Lambert were my favorites. Daughtry was on THe Masked Singer!", "Knowledge": "The King of Mask Singer () is a South Korean singing competition program presented by Kim Sung-joo, with introductions by voice actor . It airs on MBC on Sunday at 16:50, starting from April 5, 2015 as a part of MBC's \"Sunday Night\" programming block, along with \"Real Men\", replacing \"Animals\". \"King of Mask Singer\" are directly competing the viewership ratings against \"Running Man\" (SBS) and \"Happy Sunday\"'s \"The Return of Superman\" (KBS2), which are airing in the same timeframe every Sunday.", "Response": "The Masked Singer is actually from a Korean show, The King of Mask Singer."}
{"Context": "My favorite music band is Daughtry. He should have won American Idol! EOS Chris Daughtry was on the fifth season of American Idol, ending as the 4th place finalist. EOS I was so upset when he lost!  I cried!  I don't even remember who won that season! EOS Taylor Hicks was the winner that year, and he's still one of the best earners for Idol with his Las Vegas residency. EOS I think Adam Lambert probably tops Taylor Hicks. EOS Yes, he was second his season but now has a net worth of 25 million! EOS Daughtry and Lambert were my favorites. Daughtry was on THe Masked Singer! EOS The Masked Singer is actually from a Korean show, The King of Mask Singer. EOS Daughtry should have won and not Wayne Brady!", "Knowledge": "Wayne Brady is a multi-talented American celebrity. The famous TV personality is not just into acting but also into comedy and singing. He was active on the American version of the improvisational comedy television series Whose Line Is It, Anway? He also has hosted quite a number of shows such as Fox Don’t Forget the Lyrics, Let’s Make a Deal and The Wayne Brady’s Show. Read more about the actor below.", "Response": "Wayne Brady doing improv songs on Whose Line is it Anyway was always the highlight of the show."}
