{"Context": "I love dogs!", "Knowledge": "The dog was the first species to be domesticated and has been selectively bred over millennia for various behaviors, sensory capabilities, and physical attributes.", "Response": "really? me too! well, who doesnt? you know, the dog was first species to be domesticated by man"}
{"Context": "I love dogs! EOS really? me too! well, who doesnt? you know, the dog was first species to be domesticated by man EOS Thats very interesting i had no idea dogs were the first to be domesticated.  Can you tell me more about dogs ?", "Knowledge": "Dogs vary widely in shape, size and colors.", "Response": "sure, they vary greatly in size, shape and color?"}
{"Context": "I love dogs! EOS really? me too! well, who doesnt? you know, the dog was first species to be domesticated by man EOS Thats very interesting i had no idea dogs were the first to be domesticated.  Can you tell me more about dogs ? EOS sure, they vary greatly in size, shape and color? EOS Very interesting.  My favorite dog is the Yorki", "Knowledge": "no_passages_used", "Response": "oh yeah? mine is the french bulldog, such an adorable animal!"}
{"Context": "I love dogs! EOS really? me too! well, who doesnt? you know, the dog was first species to be domesticated by man EOS Thats very interesting i had no idea dogs were the first to be domesticated.  Can you tell me more about dogs ? EOS sure, they vary greatly in size, shape and color? EOS Very interesting.  My favorite dog is the Yorki EOS oh yeah? mine is the french bulldog, such an adorable animal! EOS Oh yeah i love those dogs.  My cousin just bought one", "Knowledge": "no_passages_used", "Response": "french bulldog? ask him to bath it regularly, they get really smelly, lol"}
{"Context": "Do you know anyone who is a Vegan?  I am and it's really hard and sort of lonely.", "Knowledge": "The term \"ethical vegan\" is often applied to those who not only follow a vegan diet but extend the philosophy into other areas of their lives, and oppose the use of animals for any purpose.", "Response": "I know plenty! I'm sorry it's hard for you. Does that have to do with where you live? Or maybe you're an \"ethical vegan\" and have people around you who don't buy into that philosophy?"}
{"Context": "Do you know anyone who is a Vegan?  I am and it's really hard and sort of lonely. EOS I know plenty! I'm sorry it's hard for you. Does that have to do with where you live? Or maybe you're an \"ethical vegan\" and have people around you who don't buy into that philosophy? EOS Probably where I live.  I'm in the south where they even cook veggies in pork!", "Knowledge": "\"Dietary vegans\" (or strict vegetarians) refrain from consuming animal products, not only meat but also eggs, dairy products and other animal-derived substances.", "Response": "I hear you. Texas girl myself, so yes MEAT and BBQ, etc. What made you choose veganism? Diet or ethics or both?"}
{"Context": "Do you know anyone who is a Vegan?  I am and it's really hard and sort of lonely. EOS I know plenty! I'm sorry it's hard for you. Does that have to do with where you live? Or maybe you're an \"ethical vegan\" and have people around you who don't buy into that philosophy? EOS Probably where I live.  I'm in the south where they even cook veggies in pork! EOS I hear you. Texas girl myself, so yes MEAT and BBQ, etc. What made you choose veganism? Diet or ethics or both? EOS Mostly ethics.  I feel like it's so random on what people say is ok to eat. Why stop at dogs and cats?  All animals are animals whether or not domesticated!", "Knowledge": "", "Response": "It's a fair point. And obviously that line depends on where in the world you live! Are you a member of PETA, the international animal rights organization?"}
{"Context": "Do you know anyone who is a Vegan?  I am and it's really hard and sort of lonely. EOS I know plenty! I'm sorry it's hard for you. Does that have to do with where you live? Or maybe you're an \"ethical vegan\" and have people around you who don't buy into that philosophy? EOS Probably where I live.  I'm in the south where they even cook veggies in pork! EOS I hear you. Texas girl myself, so yes MEAT and BBQ, etc. What made you choose veganism? Diet or ethics or both? EOS Mostly ethics.  I feel like it's so random on what people say is ok to eat. Why stop at dogs and cats?  All animals are animals whether or not domesticated! EOS It's a fair point. And obviously that line depends on where in the world you live! Are you a member of PETA, the international animal rights organization? EOS I am not - I feel like they are too extreme and give Vegans a bad name!  What do you think about them?", "Knowledge": "Its slogan is \"Animals are not ours to eat, wear, experiment on, use for entertainment, or abuse in any other way.\"", "Response": "I have to agree. I would likely be more open to their messaging if it didn't so often go for the shock value. Their slogan is \"Animals are not ours to eat, wear, experiment on, use for entertainment, or abuse in any other way.\" THAT I can agree with more than shock"}
{"Context": "Do you know anyone who is a Vegan?  I am and it's really hard and sort of lonely. EOS I know plenty! I'm sorry it's hard for you. Does that have to do with where you live? Or maybe you're an \"ethical vegan\" and have people around you who don't buy into that philosophy? EOS Probably where I live.  I'm in the south where they even cook veggies in pork! EOS I hear you. Texas girl myself, so yes MEAT and BBQ, etc. What made you choose veganism? Diet or ethics or both? EOS Mostly ethics.  I feel like it's so random on what people say is ok to eat. Why stop at dogs and cats?  All animals are animals whether or not domesticated! EOS It's a fair point. And obviously that line depends on where in the world you live! Are you a member of PETA, the international animal rights organization? EOS I am not - I feel like they are too extreme and give Vegans a bad name!  What do you think about them? EOS I have to agree. I would likely be more open to their messaging if it didn't so often go for the shock value. Their slogan is \"Animals are not ours to eat, wear, experiment on, use for entertainment, or abuse in any other way.\" THAT I can agree with more than shock EOS Yeah you'd think by now they'd realize their shock marketing doesn't work.  It almost makes me want to eat animal products!", "Knowledge": "Well-planned vegan diets can reduce the risk of some types of chronic disease, including heart disease.", "Response": "Ha! I know. That tends to be my response to extremism in every way shape and form. Do you find it easy to plan your diet? It can have so many health benefits and reduce risk of so many illnesses."}
{"Context": "", "Knowledge": "They are often valued by humans for companionship and for their ability to hunt vermin.", "Response": "I love cats!  I have 3 of them - I have them for companionship and for their ability to hunt mice!"}
{"Context": "I love cats!  I have 3 of them - I have them for companionship and for their ability to hunt mice! EOS oh I love cats too! I've always wanted one I know  they give you \"presents\" sometimes", "Knowledge": "They can see in near darkness.", "Response": "LOL!  I think it's cool how they can see when it's almost near darkness!"}
{"Context": "I love cats!  I have 3 of them - I have them for companionship and for their ability to hunt mice! EOS oh I love cats too! I've always wanted one I know  they give you \"presents\" sometimes EOS LOL!  I think it's cool how they can see when it's almost near darkness! EOS that is pretty cool and freaky! I can't have any because my brother's allergic and to be fair my dogs aren't friendly with cats. But I feel if it were a kitten they'd be okay", "Knowledge": "Cats can hear sounds too faint or too high in frequency for human ears, such as those made by mice and other small animals.", "Response": "I think they are good at catching mice because they can hear sounds that are too high in frequency for humans to hear - like those made by mice!"}
{"Context": "I love cats!  I have 3 of them - I have them for companionship and for their ability to hunt mice! EOS oh I love cats too! I've always wanted one I know  they give you \"presents\" sometimes EOS LOL!  I think it's cool how they can see when it's almost near darkness! EOS that is pretty cool and freaky! I can't have any because my brother's allergic and to be fair my dogs aren't friendly with cats. But I feel if it were a kitten they'd be okay EOS I think they are good at catching mice because they can hear sounds that are too high in frequency for humans to hear - like those made by mice! EOS Oh that reminds me I have a mouse that visits me in the winter! So nevermind no cats for me!!!", "Knowledge": "Cats are similar in anatomy to the other felids, with a strong flexible body, quick reflexes, sharp retractable claws, and teeth adapted to killing small prey.", "Response": "LOL!  It's interesting how their body is so flexible, and that they have sharp retractable claws"}
{"Context": "", "Knowledge": "Cooking or cookery is the art, technology, science and craft of preparing food for consumption with or without the use of heat.", "Response": "Hi there !Let's talk about cooking . cookery is the art, technology, science and craft of preparing food for consumption ,with or without heat"}
{"Context": "Hi there !Let's talk about cooking . cookery is the art, technology, science and craft of preparing food for consumption ,with or without heat EOS I'm not much of a cook myself, but I'm learning!  I love eating food, I just need to learn how to prepare it!", "Knowledge": "Cooking techniques and ingredients vary widely across the world, from grilling food over an open fire to using electric stoves, to baking in various types of ovens, reflecting unique environmental, economic, and cultural traditions and trends.", "Response": "Cooking techniques and ingredients vary widely across the world, from grilling food over an open fire to using electric stoves"}
{"Context": "Hi there !Let's talk about cooking . cookery is the art, technology, science and craft of preparing food for consumption ,with or without heat EOS I'm not much of a cook myself, but I'm learning!  I love eating food, I just need to learn how to prepare it! EOS Cooking techniques and ingredients vary widely across the world, from grilling food over an open fire to using electric stoves EOS I like the taste of grilled food the best!  Nothing better than crispy steak and potatoes!", "Knowledge": "The ways or types of cooking also depend on the skill and type of training an individual cook has.", "Response": "Interestingly,types of cooking also depend on the skill and type of training an individual cook has."}
{"Context": "Hi there !Let's talk about cooking . cookery is the art, technology, science and craft of preparing food for consumption ,with or without heat EOS I'm not much of a cook myself, but I'm learning!  I love eating food, I just need to learn how to prepare it! EOS Cooking techniques and ingredients vary widely across the world, from grilling food over an open fire to using electric stoves EOS I like the taste of grilled food the best!  Nothing better than crispy steak and potatoes! EOS Interestingly,types of cooking also depend on the skill and type of training an individual cook has. EOS I'm afraid I don't have much skill yet, but I'm working on it! Do you have any suggestions as to what is the easiest thing to learn how to cook?", "Knowledge": "Preparing food with heat or fire is an activity unique to humans.", "Response": "Sure! Preparing food with heat or fire is an activity one can learn from a catering school or guidance"}
{"Context": "Hi there !Let's talk about cooking . cookery is the art, technology, science and craft of preparing food for consumption ,with or without heat EOS I'm not much of a cook myself, but I'm learning!  I love eating food, I just need to learn how to prepare it! EOS Cooking techniques and ingredients vary widely across the world, from grilling food over an open fire to using electric stoves EOS I like the taste of grilled food the best!  Nothing better than crispy steak and potatoes! EOS Interestingly,types of cooking also depend on the skill and type of training an individual cook has. EOS I'm afraid I don't have much skill yet, but I'm working on it! Do you have any suggestions as to what is the easiest thing to learn how to cook? EOS Sure! Preparing food with heat or fire is an activity one can learn from a catering school or guidance EOS Awesome!  I think I should sign up at a catering school - I will learn a lot there!", "Knowledge": "It may have started around 2 million years ago, though archaeological evidence for it reaches no more than 1 million years ago.", "Response": "More so,Cooking likely dates back to  have started around 2 million years ago, though archaeological evidence for it reaches no more than 1 million years ago."}
{"Context": "", "Knowledge": "Hiking is the preferred term, in Canada and the United States, for a long, vigorous walk, usually on trails (footpaths), in the countryside, while the word walking is used for shorter, particularly urban walks.", "Response": "I love going hiking! It's so nice to hike through the countryside and on trails."}
{"Context": "I love going hiking! It's so nice to hike through the countryside and on trails. EOS I also enjoy hiking.  It is great exercise and also a really fun way to enjoy nature", "Knowledge": "It is a popular activity with numerous worldwide, and studies suggest that all forms of walking have health benefits.", "Response": "Hiking is a popular activity. All forms of walking have health benefits, and hiking has even better benefits!"}
{"Context": "I love going hiking! It's so nice to hike through the countryside and on trails. EOS I also enjoy hiking.  It is great exercise and also a really fun way to enjoy nature EOS Hiking is a popular activity. All forms of walking have health benefits, and hiking has even better benefits! EOS I really enjoy hiking in National Parks.  I also enjoy hiking around rivers and lakes", "Knowledge": "A day hike refers to a hike that can be completed in a single day.", "Response": "That's awesome! My boyfriend and I go on day hikes, they normally take up the entire day!"}
{"Context": "I love going hiking! It's so nice to hike through the countryside and on trails. EOS I also enjoy hiking.  It is great exercise and also a really fun way to enjoy nature EOS Hiking is a popular activity. All forms of walking have health benefits, and hiking has even better benefits! EOS I really enjoy hiking in National Parks.  I also enjoy hiking around rivers and lakes EOS That's awesome! My boyfriend and I go on day hikes, they normally take up the entire day! EOS I enjoy backpacking as well.  It is a little bit different than regular hiking in that it generally lasts longer than a day", "Knowledge": "In the United States, Canada, the Republic of Ireland, and United Kingdom, hiking means walking outdoors on a trail, or off trail, for recreational purposes.", "Response": "Sometimes we enjoy going off trail just to switch up the monotony of following the pathways."}
{"Context": "have you ever tried vegetarianism", "Knowledge": "Many people object to eating meat out of respect for sentient life.", "Response": "Yes! i am one of the people that object eating meat for respect to the animals!"}
{"Context": "have you ever tried vegetarianism EOS Yes! i am one of the people that object eating meat for respect to the animals! EOS yes eating animals is the number one cause of pollution", "Knowledge": "Vegetarianism may be adopted for various reasons.", "Response": "Yes totally even tho vegetarianism may be adopted for varius reasons, like health and heart diseases!"}
{"Context": "have you ever tried vegetarianism EOS Yes! i am one of the people that object eating meat for respect to the animals! EOS yes eating animals is the number one cause of pollution EOS Yes totally even tho vegetarianism may be adopted for varius reasons, like health and heart diseases! EOS yes eating too much meat can lead to gaining all kinds of diseases it is tough to adapt to the lifestyle at first", "Knowledge": "A vegan diet excludes all animal products, including eggs and dairy.", "Response": "At first yes speccially when you also have to exclude eggs and dairy!"}
{"Context": "have you ever tried vegetarianism EOS Yes! i am one of the people that object eating meat for respect to the animals! EOS yes eating animals is the number one cause of pollution EOS Yes totally even tho vegetarianism may be adopted for varius reasons, like health and heart diseases! EOS yes eating too much meat can lead to gaining all kinds of diseases it is tough to adapt to the lifestyle at first EOS At first yes speccially when you also have to exclude eggs and dairy! EOS yes it was tough changing that out of my diet those two products seem to be in just about everything in the store", "Knowledge": "no_passages_used", "Response": "It is very similar to a vegan diet, i really dont now the diference about it!"}
{"Context": "have you ever tried vegetarianism EOS Yes! i am one of the people that object eating meat for respect to the animals! EOS yes eating animals is the number one cause of pollution EOS Yes totally even tho vegetarianism may be adopted for varius reasons, like health and heart diseases! EOS yes eating too much meat can lead to gaining all kinds of diseases it is tough to adapt to the lifestyle at first EOS At first yes speccially when you also have to exclude eggs and dairy! EOS yes it was tough changing that out of my diet those two products seem to be in just about everything in the store EOS It is very similar to a vegan diet, i really dont now the diference about it! EOS vegans are even more restrictive than vegetarians", "Knowledge": "A follower of either the diet or the philosophy is known as a vegan ( ).", "Response": "Yes i was vegan for a time, i follow the philosophy but not the diet!"}
{"Context": "Surfing seems so fun but I haven't tried it before.", "Knowledge": "The riding of waves has likely existed since humans began swimming in the ocean.", "Response": "It is a lot of fun.  People have been surfing in one form or another since humans started swimming in the sea"}
{"Context": "Surfing seems so fun but I haven't tried it before. EOS It is a lot of fun.  People have been surfing in one form or another since humans started swimming in the sea EOS Really? What was the purpose back then?", "Knowledge": "Standing up on what is now called a surfboard is a relatively recent innovation developed by the Polynesians.The influences for modern surfing can be directly traced to the surfers of pre-contact Hawaii.", "Response": "I am sure it was just for fun.  Standing on a board was attributed to the Polynesians.  Basically surfing comes from ancient Hawaii"}
{"Context": "Surfing seems so fun but I haven't tried it before. EOS It is a lot of fun.  People have been surfing in one form or another since humans started swimming in the sea EOS Really? What was the purpose back then? EOS I am sure it was just for fun.  Standing on a board was attributed to the Polynesians.  Basically surfing comes from ancient Hawaii EOS Oh okay, I thought it might be for some weird hunting back then.", "Knowledge": "It has affected music, clothing fashion, literature, film, art, and youth jargon in popular culture' the number of surfers throughout the world continues to increase.", "Response": "Perhaps, but not from what I have heard.  Surfing culture has influenced music, art and fashion over the years"}
{"Context": "Surfing seems so fun but I haven't tried it before. EOS It is a lot of fun.  People have been surfing in one form or another since humans started swimming in the sea EOS Really? What was the purpose back then? EOS I am sure it was just for fun.  Standing on a board was attributed to the Polynesians.  Basically surfing comes from ancient Hawaii EOS Oh okay, I thought it might be for some weird hunting back then. EOS Perhaps, but not from what I have heard.  Surfing culture has influenced music, art and fashion over the years EOS Oh yeah, like the music in the mid 1900's about surfing in California and all that.", "Knowledge": "Waves suitable for surfing are primarily found in the ocean, but can also be found in lakes or in rivers in the form of a standing wave or tidal bore.", "Response": "Yes.  It is interesting that people can actually surf in rivers and lakes too"}
{"Context": "Surfing seems so fun but I haven't tried it before. EOS It is a lot of fun.  People have been surfing in one form or another since humans started swimming in the sea EOS Really? What was the purpose back then? EOS I am sure it was just for fun.  Standing on a board was attributed to the Polynesians.  Basically surfing comes from ancient Hawaii EOS Oh okay, I thought it might be for some weird hunting back then. EOS Perhaps, but not from what I have heard.  Surfing culture has influenced music, art and fashion over the years EOS Oh yeah, like the music in the mid 1900's about surfing in California and all that. EOS Yes.  It is interesting that people can actually surf in rivers and lakes too EOS Oh really? How can they do that?", "Knowledge": "However, surfers can also utilize artificial waves such as those from boat wakes and the waves created in artificial wave pools.", "Response": "Some people surf on waves made by the wakes of boats."}
{"Context": "", "Knowledge": "Red hair (or ginger hair) occurs naturally in 1–2% of the human population.", "Response": "I love red hair, just died mine! Real red hair only occurs naturally in 1–2% of the human population."}
{"Context": "I love red hair, just died mine! Real red hair only occurs naturally in 1–2% of the human population. EOS That's cool!  What countries do you think have the most naturally red-headed people?", "Knowledge": "It occurs more frequently (2–6%) in people of northern or western European ancestry, and less frequently in other populations.", "Response": "Usually in people of northern or western European ancestry, and less frequently in other populations."}
{"Context": "I love red hair, just died mine! Real red hair only occurs naturally in 1–2% of the human population. EOS That's cool!  What countries do you think have the most naturally red-headed people? EOS Usually in people of northern or western European ancestry, and less frequently in other populations. EOS I've noticed that natural redheads usually have freckles. Do you think that is accurate?", "Knowledge": "It is associated with fair skin color, lighter eye colors (gray, blue, green, and hazel), freckles, and sensitivity to ultraviolet light.", "Response": "Yes! In fact, red heads usually have lighter eye colours and sensitivity to ultraviolet  light!"}
{"Context": "I love red hair, just died mine! Real red hair only occurs naturally in 1–2% of the human population. EOS That's cool!  What countries do you think have the most naturally red-headed people? EOS Usually in people of northern or western European ancestry, and less frequently in other populations. EOS I've noticed that natural redheads usually have freckles. Do you think that is accurate? EOS Yes! In fact, red heads usually have lighter eye colours and sensitivity to ultraviolet  light! EOS Why do you think people are envious on those with red hair?", "Knowledge": "Cultural reactions have varied from ridicule to admiration; many common stereotypes exist regarding redheads and they are often portrayed as fiery-tempered.", "Response": "I do not know but I do know they have been said to be often portrayed as fiery-tempered lol"}
{"Context": "I love red hair, just died mine! Real red hair only occurs naturally in 1–2% of the human population. EOS That's cool!  What countries do you think have the most naturally red-headed people? EOS Usually in people of northern or western European ancestry, and less frequently in other populations. EOS I've noticed that natural redheads usually have freckles. Do you think that is accurate? EOS Yes! In fact, red heads usually have lighter eye colours and sensitivity to ultraviolet  light! EOS Why do you think people are envious on those with red hair? EOS I do not know but I do know they have been said to be often portrayed as fiery-tempered lol EOS I definitely agree with that!  Why do you think redheads draw so much attention?", "Knowledge": "Redheads today are commonly associated with the Celtic nations and to a far lesser extent the Germanic peoples.", "Response": "Redheads today are commonly associated with the Celtic nations - so people are probably really intrigued when they see them!"}
{"Context": "", "Knowledge": "A steak () is a meat generally sliced across the muscle fibers, potentially including a bone.", "Response": "Steak is my favorite meal. I cook mine in single malt scotch. As long as you cut it right across the fibers when you eat it's amazing."}
{"Context": "Steak is my favorite meal. I cook mine in single malt scotch. As long as you cut it right across the fibers when you eat it's amazing. EOS I love steak it is so good", "Knowledge": "Single malts are typically associated with single malt Scotch, though they are also produced in various other countries.", "Response": "It pairs well with a nice Single Malt Scotch form the Inverness region."}
{"Context": "Steak is my favorite meal. I cook mine in single malt scotch. As long as you cut it right across the fibers when you eat it's amazing. EOS I love steak it is so good EOS It pairs well with a nice Single Malt Scotch form the Inverness region. EOS That sounds great", "Knowledge": "In a larger sense, there are also fish steaks, ground meat steaks, pork steak and many more varieties of steaks.", "Response": "Do you prefer beef steak, pork steak or fish steak?"}
{"Context": "Steak is my favorite meal. I cook mine in single malt scotch. As long as you cut it right across the fibers when you eat it's amazing. EOS I love steak it is so good EOS It pairs well with a nice Single Malt Scotch form the Inverness region. EOS That sounds great EOS Do you prefer beef steak, pork steak or fish steak? EOS Beef of course", "Knowledge": "Steaks are also cut from grazing animals, usually farmed, other than cattle, including bison, camel, goat, horse, kangaroo, sheep, ostrich, pigs, reindeer, turkey, deer and zebu as well as various types of fish, especially salmon and large pelagic fish such as swordfish, shark and marlin.", "Response": "I think I prefer Beef, kangaroo, ostrich and fish. I was recently in France and they had Camel and Horse steak but I could not make my self try it."}
{"Context": "Steak is my favorite meal. I cook mine in single malt scotch. As long as you cut it right across the fibers when you eat it's amazing. EOS I love steak it is so good EOS It pairs well with a nice Single Malt Scotch form the Inverness region. EOS That sounds great EOS Do you prefer beef steak, pork steak or fish steak? EOS Beef of course EOS I think I prefer Beef, kangaroo, ostrich and fish. I was recently in France and they had Camel and Horse steak but I could not make my self try it. EOS I bet that tsate gppd tpp!", "Knowledge": "Steaks are also cut from grazing animals, usually farmed, other than cattle, including bison, camel, goat, horse, kangaroo, sheep, ostrich, pigs, reindeer, turkey, deer and zebu as well as various types of fish, especially salmon and large pelagic fish such as swordfish, shark and marlin.", "Response": "If you have never tried it, get a kangaroo steak if you have the chance. AMAZING."}
{"Context": "So what do you know about yoga", "Knowledge": "The origins of yoga have been speculated to date back to pre-Vedic Indian traditions; it is mentioned in the Rigveda, but most likely developed around the sixth and fifth centuries BCE, in ancient India's ascetic and śramaṇa movements.", "Response": "Not much, other than it started back in pre-Vedic Indian traditions, and has to do with slow movements.  You?"}
{"Context": "So what do you know about yoga EOS Not much, other than it started back in pre-Vedic Indian traditions, and has to do with slow movements.  You? EOS My sister engages in it. I know it has postures called aasans and you say Om Shanti Shanti. Did you know that?", "Knowledge": "no_passages_used", "Response": "No.  So there are chants that go with it?"}
{"Context": "So what do you know about yoga EOS Not much, other than it started back in pre-Vedic Indian traditions, and has to do with slow movements.  You? EOS My sister engages in it. I know it has postures called aasans and you say Om Shanti Shanti. Did you know that? EOS No.  So there are chants that go with it? EOS Yep its basic Hindi words. Yoga is mostly associated with Hinduism but Jainism is related to it too as well", "Knowledge": "Gregorian chant is the central tradition of Western plainchant, a form of monophonic, unaccompanied sacred song of the Roman Catholic Church.", "Response": "I can't help but think of Gregorian chants.  That would be a little weird though."}
{"Context": "So what do you know about yoga EOS Not much, other than it started back in pre-Vedic Indian traditions, and has to do with slow movements.  You? EOS My sister engages in it. I know it has postures called aasans and you say Om Shanti Shanti. Did you know that? EOS No.  So there are chants that go with it? EOS Yep its basic Hindi words. Yoga is mostly associated with Hinduism but Jainism is related to it too as well EOS I can't help but think of Gregorian chants.  That would be a little weird though. EOS Whats that, never heard of it", "Knowledge": "Gregorian chant is the central tradition of Western plainchant, a form of monophonic, unaccompanied sacred song of the Roman Catholic Church.", "Response": "Well, they are chants that are monophonic, and are part of the Roman Catholic Church."}
{"Context": "So what do you know about yoga EOS Not much, other than it started back in pre-Vedic Indian traditions, and has to do with slow movements.  You? EOS My sister engages in it. I know it has postures called aasans and you say Om Shanti Shanti. Did you know that? EOS No.  So there are chants that go with it? EOS Yep its basic Hindi words. Yoga is mostly associated with Hinduism but Jainism is related to it too as well EOS I can't help but think of Gregorian chants.  That would be a little weird though. EOS Whats that, never heard of it EOS Well, they are chants that are monophonic, and are part of the Roman Catholic Church. EOS so you say that during prayers in church?", "Knowledge": "Medieval music includes solely vocal music, such as Gregorian chant and choral music (music for a group of singers), solely instrumental music, and music that uses both voices and instruments (typically with the instruments accompanying the voices).", "Response": "Well, they were Medieval and sung by monks, so probably not now.  However"}
{"Context": "I always stay up so late.", "Knowledge": "A night owl, evening person or simply owl, is a person who tends to stay up until late at night.", "Response": "Then you might be a night owl! Or a person that stays up late at night"}
{"Context": "I always stay up so late. EOS Then you might be a night owl! Or a person that stays up late at night EOS I am definitely not an early bird. That is for sure!", "Knowledge": "The opposite of a night owl is an early bird, a lark as opposed to owl, someone who tends to begin sleeping at a time that is considered early and also wakes early.", "Response": "Early birds are the opposite of night owls."}
{"Context": "I always stay up so late. EOS Then you might be a night owl! Or a person that stays up late at night EOS I am definitely not an early bird. That is for sure! EOS Early birds are the opposite of night owls. EOS I cannot wake up early no matter what time I go to bed.", "Knowledge": "In several countries, especially in Scandinavia, early birds are called \"A-people\" and night owls are called \"B-people\".", "Response": "You would be called a B-people in Scandinavia"}
{"Context": "I always stay up so late. EOS Then you might be a night owl! Or a person that stays up late at night EOS I am definitely not an early bird. That is for sure! EOS Early birds are the opposite of night owls. EOS I cannot wake up early no matter what time I go to bed. EOS You would be called a B-people in Scandinavia EOS What does that mean?", "Knowledge": "In several countries, especially in Scandinavia, early birds are called \"A-people\" and night owls are called \"B-people\".", "Response": "It means that you are a night owl! That is what they call them"}
{"Context": "I always stay up so late. EOS Then you might be a night owl! Or a person that stays up late at night EOS I am definitely not an early bird. That is for sure! EOS Early birds are the opposite of night owls. EOS I cannot wake up early no matter what time I go to bed. EOS You would be called a B-people in Scandinavia EOS What does that mean? EOS It means that you are a night owl! That is what they call them EOS Oh okay. What do they call early birds?", "Knowledge": "In several countries, especially in Scandinavia, early birds are called \"A-people\" and night owls are called \"B-people\".", "Response": "An A-person. It seems like an interesting thought process in Scandanavia"}
{"Context": "", "Knowledge": "The piano is an acoustic, stringed musical instrument invented in Italy by Bartolomeo Cristofori around the year 1700 (the exact year is uncertain), in which the strings are struck by hammers.", "Response": "I don't play the piano, but I have always wanted to. It's the best acoustic instrument."}
{"Context": "I don't play the piano, but I have always wanted to. It's the best acoustic instrument. EOS I love listening to the piano but cannot play", "Knowledge": "The word \"piano\" is a shortened form of \"pianoforte\", the Italian term for the early 1700s versions of the instrument, which in turn derives from \"gravicembalo col piano e forte\" and \"fortepiano\".", "Response": "I just learned that the piano is shortened from \"pianoforte\" and it's an Italian term!"}
{"Context": "I don't play the piano, but I have always wanted to. It's the best acoustic instrument. EOS I love listening to the piano but cannot play EOS I just learned that the piano is shortened from \"pianoforte\" and it's an Italian term! EOS That is interesting.    Do you have a favorite pianist?", "Knowledge": "Daniel Robert Waitzman (born July 15, 1943) is an American flutist and composer.", "Response": "Kind of, my favorite composer is Daniel Waitzman and he's American."}
{"Context": "I don't play the piano, but I have always wanted to. It's the best acoustic instrument. EOS I love listening to the piano but cannot play EOS I just learned that the piano is shortened from \"pianoforte\" and it's an Italian term! EOS That is interesting.    Do you have a favorite pianist? EOS Kind of, my favorite composer is Daniel Waitzman and he's American. EOS I have never heard of him.  What did he write", "Knowledge": "Schroeder is a fictional character in the long-running comic strip \"Peanuts\", created by Charles M. Schulz.", "Response": "He wrote the Peanuts theme song which is a comic strip."}
{"Context": "I don't play the piano, but I have always wanted to. It's the best acoustic instrument. EOS I love listening to the piano but cannot play EOS I just learned that the piano is shortened from \"pianoforte\" and it's an Italian term! EOS That is interesting.    Do you have a favorite pianist? EOS Kind of, my favorite composer is Daniel Waitzman and he's American. EOS I have never heard of him.  What did he write EOS He wrote the Peanuts theme song which is a comic strip. EOS Oh I love Peanuts!  I did not know he wrote that", "Knowledge": "Charlie Brown is characterized as a person who frequently suffers, and as a result is usually nervous and lacks self-confidence.", "Response": "I love Charlie Brown! He is very nervous and lacks self confidence but he's cute."}
{"Context": "", "Knowledge": "Armadillos are New World placental mammals in the order Cingulata with a leathery armour shell.", "Response": "Have you ever seen an armadillo in real life? I saw one in a zoo last year- they are a new world mammal, but with a tough armoured shell."}
{"Context": "Have you ever seen an armadillo in real life? I saw one in a zoo last year- they are a new world mammal, but with a tough armoured shell. EOS I've seen them in pictures, and they're adorable. Unfortunately I haven't seen one in person.", "Knowledge": "About nine extant genera and 21 extant species of armadillo have been described, some of which are distinguished by the number of bands on their armour.", "Response": "There are about 21 species, and they can be distinguished by the bands on their armour. I saw one in a zoo once!"}
{"Context": "Have you ever seen an armadillo in real life? I saw one in a zoo last year- they are a new world mammal, but with a tough armoured shell. EOS I've seen them in pictures, and they're adorable. Unfortunately I haven't seen one in person. EOS There are about 21 species, and they can be distinguished by the bands on their armour. I saw one in a zoo once! EOS Thats very interesting. What do they eat?", "Knowledge": "The giant armadillo grows up to and weighs up to , while the pink fairy armadillo is a diminutive species, with an overall length of .", "Response": "Well, that's a good question! I'm not sure, but I know there are a variety of sizes, from giant to the tiny pink fairy species."}
{"Context": "Have you ever seen an armadillo in real life? I saw one in a zoo last year- they are a new world mammal, but with a tough armoured shell. EOS I've seen them in pictures, and they're adorable. Unfortunately I haven't seen one in person. EOS There are about 21 species, and they can be distinguished by the bands on their armour. I saw one in a zoo once! EOS Thats very interesting. What do they eat? EOS Well, that's a good question! I'm not sure, but I know there are a variety of sizes, from giant to the tiny pink fairy species. EOS Never knew that before, how big does the giant one get?", "Knowledge": "Pink fairy armadillos have small eyes, silky yellowish white fur, and a flexible dorsal shell that is solely attached to its body by a thin dorsal membrane.", "Response": "The giant armadillos get huge, but the Pink Fairy variety are covered in silky yellowish fur. Cute!"}
{"Context": "", "Knowledge": "A beach is a landform alongside a body of water which consists of loose particles.", "Response": "I like the beach, alongside a body of sand, it is always a fun time"}
{"Context": "I like the beach, alongside a body of sand, it is always a fun time EOS I love the beach and the sound of the waves and the smell of salt water", "Knowledge": "A sea is a large body of salt water that is surrounded in whole or in part by land.", "Response": "a large body of salt water is pretty crazy, that animals live there and thrive"}
{"Context": "I like the beach, alongside a body of sand, it is always a fun time EOS I love the beach and the sound of the waves and the smell of salt water EOS a large body of salt water is pretty crazy, that animals live there and thrive EOS I love the natural beach near my house it has not been developed but left for the wildlife", "Knowledge": "no_passages_used", "Response": "that is awesome, do you prefer it that way?"}
{"Context": "I like the beach, alongside a body of sand, it is always a fun time EOS I love the beach and the sound of the waves and the smell of salt water EOS a large body of salt water is pretty crazy, that animals live there and thrive EOS I love the natural beach near my house it has not been developed but left for the wildlife EOS that is awesome, do you prefer it that way? EOS Yes it seems to be best for the wildlife I see more wildlife on the natural beach as opposed to the defveloped beach", "Knowledge": "Some beaches have man-made infrastructure, such as lifeguard posts, changing rooms, and showers.", "Response": "beaches with man made infrastructure are good as well, it allows for showers and all that"}
{"Context": "", "Knowledge": "Ice cream (derived from earlier iced cream or cream ice) is a sweetened frozen food typically eaten as a snack or dessert.", "Response": "I really like ice cream and have been sad lately. Which means I eat a lot of ice cream because they make me feel better."}
{"Context": "I really like ice cream and have been sad lately. Which means I eat a lot of ice cream because they make me feel better. EOS Yes, I like ice cream too. Especially in this hot weather in the summer. Do you?", "Knowledge": "Bacon ice cream (or bacon-and-egg ice cream) is an ice cream generally created by adding bacon to egg custard and freezing the mixture.", "Response": "I do too. Have you ever heard of bacon ice cream? This is a surprising combination but it's good!"}
{"Context": "I really like ice cream and have been sad lately. Which means I eat a lot of ice cream because they make me feel better. EOS Yes, I like ice cream too. Especially in this hot weather in the summer. Do you? EOS I do too. Have you ever heard of bacon ice cream? This is a surprising combination but it's good! EOS I have heard of it, but never tried it. I like Rocky Road pretty good What's your favorite flavor?", "Knowledge": "Rocky road is a type of dessert made up of milk chocolate and marshmallow which is usually served in individual portions such as a cupcake or brownie, or in American cuisine, as an ice cream flavor..", "Response": "I like a simple Vanilla. Neapolitan is good too."}
{"Context": "I really like ice cream and have been sad lately. Which means I eat a lot of ice cream because they make me feel better. EOS Yes, I like ice cream too. Especially in this hot weather in the summer. Do you? EOS I do too. Have you ever heard of bacon ice cream? This is a surprising combination but it's good! EOS I have heard of it, but never tried it. I like Rocky Road pretty good What's your favorite flavor? EOS I like a simple Vanilla. Neapolitan is good too. EOS Yes, and vanilla is perfect a la mode! Do you like it with pie?", "Knowledge": "Coca-Cola Vanilla (commonly referred to as Vanilla Coke) is a vanilla-flavored version of Coca-Cola, introduced in 2002 but subsequently discontinued in North America and the United Kingdom in 2005, only remaining available as a fountain drink.", "Response": "I do, this is a wonderful combination. Speaking of vanilla it reminds me of vanilla coke, that's a good flavor."}
{"Context": "I love the color purple", "Knowledge": "Purple is a color intermediate between blue and red.", "Response": "Purple is a color intermediate between blue and red and i love it  very much as wellk"}
{"Context": "I love the color purple EOS Purple is a color intermediate between blue and red and i love it  very much as wellk EOS Yes.  I like to buy purple clothing and hats", "Knowledge": "When combined with pink, it is associated with eroticism, femininity and seduction.", "Response": "cool fact,  When combined with pink, it is associated with eroticism, femininity and seduction"}
{"Context": "I love the color purple EOS Purple is a color intermediate between blue and red and i love it  very much as wellk EOS Yes.  I like to buy purple clothing and hats EOS cool fact,  When combined with pink, it is associated with eroticism, femininity and seduction EOS Yes.  I am not a fan of pink though - even thjough I am a girl it is too feminine for me", "Knowledge": "The color pink is named after the flowers, pinks, flowering plants in the genus \"Dianthus,\" and derives from the frilled edge of the flowers.", "Response": "The color pink is named after the flowers, pinks, flowering plants in the genus \"Dianthus,\" but i like pourple better as well"}
{"Context": "I love the color purple EOS Purple is a color intermediate between blue and red and i love it  very much as wellk EOS Yes.  I like to buy purple clothing and hats EOS cool fact,  When combined with pink, it is associated with eroticism, femininity and seduction EOS Yes.  I am not a fan of pink though - even thjough I am a girl it is too feminine for me EOS The color pink is named after the flowers, pinks, flowering plants in the genus \"Dianthus,\" but i like pourple better as well EOS That is interesting.  Where does the name purple come from", "Knowledge": "Purple was the color worn by Roman magistrates; it became the imperial color worn by the rulers of the Byzantine Empire and the Holy Roman Empire, and later by Roman Catholic bishops.", "Response": "Purple was the color worn by Roman magistrates; it became the imperial color worn by the rulers of the Byzantine Empire"}
{"Context": "I love the color purple EOS Purple is a color intermediate between blue and red and i love it  very much as wellk EOS Yes.  I like to buy purple clothing and hats EOS cool fact,  When combined with pink, it is associated with eroticism, femininity and seduction EOS Yes.  I am not a fan of pink though - even thjough I am a girl it is too feminine for me EOS The color pink is named after the flowers, pinks, flowering plants in the genus \"Dianthus,\" but i like pourple better as well EOS That is interesting.  Where does the name purple come from EOS Purple was the color worn by Roman magistrates; it became the imperial color worn by the rulers of the Byzantine Empire EOS Yes I do remember it was the color of royalty", "Knowledge": "Similarly in Japan, the color is traditionally associated with the Emperor and aristocracy.", "Response": "Similarly in Japan, the color purple is used in royalty as well"}
{"Context": "", "Knowledge": "The electronic systems used to play video games are known as platforms; examples of these are personal computers and video game consoles.", "Response": "I love video games.  The platform I play on is PS4."}
{"Context": "I love video games.  The platform I play on is PS4. EOS Back in my day, I played Nintendo 64 platform, and loved it.  I haven't played any of the new platforms, but my son does. It is so much more realistic!", "Knowledge": "It was the last major home console to use the cartridge as its primary storage format until Nintendo's seventh console, the Nintendo Switch, released in 2017.", "Response": "I remember the 64.  That was the last console to use cartridges.  I first began playing on an Atari, lol."}
{"Context": "I love video games.  The platform I play on is PS4. EOS Back in my day, I played Nintendo 64 platform, and loved it.  I haven't played any of the new platforms, but my son does. It is so much more realistic! EOS I remember the 64.  That was the last console to use cartridges.  I first began playing on an Atari, lol. EOS ha!  I played pong!  Can people on PS4 play with people on Xbox One?", "Knowledge": "", "Response": "Pong! I played Pong as well.  Cross platform play is still restricted between PS and Xbox.  We have both."}
{"Context": "I love video games.  The platform I play on is PS4. EOS Back in my day, I played Nintendo 64 platform, and loved it.  I haven't played any of the new platforms, but my son does. It is so much more realistic! EOS I remember the 64.  That was the last console to use cartridges.  I first began playing on an Atari, lol. EOS ha!  I played pong!  Can people on PS4 play with people on Xbox One? EOS Pong! I played Pong as well.  Cross platform play is still restricted between PS and Xbox.  We have both. EOS I really wish cross platform play was a thing.  But I guess they each want to sell their own system.", "Knowledge": "In video games, cross-platform play or cross-play is a term used to describe the ability of a video game with an online gaming component that allows players using different video game hardware to play with each other simultaneously.", "Response": "Yes, I suppose.  It is coming though.  We play Fortnite, my son and I, and I'll use my laptop to cross platform with him that way."}
{"Context": "I love video games.  The platform I play on is PS4. EOS Back in my day, I played Nintendo 64 platform, and loved it.  I haven't played any of the new platforms, but my son does. It is so much more realistic! EOS I remember the 64.  That was the last console to use cartridges.  I first began playing on an Atari, lol. EOS ha!  I played pong!  Can people on PS4 play with people on Xbox One? EOS Pong! I played Pong as well.  Cross platform play is still restricted between PS and Xbox.  We have both. EOS I really wish cross platform play was a thing.  But I guess they each want to sell their own system. EOS Yes, I suppose.  It is coming though.  We play Fortnite, my son and I, and I'll use my laptop to cross platform with him that way. EOS Oh my son is ADDICTED to Fortnite.  I'm a teacher, and it's a battle to keep kids off of it during class, too! That game is the bane of my existence!", "Knowledge": "no_passages_used", "Response": "I love it, but I am terrible at it.  It is a battle keeping my son off of it constantly, as well."}
{"Context": "I really love country music. Are you a country music fan?", "Knowledge": "Country (or country and western) is a musical genre that originated in the southern United States in the early 1920s.", "Response": "I am not that much of a country music fan. Do you recommend any artists to introduce me to this Southern United States staple?"}
{"Context": "I really love country music. Are you a country music fan? EOS I am not that much of a country music fan. Do you recommend any artists to introduce me to this Southern United States staple? EOS Yes, I would highly recommend Blake Shelton or Shania Twain. They are both very talented.", "Knowledge": "Shania Twain, OC (; born Eilleen Regina Edwards; August 28, 1965) is a Canadian singer and songwriter.", "Response": "Ooh I like them both. I am familiar with Shania Twain. It is interesting that she is actually a Canadian singer, not from the US."}
{"Context": "I really love country music. Are you a country music fan? EOS I am not that much of a country music fan. Do you recommend any artists to introduce me to this Southern United States staple? EOS Yes, I would highly recommend Blake Shelton or Shania Twain. They are both very talented. EOS Ooh I like them both. I am familiar with Shania Twain. It is interesting that she is actually a Canadian singer, not from the US. EOS You're right, she is. I was actually not a fan of Country up until recently when a friend played some songs for me. Do you like Faith Hill at all? She's a good one too.", "Knowledge": "Hill is married to American singer Tim McGraw, with whom she has recorded several duets.", "Response": "I like what I have heard from Faith Hill and her hubby Tim McGraw. I like that they record music together."}
{"Context": "I really love country music. Are you a country music fan? EOS I am not that much of a country music fan. Do you recommend any artists to introduce me to this Southern United States staple? EOS Yes, I would highly recommend Blake Shelton or Shania Twain. They are both very talented. EOS Ooh I like them both. I am familiar with Shania Twain. It is interesting that she is actually a Canadian singer, not from the US. EOS You're right, she is. I was actually not a fan of Country up until recently when a friend played some songs for me. Do you like Faith Hill at all? She's a good one too. EOS I like what I have heard from Faith Hill and her hubby Tim McGraw. I like that they record music together. EOS Same. Country music is fun to listen to.", "Knowledge": "Bolstered by the huge crossover success of the singles \"Jesus, Take the Wheel\" and \"Before He Cheats\", it became the best-selling solo female debut album in country music history, the fastest-selling debut country album in Nielsen SoundScan history and the best-selling country album of the last 14 years.", "Response": "I like Carrie Underwood, too. The song \"Jesus, Take the Wheel\" was so catchy to me."}
{"Context": "i love to play real football AKA soccer!", "Knowledge": "It is played by 250 million players in over 200 countries and dependencies, making it the world's most popular sport.", "Response": "It is funny that we have to qualify it as soccer since it is played by 250 million people in over 200 countries."}
{"Context": "i love to play real football AKA soccer! EOS It is funny that we have to qualify it as soccer since it is played by 250 million people in over 200 countries. EOS thats true, who is the top football player in the world?", "Knowledge": "Often considered the best player in the world and widely regarded as one of the greatest of all time, Ronaldo has five Ballon d'Or awards, the most for a European player and is tied for most all-time.", "Response": "It does depend on how you define top but. Cristiano Ronaldo is often considered the best in the world, and maybe one of the best of all time."}
{"Context": "i love to play real football AKA soccer! EOS It is funny that we have to qualify it as soccer since it is played by 250 million people in over 200 countries. EOS thats true, who is the top football player in the world? EOS It does depend on how you define top but. Cristiano Ronaldo is often considered the best in the world, and maybe one of the best of all time. EOS Yea I think he along with Messi are the best right now.  Where is the best soccer played right now ?", "Knowledge": "no_passages_used", "Response": "Lionel Messi is definitely also considered one of the best. It definitely seems like the best soccer is done in South America."}
{"Context": "i love to play real football AKA soccer! EOS It is funny that we have to qualify it as soccer since it is played by 250 million people in over 200 countries. EOS thats true, who is the top football player in the world? EOS It does depend on how you define top but. Cristiano Ronaldo is often considered the best in the world, and maybe one of the best of all time. EOS Yea I think he along with Messi are the best right now.  Where is the best soccer played right now ? EOS Lionel Messi is definitely also considered one of the best. It definitely seems like the best soccer is done in South America. EOS how big are the fields ?", "Knowledge": "no_passages_used", "Response": "It depends whether it is an international match or not. Some of the fields are tightly constrained, others are not."}
{"Context": "i love to play real football AKA soccer! EOS It is funny that we have to qualify it as soccer since it is played by 250 million people in over 200 countries. EOS thats true, who is the top football player in the world? EOS It does depend on how you define top but. Cristiano Ronaldo is often considered the best in the world, and maybe one of the best of all time. EOS Yea I think he along with Messi are the best right now.  Where is the best soccer played right now ? EOS Lionel Messi is definitely also considered one of the best. It definitely seems like the best soccer is done in South America. EOS how big are the fields ? EOS It depends whether it is an international match or not. Some of the fields are tightly constrained, others are not. EOS i can see why they would be different. didnt think about that", "Knowledge": "no_passages_used", "Response": "Definitely. It all over a very interesting sport."}
{"Context": "Hi, do you by any chance like to draw?", "Knowledge": "Temporary drawings may be made on a blackboard or whiteboard or indeed almost anything.", "Response": "I will doodle a bit, making temporary drawings on the whiteboard in my office, but I'm not a very good artist. What about you?"}
{"Context": "Hi, do you by any chance like to draw? EOS I will doodle a bit, making temporary drawings on the whiteboard in my office, but I'm not a very good artist. What about you? EOS Same thing here, i like to draw to take my mind off things, but i couldn't do a portrait or something like that", "Knowledge": "Magna Doodle is a magnetic drawing toy, consisting of a drawing board, a magnetic stylus, and a few magnet shapes.", "Response": "When you were a kid did you ever play with that drawing toy Magna Doodle?"}
{"Context": "Hi, do you by any chance like to draw? EOS I will doodle a bit, making temporary drawings on the whiteboard in my office, but I'm not a very good artist. What about you? EOS Same thing here, i like to draw to take my mind off things, but i couldn't do a portrait or something like that EOS When you were a kid did you ever play with that drawing toy Magna Doodle? EOS I might, it sounds familiar, how does it work?", "Knowledge": "Magna Doodle is a magnetic drawing toy, consisting of a drawing board, a magnetic stylus, and a few magnet shapes.", "Response": "Magna Doodle had a drawing board that had magnetic particles inside it, and you would use a magnetic stylus to move them around and make designs and things.."}
{"Context": "Hi, do you by any chance like to draw? EOS I will doodle a bit, making temporary drawings on the whiteboard in my office, but I'm not a very good artist. What about you? EOS Same thing here, i like to draw to take my mind off things, but i couldn't do a portrait or something like that EOS When you were a kid did you ever play with that drawing toy Magna Doodle? EOS I might, it sounds familiar, how does it work? EOS Magna Doodle had a drawing board that had magnetic particles inside it, and you would use a magnetic stylus to move them around and make designs and things.. EOS Ah yes, i did have one of those, i was never good at it though, and you? I bet you were great at it?", "Knowledge": "no_passages_used", "Response": "No, I wasn't great at it, I just liked messing around with it. Remember Etch-A-Sketch? My friend was amazing at that."}
{"Context": "Hi, do you by any chance like to draw? EOS I will doodle a bit, making temporary drawings on the whiteboard in my office, but I'm not a very good artist. What about you? EOS Same thing here, i like to draw to take my mind off things, but i couldn't do a portrait or something like that EOS When you were a kid did you ever play with that drawing toy Magna Doodle? EOS I might, it sounds familiar, how does it work? EOS Magna Doodle had a drawing board that had magnetic particles inside it, and you would use a magnetic stylus to move them around and make designs and things.. EOS Ah yes, i did have one of those, i was never good at it though, and you? I bet you were great at it? EOS No, I wasn't great at it, I just liked messing around with it. Remember Etch-A-Sketch? My friend was amazing at that. EOS Etch-A-Sketch worked on a different principle though right? There was no magnetism involved?", "Knowledge": "Twisting the knobs moves a stylus that displaces aluminum powder on the back of the screen, leaving a solid line.", "Response": "Right, that one had knobs that would move a stylus behind a screen. The stylus would displace aluminum powder."}
{"Context": "Honda Civics are pretty plain looking, but they are also really reliable and popular cars right?", "Knowledge": "Originally a subcompact, the Civic has gone through several generational changes, becoming both larger and more upmarket and moving into the compact car segment.", "Response": "Sure, the Honda Civic was originally a subcompact but is now larger and considered compact."}
{"Context": "Honda Civics are pretty plain looking, but they are also really reliable and popular cars right? EOS Sure, the Honda Civic was originally a subcompact but is now larger and considered compact. EOS I didn't really know there was subcategories like that, but cool!", "Knowledge": "EPA guidelines for vehicle size class stipulate a car having combined passenger and cargo room of is considered a mid-size car, and as such the tenth generation Civic sedan is technically a small-end mid-size car, although it still competes in the compact class.", "Response": "Yeah, the tenth generation Civic is technically a mid-size car but it competes in the compact class."}
{"Context": "Honda Civics are pretty plain looking, but they are also really reliable and popular cars right? EOS Sure, the Honda Civic was originally a subcompact but is now larger and considered compact. EOS I didn't really know there was subcategories like that, but cool! EOS Yeah, the tenth generation Civic is technically a mid-size car but it competes in the compact class. EOS I had no idea! Are there different types of Civics or just one?", "Knowledge": "Initially gaining a reputation for being fuel-efficient, reliable, and environmentally friendly, later iterations have become known for performance and sportiness, especially the Civic Type R, Civic VTi, Civic GTi and Civic SiR/Si.", "Response": "The Civic Type R is a turbocharged version."}
{"Context": "Honda Civics are pretty plain looking, but they are also really reliable and popular cars right? EOS Sure, the Honda Civic was originally a subcompact but is now larger and considered compact. EOS I didn't really know there was subcategories like that, but cool! EOS Yeah, the tenth generation Civic is technically a mid-size car but it competes in the compact class. EOS I had no idea! Are there different types of Civics or just one? EOS The Civic Type R is a turbocharged version. EOS What's the difference between the turbocharged and normal one?", "Knowledge": "It features a lightened and stiffened body, specially tuned engine and upgraded brakes and chassis.", "Response": "Type R has a lightened body, specially tuned engine, upgraded chassis and brakes."}
{"Context": "Honda Civics are pretty plain looking, but they are also really reliable and popular cars right? EOS Sure, the Honda Civic was originally a subcompact but is now larger and considered compact. EOS I didn't really know there was subcategories like that, but cool! EOS Yeah, the tenth generation Civic is technically a mid-size car but it competes in the compact class. EOS I had no idea! Are there different types of Civics or just one? EOS The Civic Type R is a turbocharged version. EOS What's the difference between the turbocharged and normal one? EOS Type R has a lightened body, specially tuned engine, upgraded chassis and brakes. EOS Wow, so these changes were all made for the sake of making it faster?", "Knowledge": "In Japan, there is a one-make series of Honda Type R cars where a privateer can purchase an off-road Type R and compete in a series championship, which is a stepping stone for many aspiring racing drivers.", "Response": "Yes, for the high performance enthusiasts. In Japan there is an off-roal Type R racing league."}
{"Context": "", "Knowledge": "A hamburger, beefburger or burger is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced bread roll or bun.", "Response": "HAMBURGER IS A SANDWICH"}
{"Context": "HAMBURGER IS A SANDWICH EOS Wow I never knew that before!", "Knowledge": "A hamburger, beefburger or burger is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced bread roll or bun.", "Response": "IS IT! IN CONSIST OF ONE OR MORE COOKED PATTIES OF GROUND MEAT, BEEF, SLICED BREAD ROLL"}
{"Context": "HAMBURGER IS A SANDWICH EOS Wow I never knew that before! EOS IS IT! IN CONSIST OF ONE OR MORE COOKED PATTIES OF GROUND MEAT, BEEF, SLICED BREAD ROLL EOS Oh cool! How can burgers be prepared?", "Knowledge": "Hamburgers are often served with cheese, lettuce, tomato, bacon, onion, pickles, or chiles; condiments such as mustard, mayonnaise, ketchup, relish, or \"special sauce\"; and are frequently placed on sesame seed buns.", "Response": "ITS PREPARED BY CHEESE, LETTUCE, TOMATO, BACON"}
{"Context": "HAMBURGER IS A SANDWICH EOS Wow I never knew that before! EOS IS IT! IN CONSIST OF ONE OR MORE COOKED PATTIES OF GROUND MEAT, BEEF, SLICED BREAD ROLL EOS Oh cool! How can burgers be prepared? EOS ITS PREPARED BY CHEESE, LETTUCE, TOMATO, BACON EOS Oh wow that's crazy! Those are some of my favorite burger toppings.", "Knowledge": "A hamburger topped with cheese is called a cheeseburger.", "Response": "A HAMBURGER TOPPED WITH CHEESE IS CALLED A CHEESEBURGER"}
{"Context": "HAMBURGER IS A SANDWICH EOS Wow I never knew that before! EOS IS IT! IN CONSIST OF ONE OR MORE COOKED PATTIES OF GROUND MEAT, BEEF, SLICED BREAD ROLL EOS Oh cool! How can burgers be prepared? EOS ITS PREPARED BY CHEESE, LETTUCE, TOMATO, BACON EOS Oh wow that's crazy! Those are some of my favorite burger toppings. EOS A HAMBURGER TOPPED WITH CHEESE IS CALLED A CHEESEBURGER EOS That makes sense! You know so much about burgers.", "Knowledge": "The term \"hamburger\" originally derives from Hamburg, Germany's second-largest city.", "Response": "THE TERM HAMBURGER ORIGINALLY DERIVES FROM HAMBURG. GERMANY SECOND LARGEST CITY"}
{"Context": "", "Knowledge": "Skateboarding is an action sport which involves riding and performing tricks using a skateboard.", "Response": "Ireally into skateboarding when I was young. I used to love the action sport and performing tricks on my skateboard."}
{"Context": "Ireally into skateboarding when I was young. I used to love the action sport and performing tricks on my skateboard. EOS I tried skateboarding once.  I broke my arm.", "Knowledge": "Skateboarding can also be considered a recreational activity, an art form, a job, or a method of transportation.", "Response": "Oh no. I can be pretty harsh when you fall. Some people are skateboarding for transportation, a job, or just recreational. Its a hard sport to master."}
{"Context": "Ireally into skateboarding when I was young. I used to love the action sport and performing tricks on my skateboard. EOS I tried skateboarding once.  I broke my arm. EOS Oh no. I can be pretty harsh when you fall. Some people are skateboarding for transportation, a job, or just recreational. Its a hard sport to master. EOS Thats cool that it serves multiple purposes.  After that, I just stuck to skateboarding video games", "Knowledge": "In 2016, it was announced that skateboarding will be represented at the 2020 Olympic Games in Tokyo, Japan.", "Response": "Some are so much fun. I wish we would get EA Skate 4. They announced in 2014 that skateboarding will be present in the Olympics."}
{"Context": "Ireally into skateboarding when I was young. I used to love the action sport and performing tricks on my skateboard. EOS I tried skateboarding once.  I broke my arm. EOS Oh no. I can be pretty harsh when you fall. Some people are skateboarding for transportation, a job, or just recreational. Its a hard sport to master. EOS Thats cool that it serves multiple purposes.  After that, I just stuck to skateboarding video games EOS Some are so much fun. I wish we would get EA Skate 4. They announced in 2014 that skateboarding will be present in the Olympics. EOS I used to play Tony Hawk Pro Skater.  That would make sense to have skateboarding in the olympics, since snowboarding is there", "Knowledge": "A 2009 report found that the skateboarding market is worth an estimated $4.8 billion in annual revenue with 11.08 million active skateboarders in the world.", "Response": "Oh that is true. There are over 11 million people skateboarding actively in the world now. The market is worth around $4.8 billion a year. Makes sense that it should be in the Olympics."}
{"Context": "Hi Can you tell me a little about basketball?", "Knowledge": "The objective is to shoot a ball through a hoop in diameter and high that is mounted to a backboard at each end of the court.", "Response": "The objective to basketball is to shoot a ball through a hoop that is mounted high on a backboard at the end of a court."}
{"Context": "Hi Can you tell me a little about basketball? EOS The objective to basketball is to shoot a ball through a hoop that is mounted high on a backboard at the end of a court. EOS Interesting! when did this game start?", "Knowledge": "The game was invented in 1891 by Dr. James Naismith.", "Response": "The game was invented around 1891.  It has been around a while!"}
{"Context": "Hi Can you tell me a little about basketball? EOS The objective to basketball is to shoot a ball through a hoop that is mounted high on a backboard at the end of a court. EOS Interesting! when did this game start? EOS The game was invented around 1891.  It has been around a while! EOS That's a long time! Has the game changed over time?", "Knowledge": "A team can also score via free throws, which are worth one point, after the other team is assessed with certain fouls.", "Response": "Not quite sure.  I think the free throws have always been involved.  A team can score one point with a free throw after another team is fouled."}
{"Context": "Hi Can you tell me a little about basketball? EOS The objective to basketball is to shoot a ball through a hoop that is mounted high on a backboard at the end of a court. EOS Interesting! when did this game start? EOS The game was invented around 1891.  It has been around a while! EOS That's a long time! Has the game changed over time? EOS Not quite sure.  I think the free throws have always been involved.  A team can score one point with a free throw after another team is fouled. EOS Oh i see. Anything else cool about it?", "Knowledge": "In the NBA, most players make 70–80% of their attempts.", "Response": "In the NBA, most players make about 70-80% of their free throw attempts."}
{"Context": "Hi Can you tell me a little about basketball? EOS The objective to basketball is to shoot a ball through a hoop that is mounted high on a backboard at the end of a court. EOS Interesting! when did this game start? EOS The game was invented around 1891.  It has been around a while! EOS That's a long time! Has the game changed over time? EOS Not quite sure.  I think the free throws have always been involved.  A team can score one point with a free throw after another team is fouled. EOS Oh i see. Anything else cool about it? EOS In the NBA, most players make about 70-80% of their free throw attempts. EOS I bet shack doesnt lol. That is pretty good odds though", "Knowledge": "The league's best shooters (such as Steve Nash, Rick Barry, Ray Allen, José Calderón, Stephen Curry, Reggie Miller, Kevin Durant, and Dirk Nowitzki) can make roughly 90% of their attempts over a season, while notoriously poor shooters (e.g.", "Response": "Probably not, ha.  Reggie Miller is one of the league's best shooters."}
{"Context": "hey! I'm not an only child, I have 3 siblings, but I've always wondered about only children and why they're so weird??", "Knowledge": "An only child is a person with no siblings, either biological or adopted.", "Response": "An only child has no siblings; therefore, I think they learn how to socialize in different ways."}
{"Context": "hey! I'm not an only child, I have 3 siblings, but I've always wondered about only children and why they're so weird?? EOS An only child has no siblings; therefore, I think they learn how to socialize in different ways. EOS I had a friend who was an only child and he was very shy and kept to himself a lot. Are there any advantages to being an only child?", "Knowledge": "no_passages_used", "Response": "I mean I guess they get a lot of attention from their parents. The term only applies to people that never had a sibling."}
{"Context": "hey! I'm not an only child, I have 3 siblings, but I've always wondered about only children and why they're so weird?? EOS An only child has no siblings; therefore, I think they learn how to socialize in different ways. EOS I had a friend who was an only child and he was very shy and kept to himself a lot. Are there any advantages to being an only child? EOS I mean I guess they get a lot of attention from their parents. The term only applies to people that never had a sibling. EOS Yeah I know. Is there any research that says that only children are more likely to grow up to be criminals or anything like that?", "Knowledge": "The proportion of families in the U.S. with only children increased during the Great Depression but fell during the Post–World War II baby boom.", "Response": "I'm not so sure. But I do know that the proportion of families with only children increased during the Great depression, naturally."}
{"Context": "hey! I'm not an only child, I have 3 siblings, but I've always wondered about only children and why they're so weird?? EOS An only child has no siblings; therefore, I think they learn how to socialize in different ways. EOS I had a friend who was an only child and he was very shy and kept to himself a lot. Are there any advantages to being an only child? EOS I mean I guess they get a lot of attention from their parents. The term only applies to people that never had a sibling. EOS Yeah I know. Is there any research that says that only children are more likely to grow up to be criminals or anything like that? EOS I'm not so sure. But I do know that the proportion of families with only children increased during the Great depression, naturally. EOS Right, because all the babies died? is that what the great depression was about?", "Knowledge": "It was the longest, deepest, and most widespread depression of the 20th century.", "Response": "A lot of people died due to financial hard times. It was the longest and most widespread financial depression in American history."}
{"Context": "hey! I'm not an only child, I have 3 siblings, but I've always wondered about only children and why they're so weird?? EOS An only child has no siblings; therefore, I think they learn how to socialize in different ways. EOS I had a friend who was an only child and he was very shy and kept to himself a lot. Are there any advantages to being an only child? EOS I mean I guess they get a lot of attention from their parents. The term only applies to people that never had a sibling. EOS Yeah I know. Is there any research that says that only children are more likely to grow up to be criminals or anything like that? EOS I'm not so sure. But I do know that the proportion of families with only children increased during the Great depression, naturally. EOS Right, because all the babies died? is that what the great depression was about? EOS A lot of people died due to financial hard times. It was the longest and most widespread financial depression in American history. EOS whoa, sounds intense. that was just a few years ago right?", "Knowledge": "Specialized business history is covered in American business history.", "Response": "No, it occurred a long time ago. American business history can be insightful sometimes."}
{"Context": "hi do you play tennis?", "Knowledge": "Tennis is a racket sport that can be played individually against a single opponent (singles) or between two teams of two players each (doubles).", "Response": "Yes! I love tennis. Both of my daughters were competitive junior players. I love that you can play individually or on a doubles team. Do you play?"}
{"Context": "hi do you play tennis? EOS Yes! I love tennis. Both of my daughters were competitive junior players. I love that you can play individually or on a doubles team. Do you play? EOS oh wow thats really cool. i play every so often with friends at the park, but i have never played competitively", "Knowledge": "The sport can be played by anyone who can hold a racket, including wheelchair users.", "Response": "Tennis is for everyone! I love that anyone who can hold a racket can play and that includes individuals in wheelchairs. Do you play singles or doubles?"}
{"Context": "hi do you play tennis? EOS Yes! I love tennis. Both of my daughters were competitive junior players. I love that you can play individually or on a doubles team. Do you play? EOS oh wow thats really cool. i play every so often with friends at the park, but i have never played competitively EOS Tennis is for everyone! I love that anyone who can hold a racket can play and that includes individuals in wheelchairs. Do you play singles or doubles? EOS i would mostly just play with however many friends we had that day. usually just 1v1", "Knowledge": "The rules of modern tennis have changed little since the 1890s.", "Response": "I love singles as well. I find it fascinating that the rules of tennis are basically the same as they were since 1890 with no change at all!"}
{"Context": "hi do you play tennis? EOS Yes! I love tennis. Both of my daughters were competitive junior players. I love that you can play individually or on a doubles team. Do you play? EOS oh wow thats really cool. i play every so often with friends at the park, but i have never played competitively EOS Tennis is for everyone! I love that anyone who can hold a racket can play and that includes individuals in wheelchairs. Do you play singles or doubles? EOS i would mostly just play with however many friends we had that day. usually just 1v1 EOS I love singles as well. I find it fascinating that the rules of tennis are basically the same as they were since 1890 with no change at all! EOS if its not broken, dont fix it !", "Knowledge": "no_passages_used", "Response": "That's the truth! Do you have a favorite professional tennis player?"}
{"Context": "hi do you play tennis? EOS Yes! I love tennis. Both of my daughters were competitive junior players. I love that you can play individually or on a doubles team. Do you play? EOS oh wow thats really cool. i play every so often with friends at the park, but i have never played competitively EOS Tennis is for everyone! I love that anyone who can hold a racket can play and that includes individuals in wheelchairs. Do you play singles or doubles? EOS i would mostly just play with however many friends we had that day. usually just 1v1 EOS I love singles as well. I find it fascinating that the rules of tennis are basically the same as they were since 1890 with no change at all! EOS if its not broken, dont fix it ! EOS That's the truth! Do you have a favorite professional tennis player? EOS i always thought john macenroe was funny. im sure i spelled that wrong", "Knowledge": "no_passages_used", "Response": "I loved him too! He was a mess with that crazy hair and his crazy antics. He was a legend!"}
{"Context": "I have been thinking of getting a tattoo . Can you tell me more about this so I can make a decision?", "Knowledge": "A tattoo is a form of body modification where a design is made by inserting ink, dyes and pigments, either indelible or temporary, into the dermis layer of the skin to change the pigment.", "Response": "Body modifications designed on bodies are tattoos"}
{"Context": "I have been thinking of getting a tattoo . Can you tell me more about this so I can make a decision? EOS Body modifications designed on bodies are tattoos EOS I see. Do you have any tattoos or do you dislike them?", "Knowledge": "A tattoo is a form of body modification where a design is made by inserting ink, dyes and pigments, either indelible or temporary, into the dermis layer of the skin to change the pigment.", "Response": "I don't have a tattoo because most tattoos are either termporary or permanent but are introduced on the skin as pigments"}
{"Context": "I have been thinking of getting a tattoo . Can you tell me more about this so I can make a decision? EOS Body modifications designed on bodies are tattoos EOS I see. Do you have any tattoos or do you dislike them? EOS I don't have a tattoo because most tattoos are either termporary or permanent but are introduced on the skin as pigments EOS Understandable, I am scared that permanent tattoos might be regretted later! What exactly are skin pigments?", "Knowledge": "A tattoo is a form of body modification where a design is made by inserting ink, dyes and pigments, either indelible or temporary, into the dermis layer of the skin to change the pigment.", "Response": "The tattoo artist use inks and dyes. They are inserted into the dermis layer of the human skin"}
{"Context": "I have been thinking of getting a tattoo . Can you tell me more about this so I can make a decision? EOS Body modifications designed on bodies are tattoos EOS I see. Do you have any tattoos or do you dislike them? EOS I don't have a tattoo because most tattoos are either termporary or permanent but are introduced on the skin as pigments EOS Understandable, I am scared that permanent tattoos might be regretted later! What exactly are skin pigments? EOS The tattoo artist use inks and dyes. They are inserted into the dermis layer of the human skin EOS Interesting, it might be painful right?", "Knowledge": "", "Response": "No. the process of inserting the tattoo into the skin is not painful but it causes irritation to the area that has the tattos"}
{"Context": "I have been thinking of getting a tattoo . Can you tell me more about this so I can make a decision? EOS Body modifications designed on bodies are tattoos EOS I see. Do you have any tattoos or do you dislike them? EOS I don't have a tattoo because most tattoos are either termporary or permanent but are introduced on the skin as pigments EOS Understandable, I am scared that permanent tattoos might be regretted later! What exactly are skin pigments? EOS The tattoo artist use inks and dyes. They are inserted into the dermis layer of the human skin EOS Interesting, it might be painful right? EOS No. the process of inserting the tattoo into the skin is not painful but it causes irritation to the area that has the tattos EOS Thats reassuring! I hopefully will get one on my back. I will get a tattoo of a horse.", "Knowledge": "A tattoo is a form of body modification where a design is made by inserting ink, dyes and pigments, either indelible or temporary, into the dermis layer of the skin to change the pigment.", "Response": "Really. I guess that tattoo will look cool on you. But I don't like tattoos"}
{"Context": "", "Knowledge": "A lawyer is a person who practices law, as a paralegal, advocate, barrister, attorney, counselor, solicitor, or chartered legal executive.", "Response": "I just got a new job at a new law firm. I'm a lawyer, an attorney."}
{"Context": "I just got a new job at a new law firm. I'm a lawyer, an attorney. EOS That's good,congrats", "Knowledge": "The primary service rendered by a law firm is to advise clients (individuals or corporations) about their legal rights and responsibilities, and to represent clients in civil or criminal cases, business transactions, and other matters in which legal advice and other assistance are sought.", "Response": "Yeah, thanks. I used to do criminal defense but was lucky that I got to switch to civil matters. I got sick of defending guilty people."}
{"Context": "I just got a new job at a new law firm. I'm a lawyer, an attorney. EOS That's good,congrats EOS Yeah, thanks. I used to do criminal defense but was lucky that I got to switch to civil matters. I got sick of defending guilty people. EOS OK ! What's the duration?", "Knowledge": "no_passages_used", "Response": "I worked on criminal cases for about 10 years."}
{"Context": "I just got a new job at a new law firm. I'm a lawyer, an attorney. EOS That's good,congrats EOS Yeah, thanks. I used to do criminal defense but was lucky that I got to switch to civil matters. I got sick of defending guilty people. EOS OK ! What's the duration? EOS I worked on criminal cases for about 10 years. EOS What's institution did you attend?", "Knowledge": "no_passages_used", "Response": "Just the University of Maryland. I didn't go to Yale or anything."}
{"Context": "I personally have a drink every so often, but I make sure not to let it get out of hand because I've what alcoholism can do to a person.", "Knowledge": "Alcoholism, also known as alcohol use disorder (AUD), is a broad term for any drinking of alcohol that results in mental or physical health problems.", "Response": "That's a wise decision. Alcoholism is a term for drinking excessively and causes mental and physical health problems."}
{"Context": "I personally have a drink every so often, but I make sure not to let it get out of hand because I've what alcoholism can do to a person. EOS That's a wise decision. Alcoholism is a term for drinking excessively and causes mental and physical health problems. EOS So can the alcohol itself cause any physical or mental issues that are unique to purely alcoholism compared to, say, addiction to heroin or other drugs?", "Knowledge": "Alcohol use can affect all parts of the body, but it particularly affects the brain, heart, liver, pancreas, and immune system.", "Response": "Yes, alcohol particularly affects the brain, heart, liver, and pancreas. The first organ that is typically damaged is the liver."}
{"Context": "I personally have a drink every so often, but I make sure not to let it get out of hand because I've what alcoholism can do to a person. EOS That's a wise decision. Alcoholism is a term for drinking excessively and causes mental and physical health problems. EOS So can the alcohol itself cause any physical or mental issues that are unique to purely alcoholism compared to, say, addiction to heroin or other drugs? EOS Yes, alcohol particularly affects the brain, heart, liver, and pancreas. The first organ that is typically damaged is the liver. EOS I figured, since the liver is what breaks the alcohol down, correct?", "Knowledge": "Alcoholic liver disease is a term that encompasses the liver manifestations of alcohol overconsumption, including fatty liver, alcoholic hepatitis, and chronic hepatitis with liver fibrosis or cirrhosis.", "Response": "Correct. Alcohol liver disease is often due to overconsumption. This could manifest as fatty liver, hepatitis, fibrosis, or cirrhosis."}
{"Context": "I personally have a drink every so often, but I make sure not to let it get out of hand because I've what alcoholism can do to a person. EOS That's a wise decision. Alcoholism is a term for drinking excessively and causes mental and physical health problems. EOS So can the alcohol itself cause any physical or mental issues that are unique to purely alcoholism compared to, say, addiction to heroin or other drugs? EOS Yes, alcohol particularly affects the brain, heart, liver, and pancreas. The first organ that is typically damaged is the liver. EOS I figured, since the liver is what breaks the alcohol down, correct? EOS Correct. Alcohol liver disease is often due to overconsumption. This could manifest as fatty liver, hepatitis, fibrosis, or cirrhosis. EOS That's interesting that it can manifest in different ways. What does this manifestation depend on, if you know?", "Knowledge": "Although steatosis (fatty liver) will develop in any individual who consumes a large quantity of alcoholic beverages over a long period of time, this process is transient and reversible.", "Response": "Fatty liver is reversible if treated in time. The other conditions are more serious. It really depends on the health of the person drinking as to what conditions they get."}
{"Context": "I personally have a drink every so often, but I make sure not to let it get out of hand because I've what alcoholism can do to a person. EOS That's a wise decision. Alcoholism is a term for drinking excessively and causes mental and physical health problems. EOS So can the alcohol itself cause any physical or mental issues that are unique to purely alcoholism compared to, say, addiction to heroin or other drugs? EOS Yes, alcohol particularly affects the brain, heart, liver, and pancreas. The first organ that is typically damaged is the liver. EOS I figured, since the liver is what breaks the alcohol down, correct? EOS Correct. Alcohol liver disease is often due to overconsumption. This could manifest as fatty liver, hepatitis, fibrosis, or cirrhosis. EOS That's interesting that it can manifest in different ways. What does this manifestation depend on, if you know? EOS Fatty liver is reversible if treated in time. The other conditions are more serious. It really depends on the health of the person drinking as to what conditions they get. EOS I know a little bit about fatty liver because my brother had it, but not due to alcohol. How else can alcohol impact a person?", "Knowledge": "This can result in mental illness, Wernicke–Korsakoff syndrome, an irregular heartbeat, cirrhosis of the liver, and an increase in the risk of cancer, among other diseases.", "Response": "Alcoholism can also lead to mental illness. Frequent overconsumption can cause brain damage."}
{"Context": "I'm not a fan of snakes. How about you?", "Knowledge": "Legless lizards resemble snakes, but several common groups of legless lizards have eyelids and external ears, which snakes lack, although this rule is not universal (see Amphisbaenia, Dibamidae, and Pygopodidae).", "Response": "I love snakes! I recently learned that they are distantly related to lizards!"}
{"Context": "I'm not a fan of snakes. How about you? EOS I love snakes! I recently learned that they are distantly related to lizards! EOS Really? I guess that's interesting. What else can you tell me?", "Knowledge": "Many species of snakes have skulls with several more joints than their lizard ancestors, enabling them to swallow prey much larger than their heads with their highly mobile jaws.", "Response": "Most snakes have extra joints in their jaws that allow them to swallow prey much larger than their heads."}
{"Context": "I'm not a fan of snakes. How about you? EOS I love snakes! I recently learned that they are distantly related to lizards! EOS Really? I guess that's interesting. What else can you tell me? EOS Most snakes have extra joints in their jaws that allow them to swallow prey much larger than their heads. EOS Really so an snake could swallow me whole if it wanted to?", "Knowledge": "Living snakes are found on every continent except Antarctica, and on most smaller land masses; exceptions include some large islands, such as Ireland, Iceland, Greenland, the Hawaiian archipelago, and the islands of New Zealand, and many small islands of the Atlantic and central Pacific oceans.", "Response": "Perhaps if the snake was big enough! Snakes are very adaptable. They live on every continent except Antartica!"}
{"Context": "I'm not a fan of snakes. How about you? EOS I love snakes! I recently learned that they are distantly related to lizards! EOS Really? I guess that's interesting. What else can you tell me? EOS Most snakes have extra joints in their jaws that allow them to swallow prey much larger than their heads. EOS Really so an snake could swallow me whole if it wanted to? EOS Perhaps if the snake was big enough! Snakes are very adaptable. They live on every continent except Antartica! EOS That would make sense. Too cold!", "Knowledge": "To accommodate their narrow bodies, snakes' paired organs (such as kidneys) appear one in front of the other instead of side by side, and most have only one functional lung.", "Response": "I think it's amazing how their bodies are specific to their shape. Because snakes are so narrow, most of the snake's paired organs, like their kidneys, are one in front of the other instead of side by side."}
{"Context": "I'm not a fan of snakes. How about you? EOS I love snakes! I recently learned that they are distantly related to lizards! EOS Really? I guess that's interesting. What else can you tell me? EOS Most snakes have extra joints in their jaws that allow them to swallow prey much larger than their heads. EOS Really so an snake could swallow me whole if it wanted to? EOS Perhaps if the snake was big enough! Snakes are very adaptable. They live on every continent except Antartica! EOS That would make sense. Too cold! EOS I think it's amazing how their bodies are specific to their shape. Because snakes are so narrow, most of the snake's paired organs, like their kidneys, are one in front of the other instead of side by side. EOS That's cool can you tell me anything else?", "Knowledge": "Legless lizards resemble snakes, but several common groups of legless lizards have eyelids and external ears, which snakes lack, although this rule is not universal (see Amphisbaenia, Dibamidae, and Pygopodidae).", "Response": "The snake's distant cousin, the lizard, have some species with no legs! It's pretty wild, but even though they look like snakes, they're still just lizards."}
{"Context": "I love baseball.", "Knowledge": "Baseball is a bat-and-ball game played between two teams of nine players each who take turns batting and fielding.", "Response": "I love it too! It has a pretty solid turn flow to it, doesn't it?"}
{"Context": "I love baseball. EOS I love it too! It has a pretty solid turn flow to it, doesn't it? EOS Yes, I especially love the Yankees.", "Knowledge": "The Yankees–Red Sox rivalry is a Major League Baseball (MLB) rivalry between the New York Yankees and Boston Red Sox.", "Response": "If that's the case then what do you think about the rivalry they've got the Red Sox?"}
{"Context": "I love baseball. EOS I love it too! It has a pretty solid turn flow to it, doesn't it? EOS Yes, I especially love the Yankees. EOS If that's the case then what do you think about the rivalry they've got the Red Sox? EOS I can not stand the Red Sox. Go Yankees.", "Knowledge": "A run is scored when a player advances around the bases and touches home plate.", "Response": "I'll say this.. Nothing beats a good home run."}
{"Context": "I love baseball. EOS I love it too! It has a pretty solid turn flow to it, doesn't it? EOS Yes, I especially love the Yankees. EOS If that's the case then what do you think about the rivalry they've got the Red Sox? EOS I can not stand the Red Sox. Go Yankees. EOS I'll say this.. Nothing beats a good home run. EOS Yes, especially when Aaron Judge hits it.", "Knowledge": "If scores are tied at the end of nine innings, extra innings are usually played.", "Response": "Yea, Aaron Judge makes the game interesting. I don't think I've ever seen a game go to extra innings with him around."}
{"Context": "I love to travel. I have been to five countries in Europe. Do you like traveling?", "Knowledge": "Travel is the movement of people between relatively distant geographical locations, and can involve travel by foot, bicycle, automobile, train, boat, bus, airplane, or other means, with or without luggage, and can be one way or round trip.", "Response": "I love to travel by airplane."}
{"Context": "I love to travel. I have been to five countries in Europe. Do you like traveling? EOS I love to travel by airplane. EOS What's your favorite airline?", "Knowledge": "Alaska Airlines is an American airline headquartered in the Seattle metropolitan area of the state of Washington.", "Response": "I love Alaska Airlines."}
{"Context": "I love to travel. I have been to five countries in Europe. Do you like traveling? EOS I love to travel by airplane. EOS What's your favorite airline? EOS I love Alaska Airlines. EOS I've never flown with them. What's the most common mode of transportation for those who travel?", "Knowledge": "Travel is the movement of people between relatively distant geographical locations, and can involve travel by foot, bicycle, automobile, train, boat, bus, airplane, or other means, with or without luggage, and can be one way or round trip.", "Response": "I am not sure but it most likely is train, boat or automobile."}
{"Context": "I love to travel. I have been to five countries in Europe. Do you like traveling? EOS I love to travel by airplane. EOS What's your favorite airline? EOS I love Alaska Airlines. EOS I've never flown with them. What's the most common mode of transportation for those who travel? EOS I am not sure but it most likely is train, boat or automobile. EOS I would love to go on a long train ride across the country some day", "Knowledge": "Travel can also include relatively short stays between successive movements.", "Response": "You can also travel short stays between successive movements."}
{"Context": "I love to travel. I have been to five countries in Europe. Do you like traveling? EOS I love to travel by airplane. EOS What's your favorite airline? EOS I love Alaska Airlines. EOS I've never flown with them. What's the most common mode of transportation for those who travel? EOS I am not sure but it most likely is train, boat or automobile. EOS I would love to go on a long train ride across the country some day EOS You can also travel short stays between successive movements. EOS Yes I can see how that could be more economical", "Knowledge": "The term \"travel\" may originate from the Old French word \"travail\", which means 'work'.", "Response": "The term travel orginated from the Old French word travail, which means work."}
{"Context": "I like the Ketogenic diet, I eat a lot of meat.", "Knowledge": "The ketogenic diet is a high-fat, adequate-protein, low-carbohydrate diet that in medicine is used primarily to treat difficult-to-control (refractory) epilepsy in children.", "Response": "That's interesting. Are you allowed fruit on that diet?"}
{"Context": "I like the Ketogenic diet, I eat a lot of meat. EOS That's interesting. Are you allowed fruit on that diet? EOS You bet! Rhubarb is a main one which I have a huge patch of.", "Knowledge": "The diet forces the body to burn fats rather than carbohydrates.", "Response": "That's interesting. I understand it causes your body to burn stored fat faster."}
{"Context": "I like the Ketogenic diet, I eat a lot of meat. EOS That's interesting. Are you allowed fruit on that diet? EOS You bet! Rhubarb is a main one which I have a huge patch of. EOS That's interesting. I understand it causes your body to burn stored fat faster. EOS Yes, other diets actually try to burn carbs instead of actual fat.", "Knowledge": "However, if there is little carbohydrate in the diet, the liver converts fat into fatty acids and ketone bodies.", "Response": "Do you have a hard time eliminating carbs?"}
{"Context": "I like the Ketogenic diet, I eat a lot of meat. EOS That's interesting. Are you allowed fruit on that diet? EOS You bet! Rhubarb is a main one which I have a huge patch of. EOS That's interesting. I understand it causes your body to burn stored fat faster. EOS Yes, other diets actually try to burn carbs instead of actual fat. EOS Do you have a hard time eliminating carbs? EOS Most carbs, no. I do have a weakness for potatoes and pop but try to limit that as a cheat \"treat\".", "Knowledge": "There is some evidence that adults with epilepsy may benefit from the diet, and that a less strict regimen, such as a modified Atkins diet, is similarly effective.", "Response": "I heard that this diet can be good for people with epilepsy."}
{"Context": "I like the Ketogenic diet, I eat a lot of meat. EOS That's interesting. Are you allowed fruit on that diet? EOS You bet! Rhubarb is a main one which I have a huge patch of. EOS That's interesting. I understand it causes your body to burn stored fat faster. EOS Yes, other diets actually try to burn carbs instead of actual fat. EOS Do you have a hard time eliminating carbs? EOS Most carbs, no. I do have a weakness for potatoes and pop but try to limit that as a cheat \"treat\". EOS I heard that this diet can be good for people with epilepsy. EOS That's what I have read. It appears maybe the higher fat diet helps reduce seizures since your brain feeds on fat to function.", "Knowledge": "However, if there is little carbohydrate in the diet, the liver converts fat into fatty acids and ketone bodies.", "Response": "I believe that the liver converts fat into fatty acids and ketone bodies."}
{"Context": "", "Knowledge": "South Park is an American adult animated sitcom created by Trey Parker and Matt Stone and developed by Brian Graden for the Comedy Central television network.", "Response": "hi lets talk south park it  is an American adult animated sitcom"}
{"Context": "hi lets talk south park it  is an American adult animated sitcom EOS I lov esouth PArk!", "Knowledge": "South Park is an American adult animated sitcom created by Trey Parker and Matt Stone and developed by Brian Graden for the Comedy Central television network.", "Response": "Trey Parker and Matt Stone did a great job creating a show like this that has lasted for years"}
{"Context": "hi lets talk south park it  is an American adult animated sitcom EOS I lov esouth PArk! EOS Trey Parker and Matt Stone did a great job creating a show like this that has lasted for years EOS They really have. I especially loved the movie, South Park: Bigger Longer and Uncut. Satan was hilarious.", "Knowledge": "The show revolves around four boys—Stan Marsh, Kyle Broflovski, Eric Cartman, and Kenny McCormick—and their bizarre adventures in and around the titular Colorado town.", "Response": "never got a chance to watch the movie but Eric Cartman, and Kenny McCormick are very funny"}
{"Context": "hi lets talk south park it  is an American adult animated sitcom EOS I lov esouth PArk! EOS Trey Parker and Matt Stone did a great job creating a show like this that has lasted for years EOS They really have. I especially loved the movie, South Park: Bigger Longer and Uncut. Satan was hilarious. EOS never got a chance to watch the movie but Eric Cartman, and Kenny McCormick are very funny EOS They're probably my favorite characters. Kenny is always dying in some weird way.", "Knowledge": "Much like \"The Simpsons\", \"South Park\" uses a very large ensemble cast of recurring characters and became infamous for its profanity and dark, surreal humor that satirizes a wide range of topics towards a mature audience.", "Response": "yes I love how it is surreal humor that has meaning in the lives that we live lol"}
{"Context": "hi lets talk south park it  is an American adult animated sitcom EOS I lov esouth PArk! EOS Trey Parker and Matt Stone did a great job creating a show like this that has lasted for years EOS They really have. I especially loved the movie, South Park: Bigger Longer and Uncut. Satan was hilarious. EOS never got a chance to watch the movie but Eric Cartman, and Kenny McCormick are very funny EOS They're probably my favorite characters. Kenny is always dying in some weird way. EOS yes I love how it is surreal humor that has meaning in the lives that we live lol EOS They've made quite a few celebrities mad over the years too haven't they?", "Knowledge": "Much like \"The Simpsons\", \"South Park\" uses a very large ensemble cast of recurring characters and became infamous for its profanity and dark, surreal humor that satirizes a wide range of topics towards a mature audience.", "Response": "yes was't there some drama over it a year or two ago I guess some may not like the dark humor"}
{"Context": "", "Knowledge": "Singing is the act of producing musical sounds with the voice and augments regular speech by the use of sustained tonality, rhythm, and a variety of vocal techniques.", "Response": "Singing is the act of producing musical sounds with the voice"}
{"Context": "Singing is the act of producing musical sounds with the voice EOS A good voice is a beautiful thing. Unfortunately, I do not have a good singing voice!", "Knowledge": "Singing is the act of producing musical sounds with the voice and augments regular speech by the use of sustained tonality, rhythm, and a variety of vocal techniques.", "Response": "It involves the use vocal rhythm and a variety of vocal techniques"}
{"Context": "Singing is the act of producing musical sounds with the voice EOS A good voice is a beautiful thing. Unfortunately, I do not have a good singing voice! EOS It involves the use vocal rhythm and a variety of vocal techniques EOS You'd better tell me more about it then, as I need to learn to sing better!", "Knowledge": "A person who sings is called a singer or vocalist.", "Response": "A person who sings is called a singer or vocalist"}
{"Context": "Singing is the act of producing musical sounds with the voice EOS A good voice is a beautiful thing. Unfortunately, I do not have a good singing voice! EOS It involves the use vocal rhythm and a variety of vocal techniques EOS You'd better tell me more about it then, as I need to learn to sing better! EOS A person who sings is called a singer or vocalist EOS That's very interesting. Are there many of these people around?", "Knowledge": "Singers perform music (arias, recitatives, songs, etc.)", "Response": "Yes. Singers perform music"}
{"Context": "Singing is the act of producing musical sounds with the voice EOS A good voice is a beautiful thing. Unfortunately, I do not have a good singing voice! EOS It involves the use vocal rhythm and a variety of vocal techniques EOS You'd better tell me more about it then, as I need to learn to sing better! EOS A person who sings is called a singer or vocalist EOS That's very interesting. Are there many of these people around? EOS Yes. Singers perform music EOS And do they write the music too, or does someone else do that?", "Knowledge": "Singers may perform as soloists or accompanied by anything from a single instrument (as in art song or some jazz styles) up to a symphony orchestra or big band.", "Response": "Sometimes. Singers may perform as soloists"}
{"Context": "", "Knowledge": "A fishing vessel is a boat or ship used to catch fish in the sea, or on a lake or river.", "Response": "I love summer.  I spend a lot of time on my fishing boat.  It is a vessel that we use to catch fish on the lake or river."}
{"Context": "I love summer.  I spend a lot of time on my fishing boat.  It is a vessel that we use to catch fish on the lake or river. EOS Do you eat the fish that you catch or throw them back in the water?", "Knowledge": "Fly fishing is an angling method in which an artificial \"fly\" is used to catch fish.", "Response": "I usually cook them.  We do a lot of fly fishing.  It is a method where you use an artificial fly to lure the fish"}
{"Context": "I love summer.  I spend a lot of time on my fishing boat.  It is a vessel that we use to catch fish on the lake or river. EOS Do you eat the fish that you catch or throw them back in the water? EOS I usually cook them.  We do a lot of fly fishing.  It is a method where you use an artificial fly to lure the fish EOS What type of fish do you usually catch?", "Knowledge": "Since the latter part of the 20th century, many salmon and sea trout rivers have been converted to complete or partial catch and release.", "Response": "We like to catch salmon if we are catch and release fishing.  Many salmon and trout rivers are actually catch and release now"}
{"Context": "I love summer.  I spend a lot of time on my fishing boat.  It is a vessel that we use to catch fish on the lake or river. EOS Do you eat the fish that you catch or throw them back in the water? EOS I usually cook them.  We do a lot of fly fishing.  It is a method where you use an artificial fly to lure the fish EOS What type of fish do you usually catch? EOS We like to catch salmon if we are catch and release fishing.  Many salmon and trout rivers are actually catch and release now EOS Oh wow, I didn't know that.  Why don't they like you to keep them?", "Knowledge": "In the United Kingdom, catch and release has been performed for more than a century by coarse fishermen in order to prevent target species from disappearing in heavily fished waters.", "Response": "A lot of it is due to protecting the species.  For instance, in the UK, they perform catch and release in order to protect target species of fish from diminishing"}
{"Context": "", "Knowledge": "It is distinguished from canoeing by the sitting position of the paddler and the number of blades on the paddle.", "Response": "I love kayaking! It's different from canoeing in that the seating position is different and there are two blades on the paddle."}
{"Context": "I love kayaking! It's different from canoeing in that the seating position is different and there are two blades on the paddle. EOS I have never been kayaking - it sounds like a lot of fun! Where do you kayak?", "Knowledge": "The main purpose for creating the kayak, which literally translates to \"hunter's boat\" was for hunting and fishing.", "Response": "I love kayaking in peaceful rivers. They were actually first created for hunting and fishing."}
{"Context": "I love kayaking! It's different from canoeing in that the seating position is different and there are two blades on the paddle. EOS I have never been kayaking - it sounds like a lot of fun! Where do you kayak? EOS I love kayaking in peaceful rivers. They were actually first created for hunting and fishing. EOS That would be so relaxing. Any idea who first created them?", "Knowledge": "Kayaks were created thousands of years ago by the Inuit, formerly known as Eskimos, of the northern Arctic regions.", "Response": "They were made by the Inuit people in the northern Arctic regions."}
{"Context": "I love kayaking! It's different from canoeing in that the seating position is different and there are two blades on the paddle. EOS I have never been kayaking - it sounds like a lot of fun! Where do you kayak? EOS I love kayaking in peaceful rivers. They were actually first created for hunting and fishing. EOS That would be so relaxing. Any idea who first created them? EOS They were made by the Inuit people in the northern Arctic regions. EOS Ah, ok. Aren't there Init people up in Alaska? I seem to remember reading something like that.", "Knowledge": "The kayak's stealth capabilities, allowed for the hunter to sneak up behind animals on the shoreline, and successfully catch their prey.", "Response": "Yes, their former name was the Eskimos. But kayaks are really stealthy and allow hunters to sneak up behind animals on the shoreline."}
{"Context": "I love kayaking! It's different from canoeing in that the seating position is different and there are two blades on the paddle. EOS I have never been kayaking - it sounds like a lot of fun! Where do you kayak? EOS I love kayaking in peaceful rivers. They were actually first created for hunting and fishing. EOS That would be so relaxing. Any idea who first created them? EOS They were made by the Inuit people in the northern Arctic regions. EOS Ah, ok. Aren't there Init people up in Alaska? I seem to remember reading something like that. EOS Yes, their former name was the Eskimos. But kayaks are really stealthy and allow hunters to sneak up behind animals on the shoreline. EOS Poor animals! Yes, I can see that they would be very useful for hunters. Perhaps I", "Knowledge": "By the mid-1800s the kayak became increasingly popular and the Europeans became interested.", "Response": "Of course, in the mid 1800s, kayaking became increasingly popular for sport. So consider enjoying it the next time you're near a river!"}
{"Context": "", "Knowledge": "Lizards are a widespread group of squamate reptiles, with over 6,000 species, ranging across all continents except Antarctica, as well as most oceanic island chains.", "Response": "There are over 6,000 species of lizards and I like them all."}
{"Context": "There are over 6,000 species of lizards and I like them all. EOS Every single one of them?  Wow, which is your favorite?", "Knowledge": "Lizards range in size from chameleons and geckos a few centimeters long to the 3 meter long Komodo dragon.", "Response": "Geckos are my favorite because they are only a few centimeters long."}
{"Context": "There are over 6,000 species of lizards and I like them all. EOS Every single one of them?  Wow, which is your favorite? EOS Geckos are my favorite because they are only a few centimeters long. EOS I bet geckos are a lot more popular now with the thousands of GEICO commercials!  I think they are pretty cool too to be honest.", "Knowledge": "Most geckos cannot blink, but they often lick their eyes to keep them clean and moist.", "Response": "I agree, the coolest thing about them is they can't blink. They use their tongue to keep their eyes moist."}
{"Context": "There are over 6,000 species of lizards and I like them all. EOS Every single one of them?  Wow, which is your favorite? EOS Geckos are my favorite because they are only a few centimeters long. EOS I bet geckos are a lot more popular now with the thousands of GEICO commercials!  I think they are pretty cool too to be honest. EOS I agree, the coolest thing about them is they can't blink. They use their tongue to keep their eyes moist. EOS Is that right?  I remember watching a show about them and they can actually chirp and bark.  They also make some kind of clicking noise too to communicate.", "Knowledge": "Some such as the forest-dwelling \"Draco\" lizards are able to glide.", "Response": "Yes, they are very intelligent. I also like Draco lizards. They live in the forest and are able to glide in the air. Have you heard of them?"}
{"Context": "There are over 6,000 species of lizards and I like them all. EOS Every single one of them?  Wow, which is your favorite? EOS Geckos are my favorite because they are only a few centimeters long. EOS I bet geckos are a lot more popular now with the thousands of GEICO commercials!  I think they are pretty cool too to be honest. EOS I agree, the coolest thing about them is they can't blink. They use their tongue to keep their eyes moist. EOS Is that right?  I remember watching a show about them and they can actually chirp and bark.  They also make some kind of clicking noise too to communicate. EOS Yes, they are very intelligent. I also like Draco lizards. They live in the forest and are able to glide in the air. Have you heard of them? EOS Are they the ones with the webbed limbs?  I think so, the name sounds familiar.", "Knowledge": "Others are legless, and have long snake-like bodies.", "Response": "Yes, I love them. Some lizards don't even have legs they look like snakes."}
{"Context": "", "Knowledge": "The drink was created in the 1880s by pharmacist Charles Alderton in Waco, Texas and first served around 1885.", "Response": "Coke? Pepsi? Neither. Dr. Pepper is the real stuff! This stuff has been around since the 1880s, served first in 1885...before both Coke AND Pepsi. It should be the real #1."}
{"Context": "Coke? Pepsi? Neither. Dr. Pepper is the real stuff! This stuff has been around since the 1880s, served first in 1885...before both Coke AND Pepsi. It should be the real #1. EOS Definitely Coke, Diet Coke in fact. Can not get into Dr. Pepper though, but everyone else I know loves it.", "Knowledge": "Patrons at Morrison's soda fountain soon learned of Alderton's new drink and began ordering a \"Waco\".", "Response": "Okay, I'll respect the difference in taste. I'll say one thing--it was invented by a pharmacist in Waco, Texas. When it was introduced to the public at Morrison's soda fountain, a store owner who really liked the drink, his guests kept asking for a \"Waco\"... Glad that name didn't stick."}
{"Context": "Coke? Pepsi? Neither. Dr. Pepper is the real stuff! This stuff has been around since the 1880s, served first in 1885...before both Coke AND Pepsi. It should be the real #1. EOS Definitely Coke, Diet Coke in fact. Can not get into Dr. Pepper though, but everyone else I know loves it. EOS Okay, I'll respect the difference in taste. I'll say one thing--it was invented by a pharmacist in Waco, Texas. When it was introduced to the public at Morrison's soda fountain, a store owner who really liked the drink, his guests kept asking for a \"Waco\"... Glad that name didn't stick. EOS Yeah, that's kinda weird. Now, is Dr. Pepper a Coke product or a Pepsi product?", "Knowledge": "It was introduced nationally in the United States at the 1904 Louisiana Purchase Exposition as a new kind of soda pop, made with 23 flavors.", "Response": "It's neither; it's its own product. Technically fully introduced nationally in the US at the Louisiana Purchase Expedition in 1904 as this kind of \"new soda pop,\" made with 23 flavors. They still use that tagline today, actually, with a \"23\" on their can at times."}
{"Context": "Coke? Pepsi? Neither. Dr. Pepper is the real stuff! This stuff has been around since the 1880s, served first in 1885...before both Coke AND Pepsi. It should be the real #1. EOS Definitely Coke, Diet Coke in fact. Can not get into Dr. Pepper though, but everyone else I know loves it. EOS Okay, I'll respect the difference in taste. I'll say one thing--it was invented by a pharmacist in Waco, Texas. When it was introduced to the public at Morrison's soda fountain, a store owner who really liked the drink, his guests kept asking for a \"Waco\"... Glad that name didn't stick. EOS Yeah, that's kinda weird. Now, is Dr. Pepper a Coke product or a Pepsi product? EOS It's neither; it's its own product. Technically fully introduced nationally in the US at the Louisiana Purchase Expedition in 1904 as this kind of \"new soda pop,\" made with 23 flavors. They still use that tagline today, actually, with a \"23\" on their can at times. EOS I didn't know that, interesting. Where is the factory that it is made at located today?", "Knowledge": "The drink was created in the 1880s by pharmacist Charles Alderton in Waco, Texas and first served around 1885.", "Response": "They have many factories today, all over. I just love the idea that it was called \"Dr. Pepper\" because it was invented by a pharmacist, of all people."}
{"Context": "", "Knowledge": "Japan ( \"Nippon\" or \"Nihon\" ; formally \"\" or \"Nihon-koku\", meaning \"State of Japan\") is a sovereign island nation in East Asia.", "Response": "Japan is located in East Asia which is a sovereign island nation"}
{"Context": "Japan is located in East Asia which is a sovereign island nation EOS Thats an interesting fact. I've never been there, have you?", "Knowledge": "Japan is a stratovolcanic archipelago consisting of about 6,852 islands.", "Response": "Yes, I have been there 2 times. Japan consists of 6,852 islands and it is a stratovolcanic archipelago"}
{"Context": "Japan is located in East Asia which is a sovereign island nation EOS Thats an interesting fact. I've never been there, have you? EOS Yes, I have been there 2 times. Japan consists of 6,852 islands and it is a stratovolcanic archipelago EOS Wow. I know that the name \"Japan\" is Nihon which means the land of the rising sun. Did you enjoy your trip there?", "Knowledge": "no_passages_used", "Response": "Ya, It was an enjoyable trip. Large number of languages use the word \"Japan\" which is an exonym."}
{"Context": "Japan is located in East Asia which is a sovereign island nation EOS Thats an interesting fact. I've never been there, have you? EOS Yes, I have been there 2 times. Japan consists of 6,852 islands and it is a stratovolcanic archipelago EOS Wow. I know that the name \"Japan\" is Nihon which means the land of the rising sun. Did you enjoy your trip there? EOS Ya, It was an enjoyable trip. Large number of languages use the word \"Japan\" which is an exonym. EOS What was the best part about Japan in your opinion?", "Knowledge": "The kanji, or Sino-Japanese characters, that make up Japan's name mean \"sun origin\", and it is often called the \"Land of the Rising Sun\".", "Response": "The meaning of Japan is \"sun origin\" which is called \"Land of the Rising Sun\""}
{"Context": "Japan is located in East Asia which is a sovereign island nation EOS Thats an interesting fact. I've never been there, have you? EOS Yes, I have been there 2 times. Japan consists of 6,852 islands and it is a stratovolcanic archipelago EOS Wow. I know that the name \"Japan\" is Nihon which means the land of the rising sun. Did you enjoy your trip there? EOS Ya, It was an enjoyable trip. Large number of languages use the word \"Japan\" which is an exonym. EOS What was the best part about Japan in your opinion? EOS The meaning of Japan is \"sun origin\" which is called \"Land of the Rising Sun\" EOS Okay. what did you like about Japan? I read somewhere that it has around 33 million people.", "Knowledge": "The population of 127 million is the world's tenth largest.", "Response": "Japan ranking World's tenth largest population and has 127 million population"}
{"Context": "So, Justin Bieber has been in the news a lot recently. Do you kow about him?", "Knowledge": "no_passages_used", "Response": "I love Justin Drew Biebers'music"}
{"Context": "So, Justin Bieber has been in the news a lot recently. Do you kow about him? EOS I love Justin Drew Biebers'music EOS Anything in particular you like?", "Knowledge": "Justin Drew Bieber (; born March 1, 1994) is a Canadian singer and songwriter.", "Response": "I earlier thought he was an American,unknown to me he is a. Canadian singer and songwriter."}
{"Context": "So, Justin Bieber has been in the news a lot recently. Do you kow about him? EOS I love Justin Drew Biebers'music EOS Anything in particular you like? EOS I earlier thought he was an American,unknown to me he is a. Canadian singer and songwriter. EOS Yes, he is from Canada. He flew down to Atlanta after being Youtube noticed. Anything else about him you know that's interesting?", "Knowledge": "After a talent manager discovered him through his YouTube videos covering songs in 2008 and signed to RBMG, Bieber released his debut EP, \"My World\", in late 2009.", "Response": "Yes he was noticed in a talent manager discovered him through his YouTube videos covering songs in 2008 ."}
{"Context": "So, Justin Bieber has been in the news a lot recently. Do you kow about him? EOS I love Justin Drew Biebers'music EOS Anything in particular you like? EOS I earlier thought he was an American,unknown to me he is a. Canadian singer and songwriter. EOS Yes, he is from Canada. He flew down to Atlanta after being Youtube noticed. Anything else about him you know that's interesting? EOS Yes he was noticed in a talent manager discovered him through his YouTube videos covering songs in 2008 . EOS Do you happen to know his first song?", "Knowledge": "After a talent manager discovered him through his YouTube videos covering songs in 2008 and signed to RBMG, Bieber released his debut EP, \"My World\", in late 2009.", "Response": "Bieber released his debut EP, \"My World\", in late 2009."}
{"Context": "So, Justin Bieber has been in the news a lot recently. Do you kow about him? EOS I love Justin Drew Biebers'music EOS Anything in particular you like? EOS I earlier thought he was an American,unknown to me he is a. Canadian singer and songwriter. EOS Yes, he is from Canada. He flew down to Atlanta after being Youtube noticed. Anything else about him you know that's interesting? EOS Yes he was noticed in a talent manager discovered him through his YouTube videos covering songs in 2008 . EOS Do you happen to know his first song? EOS Bieber released his debut EP, \"My World\", in late 2009. EOS Has he had any famous relationships?", "Knowledge": "He became the first artist to have seven songs from a debut record chart on the \"Billboard\" Hot 100.", "Response": "became the first artist to have seven songs from a debut record chart on the \"Billboard"}
{"Context": "I like blond ladies and have been wondering how they get their hair blond", "Knowledge": "Blond (male), blonde (female), or fair hair, is a hair color characterized by low levels of the dark pigment eumelanin.", "Response": "It is caused by having low levels of the dark pigment eumelanin"}
{"Context": "I like blond ladies and have been wondering how they get their hair blond EOS It is caused by having low levels of the dark pigment eumelanin EOS I never realized it was caused by deficiency of pigment, good info", "Knowledge": "The color can be from the very pale blond (caused by a patchy, scarce distribution of pigment) to reddish \"strawberry\" blond or golden-brownish (\"sandy\") blond colors (the latter with more eumelanin).", "Response": "There are vary degrees of it. The color can be from the very pale blonde which is caused by a patchy, scarce distrubution of pigment to strawberry blonde or golden blonde which has more eumelanin"}
{"Context": "I like blond ladies and have been wondering how they get their hair blond EOS It is caused by having low levels of the dark pigment eumelanin EOS I never realized it was caused by deficiency of pigment, good info EOS There are vary degrees of it. The color can be from the very pale blonde which is caused by a patchy, scarce distrubution of pigment to strawberry blonde or golden blonde which has more eumelanin EOS Can blond hair be achieved artificially?", "Knowledge": "The word \"blond\" is first documented in English in 1481 and derives from Old French \"blund, blont\", meaning \"a colour midway between golden and light chestnut\".", "Response": "That it can by using hair dye. Another interesting fact about the term Blond. It was first documented all the way back to 1481"}
{"Context": "I like blond ladies and have been wondering how they get their hair blond EOS It is caused by having low levels of the dark pigment eumelanin EOS I never realized it was caused by deficiency of pigment, good info EOS There are vary degrees of it. The color can be from the very pale blonde which is caused by a patchy, scarce distrubution of pigment to strawberry blonde or golden blonde which has more eumelanin EOS Can blond hair be achieved artificially? EOS That it can by using hair dye. Another interesting fact about the term Blond. It was first documented all the way back to 1481 EOS How many variations of blond hair types are out there?", "Knowledge": "The color can be from the very pale blond (caused by a patchy, scarce distribution of pigment) to reddish \"strawberry\" blond or golden-brownish (\"sandy\") blond colors (the latter with more eumelanin).", "Response": "It can vary. One can have very pale blond hair to strawberry blond to golden-brownish blond"}
{"Context": "I like blond ladies and have been wondering how they get their hair blond EOS It is caused by having low levels of the dark pigment eumelanin EOS I never realized it was caused by deficiency of pigment, good info EOS There are vary degrees of it. The color can be from the very pale blonde which is caused by a patchy, scarce distrubution of pigment to strawberry blonde or golden blonde which has more eumelanin EOS Can blond hair be achieved artificially? EOS That it can by using hair dye. Another interesting fact about the term Blond. It was first documented all the way back to 1481 EOS How many variations of blond hair types are out there? EOS It can vary. One can have very pale blond hair to strawberry blond to golden-brownish blond EOS For those than want their condition reversed. Is it curable?", "Knowledge": "On the Fischer–Saller scale, blond color ranges from A (light blond) to O (dark blond).", "Response": "One can by using hair dye, but that is only a temporary solution. But why would anyone want to reverse their blond hair. It is such a diverse hair color ranging from light blond to dark blond on the Fischer-Saller scale"}
{"Context": "Hello, Chevrolet is one of the largest car companies in the United States. The Chevy cruise is a great, little, car.", "Knowledge": "Chevrolet ( ), colloquially referred to as Chevy and formally the Chevrolet Division of General Motors Company, is an American automobile division of the American manufacturer General Motors (GM).", "Response": "Do you know that Chevrolet is part of the General Motors Company."}
{"Context": "Hello, Chevrolet is one of the largest car companies in the United States. The Chevy cruise is a great, little, car. EOS Do you know that Chevrolet is part of the General Motors Company. EOS I did know that. It's crazy how so many companies fall under the same parent company.", "Knowledge": "Current auto brands are Buick, Cadillac, Chevrolet, GMC, Holden, and Wuling.", "Response": "Yes, there was even more brands under it however, currently it includes Buick, Cadillac, Chevrolet, GMC, Holden, and Wuling."}
{"Context": "Hello, Chevrolet is one of the largest car companies in the United States. The Chevy cruise is a great, little, car. EOS Do you know that Chevrolet is part of the General Motors Company. EOS I did know that. It's crazy how so many companies fall under the same parent company. EOS Yes, there was even more brands under it however, currently it includes Buick, Cadillac, Chevrolet, GMC, Holden, and Wuling. EOS Wow, I've never even heard of Holden and Wuling. I guess they must be outside of the United States.", "Knowledge": "Current auto brands are Buick, Cadillac, Chevrolet, GMC, Holden, and Wuling.", "Response": "Correct, Holden is Australian car company and Wuling is Chinese car company."}
{"Context": "Hello, Chevrolet is one of the largest car companies in the United States. The Chevy cruise is a great, little, car. EOS Do you know that Chevrolet is part of the General Motors Company. EOS I did know that. It's crazy how so many companies fall under the same parent company. EOS Yes, there was even more brands under it however, currently it includes Buick, Cadillac, Chevrolet, GMC, Holden, and Wuling. EOS Wow, I've never even heard of Holden and Wuling. I guess they must be outside of the United States. EOS Correct, Holden is Australian car company and Wuling is Chinese car company. EOS Are they luxury companies like Buick or are they more standard like Chevy?", "Knowledge": "Current auto brands are Buick, Cadillac, Chevrolet, GMC, Holden, and Wuling.", "Response": "More standard like Chevy for both Holden and Wuling."}
{"Context": "Hello, Chevrolet is one of the largest car companies in the United States. The Chevy cruise is a great, little, car. EOS Do you know that Chevrolet is part of the General Motors Company. EOS I did know that. It's crazy how so many companies fall under the same parent company. EOS Yes, there was even more brands under it however, currently it includes Buick, Cadillac, Chevrolet, GMC, Holden, and Wuling. EOS Wow, I've never even heard of Holden and Wuling. I guess they must be outside of the United States. EOS Correct, Holden is Australian car company and Wuling is Chinese car company. EOS Are they luxury companies like Buick or are they more standard like Chevy? EOS More standard like Chevy for both Holden and Wuling. EOS That's interesting. Maybe GM will look to expand into other countries in the future.", "Knowledge": "GM reached the milestone of selling 10 million vehicles in 2016.", "Response": "They sold a reord 10 million cars in 2016 but have exited some markets like Europe after repeated losses."}
{"Context": "", "Knowledge": "Imagine Dragons is an American rock band from Las Vegas, Nevada, consisting of lead vocalist Dan Reynolds, lead guitarist Wayne Sermon, bassist and keyboardist Ben McKee, and drummer Daniel Platzman.", "Response": "Imagine dragons are one of the best bands"}
{"Context": "Imagine dragons are one of the best bands EOS What do you like about them?", "Knowledge": "Imagine Dragons is an American rock band from Las Vegas, Nevada, consisting of lead vocalist Dan Reynolds, lead guitarist Wayne Sermon, bassist and keyboardist Ben McKee, and drummer Daniel Platzman.", "Response": "I like Imagine dragons take on american rock"}
{"Context": "Imagine dragons are one of the best bands EOS What do you like about them? EOS I like Imagine dragons take on american rock EOS What is your favorite song of theirs?", "Knowledge": "The band first gained exposure with the release of single \"It's Time\", followed by their award-winning debut studio album \"Night Visions\" (2012), which resulted in the chart topping singles \"Radioactive\" and \"Demons\".", "Response": "I like Night Vision album with songs like Demons"}
{"Context": "Imagine dragons are one of the best bands EOS What do you like about them? EOS I like Imagine dragons take on american rock EOS What is your favorite song of theirs? EOS I like Night Vision album with songs like Demons EOS I've not heard that album.  Is it available on any streaming services?", "Knowledge": "The band first gained exposure with the release of single \"It's Time\", followed by their award-winning debut studio album \"Night Visions\" (2012), which resulted in the chart topping singles \"Radioactive\" and \"Demons\".", "Response": "Yea their band and music such as Night visions can be played on spotify"}
{"Context": "", "Knowledge": "It specializes in and provides streaming media and video-on-demand online and DVD by mail.", "Response": "I've always loved netflix, even back when they did the DVD by mail service"}
{"Context": "I've always loved netflix, even back when they did the DVD by mail service EOS yea crazy to think they still do and did that", "Knowledge": "Netflix is an American entertainment company founded by Reed Hastings and Marc Randolph on August 29, 1997, in Scotts Valley, California.", "Response": "I was today years old when I realized they still did that lol I can't believe it's been around since August 29, 1997 either."}
{"Context": "I've always loved netflix, even back when they did the DVD by mail service EOS yea crazy to think they still do and did that EOS I was today years old when I realized they still did that lol I can't believe it's been around since August 29, 1997 either. EOS wow thats so insanely old.", "Knowledge": "It is headquartered in Los Gatos, California.", "Response": "I was 16 in 1997. I didn't know that Netflix's headquarters was in Lod Gatos CA either."}
{"Context": "I've always loved netflix, even back when they did the DVD by mail service EOS yea crazy to think they still do and did that EOS I was today years old when I realized they still did that lol I can't believe it's been around since August 29, 1997 either. EOS wow thats so insanely old. EOS I was 16 in 1997. I didn't know that Netflix's headquarters was in Lod Gatos CA either. EOS dang i cant believe they are so old, did they just mail movies for 10 years before becoming popular i guess?", "Knowledge": "In 2007, Netflix expanded its business with the introduction of streaming media, while retaining the DVD and Blu-ray rental service.", "Response": "They started the streaming media in 2007"}
{"Context": "I've always loved netflix, even back when they did the DVD by mail service EOS yea crazy to think they still do and did that EOS I was today years old when I realized they still did that lol I can't believe it's been around since August 29, 1997 either. EOS wow thats so insanely old. EOS I was 16 in 1997. I didn't know that Netflix's headquarters was in Lod Gatos CA either. EOS dang i cant believe they are so old, did they just mail movies for 10 years before becoming popular i guess? EOS They started the streaming media in 2007 EOS Oh yea i remember when it first started, so litlle movies", "Knowledge": "A client end-user can use their media player to start playing the data file (such as a digital file of a movie or song) before the entire file has been transmitted.", "Response": "I know, and it took so long to get them! Nothing like now how you can start a streaming movie before it's even finished loading"}
{"Context": "", "Knowledge": "Many different authors contributed to the Bible.", "Response": "The Bible is interesting.  Many different authors contributed to it."}
{"Context": "The Bible is interesting.  Many different authors contributed to it. EOS Which bible? Or is there only one?", "Knowledge": "It was first printed by the King's Printer Robert Barker and was the third translation into English approved by the English Church authorities.", "Response": "The King James version.  It was first printed by the King's Printer Robert Barker and was the third translation into English approved by the English Church."}
{"Context": "The Bible is interesting.  Many different authors contributed to it. EOS Which bible? Or is there only one? EOS The King James version.  It was first printed by the King's Printer Robert Barker and was the third translation into English approved by the English Church. EOS So how many people contributed to it?", "Knowledge": "The books of the King James Version include the 39 books of the Old Testament, an intertestamental section containing 14 books of the Apocrypha (most of which correspond to books in the Vulgate Deuterocanon adhered to by Roman Catholics), and the 27 books of the New Testament.", "Response": "There are 39 books of the Old Testament, 14 books of the Apocrypha, and 27 books of the new testament.  There are many many stories from different authors."}
{"Context": "The Bible is interesting.  Many different authors contributed to it. EOS Which bible? Or is there only one? EOS The King James version.  It was first printed by the King's Printer Robert Barker and was the third translation into English approved by the English Church. EOS So how many people contributed to it? EOS There are 39 books of the Old Testament, 14 books of the Apocrypha, and 27 books of the new testament.  There are many many stories from different authors. EOS I can only imagine, is the bible of the Christian religion?", "Knowledge": "no_passages_used", "Response": "Yes, the King James Version is the English translation of the Christian Bible for the Church of England."}
{"Context": "The Bible is interesting.  Many different authors contributed to it. EOS Which bible? Or is there only one? EOS The King James version.  It was first printed by the King's Printer Robert Barker and was the third translation into English approved by the English Church. EOS So how many people contributed to it? EOS There are 39 books of the Old Testament, 14 books of the Apocrypha, and 27 books of the new testament.  There are many many stories from different authors. EOS I can only imagine, is the bible of the Christian religion? EOS Yes, the King James Version is the English translation of the Christian Bible for the Church of England. EOS intersting, you seem to know a lot, what else can you teach me!", "Knowledge": "\"Arrested Development\" is an American television sitcom that originally aired on the Fox network from November 2, 2003 to February 10, 2006.", "Response": "How about that \"Arrested Development\" is an American TV show that is very layered.  Every time you watch the seasons all the way through you notice different things!"}
{"Context": "Its crazy how many children have autism these days.", "Knowledge": "Parents usually notice signs in the first two or three years of their child's life.", "Response": "I agree.  I don't funny understand the disease, but I know it is tough on the kids and the parents.  Parents apparently notice that their children may have autism in the first two or three years of a child's life."}
{"Context": "Its crazy how many children have autism these days. EOS I agree.  I don't funny understand the disease, but I know it is tough on the kids and the parents.  Parents apparently notice that their children may have autism in the first two or three years of a child's life. EOS Some people think it comes from getting vaccines, but personally I think it is something to do with the foods we eat.", "Knowledge": "Autism is caused by a combination of genetic and environmental factors.", "Response": "I'm not sure what causes it, but the experts suggest it's a combo of genetic and environmental factors.  Infections before child-birth, too.  Rough all the way around."}
{"Context": "Its crazy how many children have autism these days. EOS I agree.  I don't funny understand the disease, but I know it is tough on the kids and the parents.  Parents apparently notice that their children may have autism in the first two or three years of a child's life. EOS Some people think it comes from getting vaccines, but personally I think it is something to do with the foods we eat. EOS I'm not sure what causes it, but the experts suggest it's a combo of genetic and environmental factors.  Infections before child-birth, too.  Rough all the way around. EOS I have worked with Autistic children in schools.  Some are not bad to work with but some were nightmares!", "Knowledge": "Treatments fall into two major categories: educational interventions and medical management.", "Response": "That's amazing.  I'll bet that some of the educational treatment works for sure.  You are definitely a hero for doing this."}
{"Context": "Its crazy how many children have autism these days. EOS I agree.  I don't funny understand the disease, but I know it is tough on the kids and the parents.  Parents apparently notice that their children may have autism in the first two or three years of a child's life. EOS Some people think it comes from getting vaccines, but personally I think it is something to do with the foods we eat. EOS I'm not sure what causes it, but the experts suggest it's a combo of genetic and environmental factors.  Infections before child-birth, too.  Rough all the way around. EOS I have worked with Autistic children in schools.  Some are not bad to work with but some were nightmares! EOS That's amazing.  I'll bet that some of the educational treatment works for sure.  You are definitely a hero for doing this. EOS I wouldn't consider myself a hero, but one who is willing to help anyone.  Even though the job had its challenges it was also rewarding at times to know you were helping children who are really in need.", "Knowledge": "no_passages_used", "Response": "That's a huge deal.  Thank you for helping people with this condition!"}
{"Context": "Its crazy how many children have autism these days. EOS I agree.  I don't funny understand the disease, but I know it is tough on the kids and the parents.  Parents apparently notice that their children may have autism in the first two or three years of a child's life. EOS Some people think it comes from getting vaccines, but personally I think it is something to do with the foods we eat. EOS I'm not sure what causes it, but the experts suggest it's a combo of genetic and environmental factors.  Infections before child-birth, too.  Rough all the way around. EOS I have worked with Autistic children in schools.  Some are not bad to work with but some were nightmares! EOS That's amazing.  I'll bet that some of the educational treatment works for sure.  You are definitely a hero for doing this. EOS I wouldn't consider myself a hero, but one who is willing to help anyone.  Even though the job had its challenges it was also rewarding at times to know you were helping children who are really in need. EOS That's a huge deal.  Thank you for helping people with this condition! EOS Now I work with a normal student population, but there is still kids with autism in the classes.  It is unbelievable how many kids are now presenting with this disease.", "Knowledge": "The ARM advocates a variety of goals including a greater acceptance of autistic behaviors; therapies that teach autistic individuals coping skills rather than therapies focused on imitating behaviors of neurotypical peers; the creation of social networks and events that allow autistic people to socialize on their own terms; and the recognition of the autistic community as a minority group.", "Response": "I have not met many people with autism - a few.  They are memorable.  I'm glad there is some movement to helping people with autism to develop coping skills.  It matters a lot!  Great to chat with you."}
{"Context": "I love photography, though I'm not that good at it.", "Knowledge": "Photography is the science, art, application and practice of creating durable images by recording light or other electromagnetic radiation, either electronically by means of an image sensor, or chemically by means of a light-sensitive material such as photographic film.", "Response": "Well it is the science, art application and practice of creating durable images by recording light or other electromagnetic radiation."}
{"Context": "I love photography, though I'm not that good at it. EOS Well it is the science, art application and practice of creating durable images by recording light or other electromagnetic radiation. EOS Yes, I really admire people who can capture incredible moments on film.", "Knowledge": "Photography is employed in many fields of science, manufacturing (e.g., photolithography), and business, as well as its more direct uses for art, film and video production, recreational purposes, hobby, and mass communication.", "Response": "Yeah, it is enjoyed and employed y many fields of science, manufacturing, and business, as well as its more direct uses for art, film, and video production, as well as recreational purposes."}
{"Context": "I love photography, though I'm not that good at it. EOS Well it is the science, art application and practice of creating durable images by recording light or other electromagnetic radiation. EOS Yes, I really admire people who can capture incredible moments on film. EOS Yeah, it is enjoyed and employed y many fields of science, manufacturing, and business, as well as its more direct uses for art, film, and video production, as well as recreational purposes. EOS Ah, I see. I suppose it isn't always used for artistic purposes.", "Knowledge": "Photography is employed in many fields of science, manufacturing (e.g., photolithography), and business, as well as its more direct uses for art, film and video production, recreational purposes, hobby, and mass communication.", "Response": "yes thats true, you can use it for recreational purposes, as a hobby and even mass communication applications"}
{"Context": "I love photography, though I'm not that good at it. EOS Well it is the science, art application and practice of creating durable images by recording light or other electromagnetic radiation. EOS Yes, I really admire people who can capture incredible moments on film. EOS Yeah, it is enjoyed and employed y many fields of science, manufacturing, and business, as well as its more direct uses for art, film, and video production, as well as recreational purposes. EOS Ah, I see. I suppose it isn't always used for artistic purposes. EOS yes thats true, you can use it for recreational purposes, as a hobby and even mass communication applications EOS Maybe there is a place for me to make a living with photography after all.", "Knowledge": "With an electronic image sensor, this produces an electrical charge at each pixel, which is electronically processed and stored in a digital image file for subsequent display or processing.", "Response": "perhaps not but you could always work on the inside of cameras, such as the electronic image sensor, that produces an electrial charge at each pixel, which is electronically processed and stored in a digital image file for subsequent display or processing."}
{"Context": "Factory work seems so dangerous and grueling.", "Knowledge": "A factory (previously manufactory) or manufacturing plant is an industrial site, usually consisting of buildings and machinery, or more commonly a complex having several buildings, where workers manufacture goods or operate machines processing one product into another.", "Response": "Absolutely. Factories typically have lots of buildings and complex machines that do constant work. All the people and machine residue can make quite a mess."}
{"Context": "Factory work seems so dangerous and grueling. EOS Absolutely. Factories typically have lots of buildings and complex machines that do constant work. All the people and machine residue can make quite a mess. EOS yea its very heavy duty and monotonous work", "Knowledge": "Factories arose with the introduction of machinery during the Industrial Revolution when the capital and space requirements became too great for cottage industry or workshops.", "Response": "Speaking of, factories actually came about during the Industrial Revolution. An exciting time, but also a very dirty and unsanitary one as well as space requirements were a constant struggle"}
{"Context": "Factory work seems so dangerous and grueling. EOS Absolutely. Factories typically have lots of buildings and complex machines that do constant work. All the people and machine residue can make quite a mess. EOS yea its very heavy duty and monotonous work EOS Speaking of, factories actually came about during the Industrial Revolution. An exciting time, but also a very dirty and unsanitary one as well as space requirements were a constant struggle EOS Yea and not only was it hard and dangerous but they had kids working them as well", "Knowledge": "Most modern factories have large warehouses or warehouse-like facilities that contain heavy equipment used for assembly line production.", "Response": "Glorified sweatshops, yes. Modern factories have large warehouses and assembly lines, but back then it was all labo intensive"}
{"Context": "Factory work seems so dangerous and grueling. EOS Absolutely. Factories typically have lots of buildings and complex machines that do constant work. All the people and machine residue can make quite a mess. EOS yea its very heavy duty and monotonous work EOS Speaking of, factories actually came about during the Industrial Revolution. An exciting time, but also a very dirty and unsanitary one as well as space requirements were a constant struggle EOS Yea and not only was it hard and dangerous but they had kids working them as well EOS Glorified sweatshops, yes. Modern factories have large warehouses and assembly lines, but back then it was all labo intensive EOS Yea some of them required much more attention to detail.", "Knowledge": "Large factories tend to be located with access to multiple modes of transportation, with some having rail, highway and water loading and unloading facilities.", "Response": "Yup and, of course, transportation. Most large factories are usually near multiple nodes of transport such as rail, highway, or water docks"}
{"Context": "hi, do you like football?", "Knowledge": "Crochet (; ) is a process of creating fabric by interlocking loops of yarn, thread, or strands of other materials using a crochet hook.", "Response": "Trying to learn how to crochet with yarn and thread"}
{"Context": "hi, do you like football? EOS Trying to learn how to crochet with yarn and thread EOS oh cool. my grandma used to do that. i wish i'd learned that from her. she showed me how to do it", "Knowledge": "The name is derived from the French term \"crochet\", meaning 'small hook'.", "Response": "The word crochet translates from french to mean little hook lol"}
{"Context": "hi, do you like football? EOS Trying to learn how to crochet with yarn and thread EOS oh cool. my grandma used to do that. i wish i'd learned that from her. she showed me how to do it EOS The word crochet translates from french to mean little hook lol EOS but you use two hooks, right?", "Knowledge": "These are made of materials such as metal, wood, or plastic and are manufactured commercially and produced in artisan workshops.", "Response": "Yes two hooks and they are made of wood or metal"}
{"Context": "hi, do you like football? EOS Trying to learn how to crochet with yarn and thread EOS oh cool. my grandma used to do that. i wish i'd learned that from her. she showed me how to do it EOS The word crochet translates from french to mean little hook lol EOS but you use two hooks, right? EOS Yes two hooks and they are made of wood or metal EOS ok, i guess it's relaxing?", "Knowledge": "It was used in 17th-century French lace making, \"crochetage\" designating a stitch used to join separate pieces of lace, and \"crochet\" subsequently designating both a specific type of fabric and the hooked needle used to produce it.", "Response": "Yes and crocheting was used in 17th century France to make lace"}
{"Context": "hi, do you like football? EOS Trying to learn how to crochet with yarn and thread EOS oh cool. my grandma used to do that. i wish i'd learned that from her. she showed me how to do it EOS The word crochet translates from french to mean little hook lol EOS but you use two hooks, right? EOS Yes two hooks and they are made of wood or metal EOS ok, i guess it's relaxing? EOS Yes and crocheting was used in 17th century France to make lace EOS back in olden days i get ti but why would anybody do it in current year?", "Knowledge": "\"Not to be confused with Crotchet, the common name for a Quarter note in music.\"", "Response": "Not sure? But don't confuse the name with the musical note lol"}
